[
  {
    "title": "\n            Province invites proposals for new 264th Street Interchange\n        ",
    "resolutionId": null,
    "contents": "\n            LANGLEY – Three shortlisted teams have been invited by the Province to participate in a request for proposals to design and build a new 264th Street Interchange, a key component of improvements to Highway 1 between 264th Street and Mt. Lehman Road.“The new 264th Street Interchange is essential for more efficient goods movement in our economy, given the Trans-Canada Highway’s importance to the provincial and national supply chain,” said Rob Fleming, Minister of Transportation and Infrastructure. “These improvements are also critically important to create capacity for rapid public-transit service throughout the Fraser Valley region.”The teams invited to submit proposals to enter into a design-build agreement with the Province are, in alphabetical order:\n\tAecon-Norland General Partnership: A general partnership between Aecon Constructors, a division of Aecon Construction Group Inc. and Norland Projects Limited; \n\tKEA Fraser Valley Connectors: A joint venture between Kiewit Infrastructure BC ULC and Emil Anderson Construction (EAC) Inc.; and\n\tMetro Vancouver (Infrastructure) Partnership: A joint venture between Jacob Bros. Construction Inc., BD Hall Constructors Corp., and EBC Inc.\nFollowing an evaluation of submissions, the Province will choose the project's design-build team. Construction will begin in late 2024.The 264th Street Interchange area is highly travelled during morning and afternoon hours, including a high volume of commercial vehicles heading to and from the border crossing. Along with allowing more efficient goods movement, the new interchange will include improvements for active transportation, truck parking and public transit.“We are making the infrastructure improvements necessary to support future growth in the Fraser Valley,” said Dan Coulter, Minister of State for Infrastructure and Transit. “Advance work is already underway on Highway 1 east of 264th Street, which will support an upgraded 264th Street Interchange and highway widening as work progresses.”The 264th Street Interchange and associated highway widening is one of the three major construction contracts that make up Phase 3A of the Province’s Fraser Valley Highway 1 Corridor Improvement Program, a multi-phase program to improve goods movement and travel along Highway 1 in the Fraser Valley through the Sumas Prairie to Chilliwack.The other two contracts will be upgrades to the Mt. Lehman Interchange and 3.7 kilometres of highway widening, and replacement of the Bradner Road overpass with 3.9 kilometres of highway widening. These contracts will go to tender in spring 2024 ahead of the construction season. Completion of Phase 3A is expected in 2029.The widening of Highway 1 between 264th Street and Mt. Lehman Road has an approved budget of $2.3 billion.Learn More:More information on the Fraser Valley Highway 1 Corridor Improvement Program is available at: https://www2.gov.bc.ca/gov/content/transportation-projects/fraser-valley-highway1\n        ",
    "reportUrls": [],
    "date": "Dec. 20, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0211-002012.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0211-002012.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Richmond Hospital redevelopment reaches milestone\n        \n            What people are saying about Richmond Hospital redevelopment\n        \n            Richmond Hospital redevelopment phases\n        ",
    "resolutionId": null,
    "contents": "\n            RICHMOND – People in Richmond are accessing enhanced care as the newly refurbished and relocated cancer care clinic opens at Richmond Hospital.“The opening of the modernized cancer clinic marks a significant milestone toward strengthening our public health-care system and connecting people with the care they need in their own communities,” said Adrian Dix, Minister of Health. “The cancer clinic is part of the Richmond Hospital redevelopment project and is an example of work being done across the province to upgrade or expand hospitals, empowering health-care workers to continue to deliver people-focused services and high-quality care.”With work on Phase 1 well underway, renovations are wrapping up on the ground floor of the Milan Ilich Pavilion. They include the updated cancer-care clinic, which opened to patients on Nov. 27, 2023. It has two additional examination rooms and care bays, as well as a clinical teaching room.The Richmond Hospital cancer-care clinic is leading a transformative approach to cancer care through the innovative Remote Symptom Monitoring (RSM) system. Recognizing the emotional and physical toll of chemotherapy and the gaps in communication that can affect a patient’s well-being, the RSM will help provide timely access to clinicians and reduce reliance on emergency department visits for manageable symptoms. Enrolment to the system began in early December 2023, marking a significant step toward improving patients’ cancer care journey.Phase 2 of the updates to Richmond Hospital begins in spring 2024 with the issuing of a request for qualifications (RFQ) for the new Yurkovich Family Pavilion. Through the RFQ process, Vancouver Coastal Health will identify builders who will be invited to participate in a competitive request for proposals process. This stage will determine who will be chosen to lead design and construction. The pavilion will house an emergency department with 86 spaces, increased from 62, and add three operating rooms for a total of 11. The nine-floor facility’s pre- and post-surgical care spaces will grow from 26 to 69. The Pavilion will also contain an intensive-care unit, a fully equipped medical imaging department with four CT scanners and two MRI machines, a pharmacy, and short-stay pediatrics.Phase 3 of the project includes renovations to the south tower to create new in-patient psychiatry and psychiatric assessment units so existing services will be in one location and brought up to modern standards. The south tower will also have a maternity ward and neonatal intensive-care unit. The entire project is expected to be complete in 2031.The cost of the project is approximately $861 million and will be shared by the provincial government through Vancouver Coastal Health and Richmond Hospital Foundation.Richmond Hospital opened in 1966 and has 240 beds that serve Richmond, South Vancouver and Delta, as well as people using Vancouver International Airport and BC Ferries facilities. The six-floor north tower is home to surgical suites, medical imaging, a pharmacy, as well as administrative, academic and support services.  The hospital redevelopment project is the largest health-care investment in Richmond’s history. Two backgrounders follow.\n        \n            Aman Singh, MLA, Richmond-Queensborough –“The opening of the updated cancer care clinic in the Milan Ilich Pavilion at Richmond Hospital is a significant step to ensuring better access to cancer care for people in Richmond and Queensborough. The new transformative approach to cancer care will help people along the way in their cancer journey.”Henry Yao, MLA, Richmond South Centre –“As a cancer survivor, I know patients and families in Richmond will directly benefit from the opening of the updated cancer clinic, additional examination rooms and care bays at Richmond Hospital. These groundbreaking investments and people-focused health-care services strengthen cancer care, and bring peace of mind to patients who need it the most, and their loved ones.”Kelly Greene, MLA, Richmond-Steveston –“Today, we’re another step closer to making sure the people of Richmond can access high-quality acute care, including cancer care, in their own community. As Richmond’s population continues to grow and age, so does demand for health-care services. Our government is taking action to meet increasing demand by supporting the transformational redevelopment of Richmond Hospital.” Jo-Ann Tait, vice-president, Richmond community, Vancouver Coastal Health –“We’re pleased to open the new cancer-care clinic and continue with the next phase of the redevelopment at Richmond Hospital. This new clinic will transform the future of cancer care in the community and help Vancouver Coastal Health deliver the highest quality care possible for patients during their treatment journey. The successful transition to the new space is a testament to the commitment and hard work by our incredibly talented staff and physicians.”Dr. Kim Nguyen Chi, executive vice-president and chief medical officer, Provincial Health Services Authority –“We know how important it is to our patients and their loved ones to have access to medical oncology treatments and followup care close to home. As part of B.C.’s Community Oncology Network, Richmond Hospital’s expanded cancer-care clinic will better serve this growing city and complement the care we provide through our BC Cancer centres and community sites throughout the province.”Natalie Meixner, president and CEO, Richmond Hospital Foundation –“We are grateful that the new Cancer Care Clinic is now open for people in Richmond. We eagerly anticipate the construction of the Yurkovich Family Pavilion and are excited to joyfully celebrate this progress alongside our donors and the community. This will mark the beginning of a new era for Richmond health care.”\n        \n            Phase 1 \n\tRenovations to the Milan Ilich Pavilion.\n\tRelocation of services and demolition of Park Centre and Rotunda buildings.\n\tPark Centre was home to the cancer-care clinic and psychiatric emergency unit; the rotunda hosted offices and meeting rooms.\nPhase 2\n\tConstruction of the new 216-bed Yurkovich Family Pavilion, expected to be complete in 2029.\nPhase 3\n\tFocuses on south tower and Ilich Pavilion renovations.\nPhase 4\n\tDemolition of the north tower and power plant. The entire project is anticipated to be complete in 2031.\n\n        ",
    "reportUrls": [],
    "date": "Dec. 20, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0157-002013.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0157-002013.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            B.C. reinforcing manufacturing sector on Vancouver Island\n        ",
    "resolutionId": null,
    "contents": "\n            NANAIMO – New funding for manufacturing businesses on Vancouver Island will increase advanced manufacturing capabilities, make better use of available wood fibre in the forest sector and create and protect local jobs.“We’re working together with innovative manufacturing companies as they look to grow and bring long-term, sustainable jobs to communities throughout B.C.,” said Brenda Bailey, Minister of Jobs, Economic Development and Innovation. “By investing in companies as they upgrade and modernize, we’re also investing in strengthening local economies.”The Government of B.C. is contributing as much as $3.4 million through the BC Manufacturing Jobs Fund to help Nanaimo-based VMAC Global Technology Inc. grow its operations by establishing a new 465-square-metre (5,000 square feet) manufacturing facility. It also will help buy equipment to scale up the production of lightweight air compressors for the heavy-duty commercial electric vehicle (EV) market, including semi-trucks, buses and other specialized vehicles requiring air brakes and air suspension.VMAC’s technology allows for longer range and lower maintenance costs, enabling greater adoption among the commercial market and significantly reducing emissions. VMAC also incorporates circular economy elements into its operations by reusing aluminum and steel in production and maximizing the use of all raw materials. This project increases B.C.’s advanced manufacturing capabilities, aligns with CleanBC’s priorities to strengthen adoption and infrastructure of heavy-duty EVs, and creates 45 new jobs at VMAC.“As a successful manufacturing and export business in Nanaimo, with over 180 employees, VMAC is proud to provide high-quality local jobs and support various local suppliers in Nanaimo, on Vancouver Island and in B.C.,” said Brent Johnston, CEO, VMAC Global Technology Inc. “This has been VMAC’s driving purpose for the past 38 years and the support from the Province of British Columbia will enable us to continue this mission.”Two Island-based wood-product manufacturers are receiving funds from the BC Manufacturing Jobs Fund to grow their businesses, while creating and maintaining local jobs:\n\tPort Alberni – Franklin Forest Products Ltd. will receive as much as $425,000 to buy new equipment that will allow it to shift from processing old-growth logs to a broader range of log sizes and grades, helping the company protect 37 existing jobs and create five new ones; and\n\tChemainus – BioFlame Briquettes, which manufactures briquettes from waste sawdust and logging residual from the forestry industry, will receive as much as $117,320 to buy and commission a hammermill and briquette press that will increase fibre diversity and production at its facility, allow it to take logging waste directly from the forest to reduce wildfire risk and decrease risk of fibre supply uncertainty, and create four new jobs.\nThe BC Manufacturing Jobs Fund supports for-profit organizations to plan and launch shovel-ready, high-value industrial and manufacturing projects that bring direct benefits and stable, family-supporting jobs to communities, while driving clean and inclusive growth throughout the province.Building resilient economies is part of the Province’s work through the StrongerBC Economic Plan to build a strong and sustainable economy through clean and inclusive growth. Supporting B.C.’s manufacturing and agricultural sectors helps bring government closer to its goal of building a more innovative economy for people, businesses and communities throughout B.C.Quotes:Doug Routley, MLA for Nanaimo-North Cowichan –“Seeing homegrown companies like VMAC and BioFlame expanding their operations and creating new opportunities for local workers means the investments from the BC Manufacturing Jobs Fund are helping grow strong, sustainable economies.”Josie Osborne, MLA for Mid Island-Pacific Rim – “Franklin Forest Products has been employing people in Port Alberni for over 30 years and it’s really great news that it will be able to expand operations with new equipment and provide five more family-supporting jobs.”Mike McKay, president, Franklin Forest Products Ltd. – “Franklin Forest Products appreciates the financial support from the Province. The funds will help retool the operation to become less reliant on old-growth timber and protect the nearly 40 jobs in the Port Alberni community.”Marcus Woernle, CEO, BioFlame Briquettes – “Thanks to the BC Manufacturing Fund, BioFlame is able to acquire the necessary equipment to transform low-value wood waste into densified biomass. This waste includes construction and logging residue, allowing BioFlame to increase production and meet demand.”Learn More:Learn about the BC Manufacturing Jobs Fund: https://gov.bc.ca/ManufacturingJobsFund  Learn about the StrongerBC Economic Plan: https://strongerbc.gov.bc.ca/planLearn about the CleanBC Roadmap to 2030: https://cleanbc.gov.bc.ca\n        ",
    "reportUrls": [],
    "date": "Dec. 20, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023JEDI0074-002011.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023JEDI0074-002011.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New housing underway for women leaving violence in Nanaimo\n        ",
    "resolutionId": null,
    "contents": "\n            NANAIMO – Women and their children leaving violence in and around Nanaimo will soon have access to 47 safe spaces as construction starts on a new transitional and second-stage housing development.“Safe housing is fundamental for women, gender-diverse people, and their children who are reshaping their lives after experiencing violence or trauma,” said Ravi Kahlon, Minister of Housing. “These new safe spaces will be instrumental in providing safety, security and peace of mind for families across Nanaimo. We will continue to work in partnership with organizations like the Haven Society to provide the safety, supports and services that can help rebuild people’s lives.”The four-storey, wood-frame building will provide 30 self-contained second-stage housing units with their own bathroom and kitchen, as well as 10 rooms with a total of 17 transition beds for short-term stays. Three second-stage housing units and one transition room will be wheelchair accessible.The housing will be operated by Haven Society, which supports adults and children leaving gender-based violence. This new building will replace an ageing 17-unit transition home operated by Haven Society. Once construction is finished, Haven will transfer its services and programming to the new building, which has a communal kitchen, amenity room and expanded programming spaces. The building is also close to public parks and a public recreation centre.“No one should feel unsafe in their home and their community. Yet too many women and gender-diverse people continue to face obstacles after leaving intimate-partner violence,” said Kelli Paddon, Parliamentary Secretary for Gender Equity. “These new transition and second-stage homes will offer much-needed support through programming and living arrangements to survivors and their children as they work to rebuild their lives in a safe and compassionate space.”Transition housing provides safe, temporary shelter with supports for people who need a place to go after leaving a violent or abusive situation. After a stay in a transition house, guests can move to second-stage housing for approximately six to 18 months before moving to more permanent housing in the community. Second-stage housing includes services to help women rebuild their independence, including support groups, system navigation and individualized assistance.Construction is expected to be completed in fall 2024.This project is part of a $19-billion housing investment by the B.C. government. Since 2017, the Province has more than 77,000 homes that have been delivered or are underway, including more than 1,600 homes in Nanaimo.Quotes:Sheila Malcolmson, MLA for Nanaimo, and Minister of Social Development and Poverty Reduction – “Women and children fleeing violence need safe housing for a new start. Partnering with Nanaimo’s beloved Haven Society, our government is providing much-needed housing to help stabilize and heal after violence, so that women and their children are able to put down roots and look forward to a more secure future.”Daylene Jones, executive director, Haven Society –“With the rental market in Nanaimo having only a 2.2% vacancy rate, finding affordable housing for women and families leaving violence is incredibly difficult. The addition of these second-stage units will help immensely in the transition from leaving abuse to finding long-term security and stability.”Leonard Krog, mayor of Nanaimo –“Council is incredibly grateful and pleased to welcome this very significant and much-needed housing. Gender-based violence is a serious issue. Haven Society will be better able to deliver their valuable services and supports with this new facility.”Quick Facts:\n\tThe Province, through BC Housing, is providing $17.5 million through the Building BC: Women’s Transition Housing Fund for the land and construction of the building.\n\tResidents of the second-stage home will pay either 30% of their income for rent or, for those receiving income or disability assistance, the provincial shelter rate.\n\tTransition homes guests will not be charged rent.\n\tAs is generally the case for projects that support women and children leaving violence, the address of this project has not been disclosed for safety reasons.\nLearn More:To learn more about government’s new Homes for People action plan, visit: https://news.gov.bc.ca/releases/2023HOUS0019-000436To learn about the steps the Province is taking to tackle the housing crisis and deliver affordable homes for people in British Columbia, visit: https://strongerbc.gov.bc.ca/housing/\n        ",
    "reportUrls": [],
    "date": "Dec. 20, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0181-002004.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0181-002004.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Red Chris Porphyry Copper-Gold Mine fined $25,000 for non-compliance\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The Environmental Assessment Office (EAO) issued an administrative penalty totalling $25,000 to Newmont Corporation (formerly Newcrest Red Chris Mining Limited) on Dec. 18, 2023.The company was fined for not complying with an order in 2019 for Newcrest Red Chris Mining Limited to install and electrify fencing around the full perimeter of the workcamp for its Red Chris Porphyry Copper-Gold Mine in northeastern B.C., as required.Electric fencing helps prevent dangerous interactions between people and wildlife, specifically in this case, grizzly bears, a blue-listed species of special concern in British Columbia. Project records show frequent grizzly bear activity in the area and at least two instances of problematic human/bear interactions in or around the camp.Multiple inspections of the project by EAO compliance and enforcement officers, going back as far as 2018, found repeated non-compliance with fencing requirements, including incomplete, not electrified or not operational fencing. The EAO has issued multiple warnings and orders.The deficiencies were rectified after the EAO ordered Newcrest again in July 2023 to have functioning electric fencing in place around the entire workcamp perimeter within 30 days or the workcamp would be shut down. An additional administrative penalty has been recommended related to the ongoing non-compliance and subsequent 2023 order, but a decision is still pending.While urgent issues identified during inspections that pose an immediate risk are addressed right away through enforcement tools such as warnings and stop-work orders, project operators may also be subsequently subject to financial penalties.The EAO takes compliance seriously. When a project receives an environmental assessment certificate, it contains legally binding requirements that must be followed for the life of the project. These requirements are intended to prevent negative environmental, social, cultural, health or economic impacts and impacts to First Nations.As a neutral regulator, the EAO has a team of compliance and enforcement officers who monitor all certified projects, conducting both routine and spot inspections and taking enforcement action as necessary. This helps ensure that projects are built, operated and decommissioned in compliance with all requirements.The EAO continues to actively monitor the Red Chris mine to make sure all requirements are being met.Quick Facts:\n\tThe Red Chris Porphyry Copper-Gold Mine is located 18 kilometres southeast of the Village of Iskut and approximately 80 kilometres south of Dease Lake.\n\tNewmont Corporation acquired Newcrest Red Chris Mining Limited in November 2023.\n\tThe project received an environmental assessment certificate in 2005, one of the key authorizations required to build and operate the mine.\n\tThe approval included a requirement to implement specific measures to prevent or reduce the potential for adverse impacts to bears at the site.\n\tProject construction began in 2012 and the mine opened and began extracting ore in 2015.\nLearn More:For information about the administrative penalty, go to:\nhttps://www.projects.eao.gov.bc.ca/p/588510c4aaecd9001b8155e3/documents?keywords=RCDC-EF-2023&sortBy=-score&currentPage=1For information about the Red Chris Porphyry Copper-Gold Mine project, go to: https://projects.eao.gov.bc.ca/projects-list and search “Red Chris”For more information about the environmental assessment process, visit: \nhttps://www2.gov.bc.ca/gov/content/environment/natural-resource-stewardship/environmental-assessments/the-environmental-assessment-process\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ENV0073-002008.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ENV0073-002008.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Repairs coming to Canal Road on South Pender Island\n        ",
    "resolutionId": null,
    "contents": "\n            PENDER ISLAND – A section of Canal Road on South Pender Island damaged during the heavy rain and flooding in November 2021 will soon be repaired, improving safety and reliability for residents and visitors.A tender for the repair project has been posted to BC Bid. Work is expected to begin in February 2024, including:\n\tclearing, rock blasting and offloading the existing slide and roadway;\n\trealigning the road onto solid bedrock;\n\tupsizing the existing culvert;\n\tinstalling a reinforced retaining wall; and\n\tbuilding a temporary barge landing facility at Boundary Passage Drive to transport equipment and materials.\nThe damaged section of road is approximately 2.5 kilometres east of Pender Canal Bridge, the link between North Pender Island and South Pender Island. Permanent repairs will increase the road’s resilience in future extreme rain events, helping island residents safe and connected.Safety measures were implemented following the flooding damage to the road, including single-lane-alternating traffic with timed signals at each end of the site, slope deformation monitors to track earth movement and load restrictions during and after significant rain events.Crews will continue to monitor road deformation and perform necessary maintenance throughout the project.Additional federal environmental permitting has been secured due to the project’s proximity to the Gulf Islands National Park Reserve. Revegetation and mitigation measures will be in place following construction.Single-lane-alternating traffic will remain in place for the duration of the work. Drivers should expect delays, including intermittent road closures for up to four hours. All efforts will be made to minimize traffic disruptions during peak travel times. Advance notice of traffic disruptions will be provided via DriveBC.Drivers are reminded to drive for the conditions, observe construction-zone speed limits and follow the direction of traffic-control signs and personnel.Updates will be available at @DriveBC on X (Twitter) and online: https://DriveBC.ca\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0210-002006.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0210-002006.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Minister’s statement on major forfeiture of PacNet assets\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Mike Farnworth, Minister of Public Safety and Solicitor General, has released the following statement regarding the B.C. Civil Forfeiture Office’s single largest forfeiture in the history of the program:“Today, the B.C. Civil Forfeiture Office has concluded proceedings that will result in the forfeiture of $10 million from PacNet Services Ltd., a money-service business that was headquartered in B.C. and provided payment-processing services, including to individuals found guilty of or alleged to be running fraudulent scams against vulnerable seniors and other persons in Canada and around the world.“This is the single largest forfeiture of assets in the history of the civil forfeiture program. I wish to specially acknowledge the work of the Vancouver Police Department which investigated PacNet and referred the matter to the Civil Forfeiture Office, as well as the financial intelligence provided by the Financial Transactions and Reports Analysis Centre of Canada (FINTRAC) which supported this process.“I can confirm that we will continue to pursue the forfeiture of assets that are suspected to be proceeds of unlawful activity and redirect them to community safety and crime-prevention initiatives. This major forfeiture sends a clear message that British Columbia will continue to take decisive action against suspected proceeds of unlawful activity.“PacNet Services Ltd. will forfeit the $10 million pursuant to a settlement agreement with the director of civil forfeiture, under which there has been no admission or finding of unlawful activity on the part of PacNet Services Ltd. or its principals.”Quick Fact:\n\tThe filed Fifth Further Amended Notice of Civil Claim and the filed Consent Forfeiture Order can be found on Court Services Online by referencing Supreme Court of British Columbia Vancouver Registry #S-18260.\n\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0093-002007.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0093-002007.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Mental-health, substance-use supports available during holiday season\n        \n            What to know about available mental-health, substance-use supports\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – While the holiday season is a time for celebrations, it can also be a time of year when people may feel lonely, stressed or triggered.The past few years have been difficult for people due to global unrest, the lasting impacts of natural disasters and the pandemic. On top of this, people in B.C. continue to lose friends, family and community members to unrelenting toxic-drug poisonings.These challenges can adversely affect people’s mental health. If you are struggling emotionally or if you know someone who is, please reach out for help. Crisis supports and resources are available online, over the phone and in person.People continue to be affected by the devastating effects of the poisoned-drug supply. It is a very dangerous time for people who use illicit street drugs. It is important that those who use drugs get them tested and do not use alone. The Province has a wide range of life-saving services available, such as drug checking, supervised-consumption sites, prescribed pharmaceutical alternatives, treatment and recovery, and more.The Province has expanded mental-health and substance-use care to meet people where they are at, no matter where they are in their journey, so they can connect to the care that is right for them. If you or someone you know is struggling this season and beyond, please know that care is available.Learn More:To learn about mental-health and substance-use supports in B.C., visit: https://helpstartshere.gov.bc.ca/For more information and resources for youth in B.C., visit: https://poisondrugs.gov.bc.ca/To read A Pathway to Hope roadmap, government’s plan to build an integrated system of mental-health and addictions care for people in B.C., visit: https://news.gov.bc.ca/files/BCMentalHealthRoadmap_2019.pdfA backgrounder follows.\n        \n            The holiday season is a time to enjoy and celebrate and it’s also a time to take special care of your mental health and the mental health of those close to you. If you need support during the holidays or any time of the year, please reach out. Help is available.Guides to mental-health and substance-use services:\n\tProvince of B.C. online guide for finding mental-health and substance-use supports is available at:  https://helpstartshere.gov.bc.ca/\n\tProvince of B.C. online guide for virtual mental-health supports is available at: https://gov.bc.ca/MentalHealthSupports\nCrisis and suicide helplines:Canada’s suicide-crisis helpline: 988 (call or text). A safe space to talk, 24 hours a day, every day of the year.Crisis intervention and suicide-prevention centre: \n\tConfidential, non-judgmental, free emotional support for people experiencing feelings of distress or despair, including thoughts of suicide.\n\tCall 1 800 SUICIDE (784-2433) or visit: https://crisiscentre.bc.ca/\nKUU-US crisis-response service: \n\t24/7, culturally aware crisis support for Indigenous people in British Columbia.\n\tCall 1 800 588-8717 or visit: https://www.kuu-uscrisisline.com/​\nOverdose prevention:LifeGuard app:\n\tThe app utilizes a 50-second timer activated by the person using drugs before taking their dose. If the user does not stop the timer alarm, a text-to-voice call will go to 911 alerting medical dispatchers of a potential overdose.\n\tDownload the app at: https://lifeguarddh.com/\nProvince of B.C. overdose prevention website: To learn about services and strategies to prevent overdoses, visit: https://www2.gov.bc.ca/gov/content/overdose/what-you-need-to-know/overdose-preventionNational overdose response service (NORS):\n\tOffers access to harm reduction and social support through a telephone line. The line is operated by persons with lived and living experience of substance use to support individuals who are using alone.\n\tCall 1 888 688-6677 or visit: https://www.nors.ca\nMental-health and substance-use services, supports and referrals:Urgent and primary care centres:\n\tMental-health and substance-use support can be found at urgent and primary care centres in 31 locations throughout B.C. where clinicians are available 365 days a year for same-day access.\n\tTo know more, visit: https://www.healthlinkbc.ca/health-services/urgent-and-primary-care-centres\nAlcohol and drug information and referral service:\nCall toll-free 1 800 663-1441 or 604 660-9382 (Lower Mainland) to find resources, supports and referrals.First Nations virtual doctor of the day:\n\tVirtual doctors can provide referrals to the virtual substance-use and psychiatry service.\n\tCall 1 855 344-3800 to book an appointment.\nHealthLinkBC mental-health learning centre: \nCall 811 (24/7) or visit: www.healthlinkbc.ca/mental-health-substance-use/mental-health  Counselling by community: \n\tFree or low-cost counselling is provided through community-based organizations in all parts of B.C.\n\tTo find an organization near you, visit: https://caibc.ca/ccfprofiles/\nPhone and virtual counselling and mental-health supports:B.C. mental-health support phone line:\n\t24/7 confidential emotional support, information and referrals.\n\tCall 310-6789 (no area code needed).\nBounceBack: \n\tFree online, video and phone-based skills-building program for seniors, adults and youth (13 years and older) experiencing low moods, mild to moderate depression, anxiety, stress or worry.\n\tFor more information, visit: https://bouncebackbc.ca\nProvince of B.C. online guide for virtual mental-health supports is available at: https://gov.bc.ca/MentalHealthSupportsChildren and youth programs and services:Here2Talk:\n\tConfidential, free counselling and referral services by app, phone or online chat available for all registered post-secondary students, 24 hours a day, seven days a week.\n\tCall 1 877 857-3397, or 1 604 642-5212 for students calling from outside of Canada (international calling charges may apply).\n\tTo know more, visit: https://here2talk.ca/\nKidsHelpPhone:\n\tImmediate counselling, support, information and referrals available 24/7.\n\tYouth can call 1 800 668-6868 or text TALK to 686868. Texting support for adults is available by texting TALK to 741741.\n\tTo know more, visit: https://kidshelpphone.ca/\nFoundry:\n\tFoundry virtual services are available provincewide for people 12-24 and their caregivers.\n\tServices include counselling, primary care, peer support and group sessions.\n\tAll services are free and confidential.\n\tCall 1 833 FOUNDRY (308-6379) or visit: https://foundrybc.ca/virtual/\nFamilySmart:\n\tProvides emotional support, information, resources and help in navigating services for parents and caregivers of a child, youth or young adult with a mental health and/or substance-use challenge.\n\tTo know more, visit: https://familysmart.ca/\nMinistry of Children and Family Development: \n\tSupports all children, youth and families in British Columbia to live safe and healthy lives, and provides programs and services to support child and youth mental health.\n\tTo find a child and youth mental-health intake clinic near you, visit: https://gov.bc.ca/ChildYouthMentalHealthIntakeClinics\nEASE (Everyday Anxiety Strategies for Educators) At Home:\n\tFree anxiety activities and resources for B.C. parents, caregivers and families to help children manage worries and everyday anxiety at home. \n\tView or download these activities for grades K-7 at: https://healthymindsbc.gov.bc.ca/ease-at-home-k-7/ or for grades 8-12 at https://healthymindsbc.gov.bc.ca/ease-at-home-8-12/\nKelty mental-health resource centre: \n\tFree mental-health and substance-use information, resources and peer support for B.C. parents, caregivers and families of children and youth.\n\tCall 1 800 665-1822 or visit: https://keltymentalhealth.ca/\nConfident Parents: Thriving Kids:\n\tTelephone-based skill-building programs offered through the Canadian Mental Health Association – B.C. Division to support parents with children aged 3-12 experiencing behavioural or anxiety challenges.\n\tTo know more, visit: https://welcome.cmhacptk.ca/\nBig Worries, Strong Spirit:\n\tThe We are Indigenous support program is a free telephone-coaching program supporting First Nations, Metis and Inuit families in B.C., whose children aged 3-12 years are struggling with the experience of big worries or fears.\n\tBuilding off the success of Confident Parents: Thriving Kids anxiety program, the program was guided, created and developed through Indigenous perspectives for Indigenous families.\n\tTo know more, visit: https://welcome.cmhacptk.ca/bigworries. \nYouth substance-use treatment services: For information on how to access youth-focused substance-use treatment beds, including information on referral and facility locations throughout the province, visit: https://gov.bc.ca/youthsubstanceusecareY Mind and Mind Medicine:\n\tA free seven-week early-intervention program for people 13-30 experiencing mild to moderate anxiety.\n\tTo know more, visit: https://www.ymca.ca/ymind\nSupports for seniors:BC211: Phone or text 211 - Seniors looking for help or people would like to volunteer to help seniors, including virtual or telephone visits, visit: https://www.bc211.ca/Supports for frontline workers:Care to Speak:\n\tPeer support for B.C. healthcare workers.\n\tTo access support, call 1 866 802-7337 (PEER) or visit: https://careforcaregivers.ca/caretospeak/  \nCare for Caregivers:\n\tMental-health support for health-care providers, including trusted information, free workshops to support employees and quick daily-coping tips.\n\tTo know more, visit: https://www.careforcaregivers.ca/\nMobile response team (MRT):\n\tMental-health support for health-care workers in long-term care facilities and those working on the frontlines of the overdose public health emergency.\n\tCall 1 888 686-3022 or email MRT@phsa.ca\nOnline mental-health hub:\n\tProvides information, webinars and workshops to help employees manage stress and build resilience.\n\tTo know more, visit: https://www.workmentalhealthbc.ca/\nTreatment and recovery services:Province of B.C. guide to treatment and recovery services is available at: https://www2.gov.bc.ca/gov/content/overdose/what-you-need-to-know/recovery-services-treatment-support\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MMHA0079-002005.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MMHA0079-002005.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Cache Creek crossing restoration moving ahead\n        ",
    "resolutionId": null,
    "contents": "\n            CACHE CREEK – Travellers passing through Cache Creek will soon have a safer, more reliable journey, with work about to begin on the Cache Creek Crossing Restoration Project. The Highway 97 Cache Creek Crossing Restoration Project includes the installation of a bridge to replace the culvert under Highway 97 where it crosses Cache Creek. The new four-lane bridge will be designed to handle peak river flows and debris, especially during spring freshet. It will accommodate increases in peak water flows caused by climate change and will be built to ensure structural stability against erosion.In addition to improving travel for Cache Creek residents, the upgrades will improve the resilience and reliability of the vital Highway 97 corridor.A $5.4-million contract for the project was awarded to Acres Enterprises Ltd. Work is scheduled to be complete by Aug. 31, 2024.Preparation work is underway and will include the relocation of a watermain in advance of bridge construction. During the coming months, construction crews will continue work at the site, such as construction of the bridge and realigning and widening the creek.Travellers are advised to watch for construction and traffic personnel.Learn More:For real-time updates, check the DriveBC website: https://www.drivebc.caFor more information about the project, visit: https://www2.gov.bc.ca/gov/content/transportation-projects/other-transportation-projects/cache-creek-crossing\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0209-002003.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0209-002003.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Parliamentary secretary’s statement on International Day to End Violence Against Sex Workers\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Kelli Paddon, Parliamentary Secretary for Gender Equity, has released the following statement in recognition of the International Day to End Violence Against Sex Workers:“Today, people worldwide rally for an end to violence against sex workers. Today, also known as Red Umbrella Day, is an important reminder that violence against people doing sex work remains prevalent in communities throughout B.C.“All people have a right to be treated with respect and dignity, to be safe in their homes and workplaces, to be free from violence and with equal access to supports and justice.“But we also know that there is far too much stigma, discrimination and violence against sex workers.“Last week, we released Safe and Supported: B.C.’s gender-based violence action plan, which includes support for bad-date reporting to create a system for sex workers to anonymously share reports of violent clients or negative incidents, helping to keep others safe.“Earlier in December, I visited the WISH Drop-In Centre Society, one of the community-based service providers that collaborates on the bad-date project along with Living in Community, PACE Society, Peers Resource Society and SWAN Vancouver. I’d like to recognize the important work of these organizations, along with so many others, for being there for sex workers and advocating for their safety and well-being.“On this day and every day, I encourage all British Columbians to speak out against discrimination, violence, oppression and stigmatization.“We are all so much stronger when we come together to raise awareness, lift up the voices of those with lived experience and address the critical issues that impact the most vulnerable in our communities.“On this important day, I join thousands in voicing my support for sex workers, their families and friends in calling for an end to the violence that remains all too prevalent here in B.C. and communities throughout the world.”Learn More:To learn about Bad Date & Aggressor Reporting Program (BC BDAR), visit: https://bcbdar.org/\n        ",
    "reportUrls": [],
    "date": "Dec. 17, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023FIN0074-001997.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023FIN0074-001997.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Expanded care coming to Burnaby Hospital\n        \n            What people are saying about the Burnaby Hospital redevelopment\n        ",
    "resolutionId": null,
    "contents": "\n            BURNABY – People in Burnaby are one step closer to getting expanded patient care as the Burnaby Hospital redevelopment moves forward with the structural building and concrete pouring completed.“We are marking an important milestone of the new six-storey Phase 1 pavilion of the Burnaby Hospital redevelopment project,” said Adrian Dix, Minister of Health. “It’s exciting to see the progress as this project will support our ongoing work to strengthen health care in British Columbia and provide people in Burnaby and the surrounding communities improved access to care in a modern hospital.”Completion of the structural work means the focus will shift to finishing the building’s exterior and interior.Phase 1 of the Burnaby Hospital redevelopment includes the construction of the new pavilion and the expansion and renovations of the existing Support Facilities Building. The pavilion will include maternity, neonatal intensive care, mental health in-patient and medical in-patient units. The estimated completion date for the new pavilion is 2025.“As we celebrate this milestone in the redevelopment of Burnaby Hospital, I will continue to work hard with our government to ensure people have access to care in the community, which is critical,” said Anne Kang, MLA for Burnaby-Deer Lake. The expansion and renovations of the Support Facilities Building, which includes the Jim Pattison Surgery Centre and the Burnaby Community Emergency Department, will feature 10 new or upgraded state-of-the-art operating rooms, renovations to the emergency department and a new energy facility.This announcement builds on the recently approved Phase 2 of the Burnaby Hospital redevelopment, which will add a new 160-bed inpatient tower and integrated cancer centre, which will include 54 ambulatory care rooms, 31 chemotherapy chairs, space for five linear accelerators, space for 2 PET/CT scanners, an oncology pharmacy, and clinical trials and research space.The redevelopment project will result in 399 beds across the campus.“I am pleased to celebrate this significant project milestone at Burnaby Hospital, which has been the heart of health care in this community for over 70 years,” said Dr. Victoria Lee, president and CEO, Fraser Health. “This redevelopment will add capacity to our hospital and bring in state-of-the-art equipment, enabling our staff and medical staff to provide high-quality care to our patients for many years to come. Thank you to our staff and medical staff who are epitomizing agility and innovation as they move this work forward.”The total cost of the redevelopment is more than $2.4 billion with funding from the Province, Burnaby Hospital Foundation and BC Cancer Foundation.“Our community came together in such a strong way by helping raise over $30 million to support Phase 1 of this redevelopment. I am certain that every one of our donors who contributed to this first step in our redevelopment is pleased to see the progress of the project, marked by this ceremonial event,” said Kristy James, president and CEO, Burnaby Hospital Foundation. “The foundation shares our gratitude to all our donors, including exceptional support from the Beedie family, Jim Pattison and the City of Burnaby that have inspired us all.”Burnaby Hospital opened in 1952. It provides a range of acute care services, including emergency care, critical care, surgery, maternity, neonatal intensive care, palliative and adult mental-health and substance-use services.Learn More:To learn more about Burnaby Hospital Redevelopment, visit: https://www.fraserhealth.ca/your-community/burnaby/burnaby-hospital-redevelopment-projectA backgrounder follows.\n        \n            Raj Chouhan, MLA for Burnaby-Edmonds –“This occasion is testament to the collaborative efforts of our partners and the community to make sure people have access to care in a fully redeveloped and modern hospital for decades to come.”Katrina Chen, MLA for Burnaby-Lougheed –“Health care is key to the well-being of our community. I am honoured to support this redevelopment project as we ‘top off’ this facility and continue to work together to provide more quality public health-care services.”Janet Routledge, MLA for Burnaby-North – “This is a significant step for people in Burnaby as we move forward on redeveloping Burnaby Hospital, and I thank all of our partners for working so hard for the community and I look forward to further critical and exciting project milestones.”Mike Hurley, mayor, Burnaby – “For more than 70 years, Burnaby residents have relied on the outstanding care provided by physicians and staff at the Burnaby Hospital. This redevelopment project will ensure that we can continue to meet the health-care needs of our community for generations to come.”\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0155-002001.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0155-002001.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New affordable homes coming for First Nations in Merritt\n        ",
    "resolutionId": null,
    "contents": "\n            MERRITT – First Nations families, elders and youth in Merritt will have access to more affordable rental homes, with construction underway on a 52-unit development.“People thrive when they can live in the community they know, close to their family and friends,” said Ravi Kahlon, Minister of Housing. “Our government is proud to support the Nicola Bands to build housing in their communities. These 52 new homes will play a key role in helping many elders, youth and families build good lives, and we will continue to work with Indigenous partners to build on- and off-reserve housing.”  The new four-storey building, located at 2640 Spring Bank Ave., will help address the housing needs for First Nations community members from five Nicola Bands: Upper Nicola Band, Lower Nicola Indian Band, Coldwater Indian Band, Nooaitch Indian Band and Shackan Indian Band. It will feature a mix of studio and one-, two- and three-bedroom units. Thirty-six of the 52 units will either be accessible or adaptable to accommodate current and changing accessibility needs. Each unit will have a private balcony.The Nicola Native Lodge Society is providing the land for the project and will manage the housing. The development will accommodate intergenerational living, such as elders and youth in the same building, which is aligned with the society’s vision for culturally safe housing. The building will also feature an amenity space for social gatherings and cultural ceremonies.Construction is expected to be completed by spring 2025.This project is part of a $19-billion housing investment by the B.C. government. Since 2017, the Province has more than 77,000 homes delivered or underway, including approximately 170 homes in Merritt.Quotes:Arnie Lampreau, Chief, Shackan Indian Band –“This project was a dream of many of our Nlaka’pamux Elders and leaders, many of whom have passed away and never saw the dream become a reality. The thought of going outside Nicola Valley was one of the fears of our people. This is a chance for the future people to retire and have a safe place to live.”Stuart Jackson, Chief, Lower Nicola Indian Band –“It is with great pleasure that this project has come to fruition. Housing shortages are a crisis in our communities and this project will help alleviate some of these challenges. I raise my hands to all the people behind the scenes who turned this dream into a reality. Huxme’l knee.”Sharon Stone, board director, Shackan Indian Band –“We recognize housing has an impact on many First Nations people. We need a place to call home, a sense of belonging, a sense of identity to be grounded to, and walk among the living plants, trees, rocks and water. Once we feel this, we will be at peace with ourselves, family and connected to one another.”John Aldag, Member of Parliament for Cloverdale-Langley City on behalf of Sean Fraser, federal Minister of Housing, Infrastructure and Communities –“Investing in affordable housing is more important than ever. Through the partnership with the Government of British Columbia, people of all ages will have access to housing so they can remain in their community. This project announced today is just one example of what we can achieve with our partners. I look forward to the completion of these housing projects and the positive impact it will have in our community.”Michael Goetz, mayor of Merritt –“We are thrilled to welcome such a distinctive and inclusive affordable housing project like the Spring Bank multi-unit development within our community. This project will not only bring much needed housing to the community, but it will also bring us one step closer to building a more integrated and supportive community that embraces our diverse cultures and honours the spirit of reconciliation.”Quick Facts:\n\tThe Province, through BC Housing, is contributing approximately $10 million to the project through the Building BC: Indigenous Housing Fund.  \n\tA joint contribution of approximately $1.3 million, through the Canada-British Columbia Bilateral Agreement under the National Housing Strategy, also went toward the project.\n\tBudget 2023 added approximately $1.3 billion to the Indigenous Housing Fund, for a total of approximately $1.8 billion to build 3,500 units of social housing for Indigenous Peoples on and off reserve.\n\tCanada’s National Housing Strategy is a 10-year, $82-plus billion plan that will give more people in Canada a place to call home.  \nLearn More:To learn about B.C.’s new Homes for People action plan, visit: https://news.gov.bc.ca/releases/2023HOUS0019-000436To learn about the steps the Province is taking to tackle the housing crisis and deliver affordable homes for people in British Columbia, visit: https://strongerbc.gov.bc.ca/housing/To find out about the National Housing Strategy, visit: https://www.placetocallhome.ca/For information about Canada Mortgage and Housing Corporation, visit: https://www.cmhc-schl.gc.ca/\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0180-001999.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0180-001999.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            B.C. supports implementation of emergency management act, keeping people safe\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Under B.C.’s new emergency management legislation, people and communities are safer and better prepared for the increasingly severe emergencies and disasters the province is experiencing due to climate change.The work of an expert task force on emergencies is also well underway and will reinforce the legislation by providing action-oriented recommendations in advance of the 2024 wildfire season. B.C.’s newly enshrined Emergency and Disaster Management Act is focused on disaster risk reduction and enhanced emergency preparedness, and recognizes Indigenous Peoples’ inherent rights of self-government in relation to emergency management.“In B.C., summers are getting hotter, winters are getting more unpredictable, and flooding is becoming more severe. The new Emergency and Disaster Management Act places a greater emphasis on mitigating the impacts of emergencies before they happen,” said George Heyman, acting Minister of Emergency Management and Climate Readiness, and Minister of Environment and Climate Change Strategy. “We’re working with First Nations and local governments to ensure our collective readiness against climate-related hazards, but time is of the essence. That’s why we’re providing funding to help communities put Indigenous engagement requirements in the act into motion.”The new act brings in a number of changes that make it the most comprehensive and forward-looking emergency management legislation in Canada. Some of these changes include:\n\tincreasing emphasis on disaster risk reduction and shifting from a response focus to all four phases of emergency management (mitigation, preparedness, response and recovery);\n\timplementing a need for climate-informed risk assessments by provincial ministries, local authorities, critical infrastructure owners and public-sector agencies to better understand and prepare for the hazards communities face;\n\trecognizing Indigenous Peoples as true partners in emergency management and establishing a framework for agreements between First Nations and other authorities that can help advance shared decision-making and co-ordination.\nBy working together, communities can be better prepared for emergencies and can more effectively co-ordinate response efforts. Guided by the United Nations Sendai Framework for Disaster Risk Reduction and B.C.’s Declaration on the Rights of Indigenous Peoples Act, the new Emergency and Disaster Management Act includes engagement provisions that require municipalities and regional districts to consult and co-operate with Indigenous governing bodies and incorporate Indigenous knowledge and cultural safety across emergency management practices.To support this work, the Province is providing $18 million to communities to consult and collaborate in advance of emergency events. The funding is intended to:\n\tsupport relationship-building across jurisdictions through consultation and co-operation with Indigenous governing bodies;\n\tensure the incorporation of Indigenous knowledge and cultural safety across emergency management practices;\n\tsupport policy improvements that reflect the lived experience of Indigenous Peoples and;\n\taddress the disproportionate effects on Indigenous Peoples during emergency events.\nUnder the act, municipalities and regional districts must include available Indigenous knowledge in their approach to emergency management, ensuring this knowledge contributes to actions that are taken before, during and after emergencies.“It is critical for local governments and authorities to fully understand our inherent rights and jurisdiction in relation to emergency management,” said Robert Phillips, First Nations Summit political executive. “We welcome this new funding to support First Nations and local authorities’ engagement as an essential and necessary component to the implementation of the act. First Nations governments are in full support of building strong relationships and open communication regarding emergency planning, prevention, response and recovery, with their neighbouring authorities and governments.”Indigenous knowledge is based on thousands of years of accumulated experiences and can provide expertise and insight into how to reduce disaster risk and manage emergencies. The United Nations Office for Disaster Risk Reduction has recognized that local Indigenous knowledge is a valuable contributor to planning and decision-making in emergency management.“With the climate crisis rapidly escalating, it is critical that First Nations are supported to be full partners in decision-making about our territories,” said Chief Don Tom, vice-president of the Union of BC Indian Chiefs. “Engagement on legislation and regulations is incredibly expensive and requires legal and technical capacity, and the funding announced today will help us participate.”Terry Teegee, Regional Chief of the BC Assembly of First Nations, said: “The Chiefs in B.C. recently supported the First Nations Disaster Risk Reduction Action Plan that guides priorities for improving emergency management jurisdiction and services by First Nations. B.C. and local governments must respect and implement First Nations priorities, laws and policies. The climate emergency affects First Nations disproportionately more than any other people and we have only seen inadequate investments in all pillars of emergency management. All new regulations require First Nations to co-draft, co-develop and reach consent. We applaud the Province’s efforts to improve emergency management in B.C.”Public engagement is underway on future regulations, including for local authorities and post-emergency financial assistance. People are encouraged to share their experiences and feedback on Disaster Financial Assistance to help inform new regulations for people recovering from a disaster. Engagement is open until Jan. 31, 2024.Once local authority regulations are developed and in force, municipalities and regional districts will be required to include available Indigenous knowledge in risk assessments and emergency management plans. Plans will identify hazards and potential consequences, including consequences to sites of heritage value, and include a consideration of people disproportionately impacted by the effects of emergencies.All First Nations in B.C. are eligible to apply for the $200-million Declaration Act Engagement Fund. This fund is helping enhance capacity for First Nations to consult and co-operate with the Province on the implementation of the Declaration Act Action Plan, as well as the development and alignment of provincial laws with the UN Declaration on the Rights of Indigenous Peoples.“The Declaration Act Engagement Fund is creating flexibility for First Nations to engage with the Province on areas of interest in ways that respond to their unique needs and priorities, including emergency management preparedness,” said Murray Rankin, Minister of Indigenous Relations and Reconciliation. “The new Emergency and Disaster Management Act responds to a key action item in our Declaration Act Action Plan and supports the work being done together to implement the Declaration Act.”Communities can also access funding for preparing for and mitigating emergencies and climate-related disasters through the $369-million Community Emergency Preparedness Fund (CEPF), which has six funding streams. The next application deadline for the Disaster Risk Reduction-Climate Adaptation funding stream is March 28, 2024.“Improving collaboration and co-operation between First Nations and local governments will strengthen the ability of all communities to prepare for emergencies and work together when they arise,” said Trish Mandewo, president, Union of British Columbia Municipalities. “The consultation requirement placed upon local governments through the recent emergency management legislation is as considerable as it is important. The funding provided through this initiative and the CEPF program will assist local government engagement with neighbouring First Nations. Local governments look forward to receiving guidance from the Province on the details necessary to fulfil this requirement.”The legislation follows global best practices for disaster risk reduction and incorporates all four phases of emergency management: mitigation, preparedness, response and recovery.Quick Facts:\n\tThe Emergency and Disaster Management Act replaces the Emergency Program Act, which hadn’t been substantially updated since 1993.\n\tModernized emergency management regulations to complement the act are being introduced in a phased approach.\n\tThe regulations, including local authority and post-emergency financial assistance, will be developed in consultation and co-operation with First Nations.\n\tIn addition to continuous improvements to emergency management, the act will be reviewed within five years.\n\tA 14-member task force composed of experts in emergency and wildfire management has been appointed by Premier David Eby and is working on providing recommendations on enhancing emergency preparedness and response in advance of the 2024 wildfire season.\nLearn More:For guidelines on the Indigenous Engagement Requirements funding program, visit:\nhttps://www2.gov.bc.ca/gov/content/safety/emergency-management/local-emergency-programs/financial/ierfpTo learn more about the Emergency and Disaster Management Act, including details about phased implementation, visit:\nhttps://www2.gov.bc.ca/EmergencyManagementActTo participate in the public engagement on emergency management regulations, visit:\nhttps://engage.gov.bc.ca/emergencymanagementregulationsTo learn more about B.C.’s Declaration on the Rights of Indigenous Peoples Act, visit:\nhttps://www2.gov.bc.ca/gov/content/governments/indigenous-people/new-relationship/united-nations-declaration-on-the-rights-of-indigenous-peoplesFor more information about B.C. legislation, visit: https://workingforyou.gov.bc.ca/legislation\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023EMCR0080-001992.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023EMCR0080-001992.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Connectivity funding application intake opens Jan. 8\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The third intake of the Connecting Communities BC (CCBC) funding program will open for applications on Jan. 8, 2024.In March 2022, the governments of B.C. and Canada announced a partnership to invest as much as $830 million, each contributing $415 million toward high-speed connectivity infrastructure projects in rural and remote areas.Through the CCBC program, the Province aims to provide all remaining underserved households and First Nations communities with access to high-speed internet by 2027. This program fulfils a call to action in the Declaration Act Action Plan.Eligible applicants can apply for funding to support the expansion of high-speed internet to households in specific areas of interest in the province that do not have access to internet speeds of at least 50 Megabits per second (Mbps) download speed and 10 Mbps upload speed.This intake is open to First Nations-led or First Nations-supported projects in any area of the province. Otherwise, areas of interest for Intake 3 will target connectivity gaps and remote areas in the northeast, northwest and along the central and north coast, including parts of Haida Gwaii and northwestern Vancouver Island.Areas of interest are outlined in the application guide available online: https://www2.gov.bc.ca/gov/content/governments/connectivity-in-bc/20601/20601-63737Intake 3 will be open until March 14, 2024. Subsequent intakes will be launched until the program has achieved its connectivity goals.The Connecting Communities BC program completed two intakes between September 2022 and February 2023. Project applications from previous intakes are in review, with approved projects expected to be announced in a short time.Learn More:Connecting Communities BC Application Guide:\nhttps://www2.gov.bc.ca/gov/content/governments/connectivity-in-bc/20601/20601-63737Connecting Communities BC:\nwww.gov.bc.ca/connectingcommunitiesbcConnectivity in B.C.:\nhttps://www2.gov.bc.ca/gov/content/governments/connectivity-in-bcStrongerBC: Good Lives in Strong Communities:\nhttps://news.gov.bc.ca/files/Good-Lives-Strong-Communities-2023.pdf\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023CITZ0033-001998.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023CITZ0033-001998.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Young artists among people receiving $18.2 million in provincial funding\n        ",
    "resolutionId": null,
    "contents": "\n            SURREY – Young artists are among the people benefiting from an $18.2-million investment in arts and culture programs throughout the province through Community Gaming Grants.Arts Umbrella, a non-profit centre for arts education with locations in Vancouver, Surrey and South Surrey, received $225,000 to provide free community programming for young artists in dance, theatre, and art and design.“The continued support we receive from Community Gaming Grants is critical, helping us to provide nurturing, stimulating and inclusive community programming completely free of charge to over 6,500 deserving young people each year,” said Susan Smith Alexander, senior director of programming, Arts Umbrella. “This stable funding helps us to plan with confidence and inspire children and youth who otherwise would not have access to quality arts programming.”Similar arts-and-culture grants will provide greater community access to a variety of programs at more than 650 organizations across B.C.“Through Community Gaming Grants, the Province is helping organizations like Arts Umbrella to reach more people through their work,” said Anne Kang, Minister of Municipal Affairs. “From arts and literature to festivals and museums, B.C. has a thriving arts-and-culture sector that keeps our communities vibrant and healthy. These grants are helping organizations to keep costs down for art students, museum visitors, festival-goers and anybody participating in arts-and-culture activities.”Grant recipients will deliver programs that preserve and/or provide public access to arts, heritage or culture, including:\n\tLadysmith Festival of Lights ($46,000);\n\tNelson and District Museum, Archives, Art Gallery and Historical Society ($36,400);\n\tOkanagan Symphony Society ($164,500);\n\tSociété francophone de Maillardville for the Festival du Bois in Coquitlam ($90,000); and\n\tStage North Theatre Society ($24,500).\nThe funding is part of $140 million provided annually through Community Gaming Grants to not-for-profit organizations throughout B.C. These grants help approximately 5,000 organizations to deliver ongoing programs and services in their communities.The Province has also announced an additional $11.2 million in Community Gaming Grants for 1,300 school parent advisory councils (PACs) and district parent advisory councils (DPACs) in B.C.Quotes:Lana Popham, Minister of Tourism, Arts, Culture and Sport – “B.C. has the greatest concentration of artists and cultural workers per capita in Canada. We're proud to support the arts-and-culture sector through the Community Gaming Grants, as it plays a vital role in promoting the resilience, vitality and well-being of our communities. We strongly believe that everyone should have access to arts and culture in their communities.”Mike Starchuck, MLA for Surrey-Cloverdale – “The cost of everything is going up, which makes it harder for people to find affordable things to do with friends and family. This funding will help not-for-profit organizations keep events and festivals free or low-cost, and it will help families keep their kids in art classes, dance lessons, music or other activities.”Christine Hawkins, chair, BC Association for Charitable Gaming –“The BC Association for Charitable Gaming applauds the tenacity of arts-and-culture organizations across the province as they produce transformational events in their communities. Gaming funding is a critical component of the arts organizations’ annual production cycle and we are grateful for this support to the communities served.”Paul Larocque, president and CEO, Arts Umbrella –“When I think of the next generation of young people, I have great faith in the role that arts education can play in their lives. I have witnessed so many transformative moments when a new passion is discovered. Thanks to our supporters and Community Gaming Grants, our Donor-Funded Community Programs harness the same expertise as our tuition-based classes, bringing the Arts Umbrella experience to children and youth across Metro Vancouver, at little to no cost.”Quick Facts:\n\tSince 2017, Community Gaming Grants have annually supported programs that directly benefit British Columbians and their communities, helping more than 5,100 arts-and-culture sector not-for-profit organizations.\n\tGrants also fund human and social services, sport, public safety and environmental conservation, as well as parent and district parent advisory councils in B.C. schools.\n\tEligible organizations can apply for one of the six sectors of grants, as well as a capital-project grant.\nLearn More:To see the full list of arts-and-culture sector recipients, visit: https://news.gov.bc.ca/files/CGGPayments_Apr2023toSept2023_ArtsCulture.pdfFor more information about $11.2 million provided to parent advisory councils, visit: http://news.gov.bc.ca/releases/2023MUNI0053-001975For more information on Community Gaming Grants, visit: https://www2.gov.bc.ca/gov/content/sports-culture/gambling-fundraising/gaming-grants/community-gaming-grants\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0055-001993.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0055-001993.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Student activities enhanced by funding for parent advisory councils\n        ",
    "resolutionId": null,
    "contents": "\n            COLDSTREAM – Students from kindergarten to grade 12 are learning and growing beyond the classroom, thanks to $11.2 million in funding for parent advisory councils in B.C.“As a mother and a teacher, I know first-hand how important it is for students to learn, grow and have fun together outside the classroom,” said Anne Kang, Minister of Municipal Affairs. “Parents who volunteer their time and energy to create opportunities for students shouldn’t be left to do all the fundraising themselves. I know these grants are helping parent advisory councils create vibrant and healthy communities in their kids’ schools.”More than 1,300 parent advisory councils (PACs) and district parent advisory councils (DPACs) in B.C. received Community Gaming Grants to pay for events, activities and equipment in support of student learning and parent involvement. For example, Coldstream Elementary School’s PAC received $6,440 and plans to target funding to ensure all Grade 3 students have access to swimming lessons.“Our PAC is focused on providing students with experiences not all families can afford these days,” said Saleha Patel, president, Coldstream Elementary School parent advisory council. “We live in an area with many lakes and knowing how to swim is critical. Without funding from the PAC, our students might not have the chance to take swimming lessons to gain this necessary life skill.”PACs can use the grants to pay for equipment and costs associated with a range of extracurricular activities, including sports, performances, movie nights, dances, field trips and conferences. DPAC groups can use the funds for informational and promotional materials for parents, meeting-room rentals, presenter fees, travel for meetings, and more.“Parents and our school PACs are essential partners in our schools. The incredible work that they do creates a strong sense of community, as well as activities and opportunities, for all students to connect, learn and thrive,” said Rachna Singh, Minister of Education and Child Care. “These annual Community Gaming Grants to our PACs support learning, sport, arts and play for all kids in our community schools.”The $11.2 million for PACs and DPACs is part of $140 million provided annually through Community Gaming Grants to not-for-profit organizations throughout B.C. These grants help approximately 5,000 organizations to deliver ongoing programs and services in their communities.The Province has also announced an additional $18.2 million in Community Gaming Grants for arts and culture organizations in B.C.Quotes:Harwinder Sandhu, MLA for Vernon-Monashee – “Parent advisory councils play an important role in schools for students and parents alike. As a mother of school-age children, I understand how hardworking and important our PACs are. They do exceptional work to support our students and contribute to their school life experience. I am so excited about this funding. I know this will help thousands of amazing volunteer teams deliver extracurricular activities for all our students in Vernon-Monashee.”Christine Hawkins, chair, BC Association for Charitable Gaming (BCACG) –“Once again, students across the province are benefiting from direct gaming funding in 2024 through their parent and district parent advisory councils. Our organization assists both councils as they access this important funding source, which underpins community involvement in B.C.”Laura Ward, president, BC Confederation of Parent Advisory Councils – “This essential funding supports enriching activities, experiences and equipment for students, and for parent education and information. By bridging resource gaps and empowering parents to be involved, the Community Gaming Grants funding plays a crucial role in promoting collaboration, community engagement and student success throughout British Columbia’s public education system.”Quick Facts:\n\tCommunity Gaming Grants have annually supported programs and capital projects that have benefited people in British Columbia and their communities since 2017.\n\tThe Province also provides Community Gaming Grants to other sectors such as human and social services, public safety, environmental conservation, arts and culture, and sports.\nLearn More:To view the list of PAC and DPAC sector recipients, visit: https://news.gov.bc.ca/files/CGGPayments_Apr2023toSept2023.pdfFor more information about $18.2 million provided to parent advisory councils, visit: https://news.gov.bc.ca/releases/2023MUNI0055-001993For information about Community Gaming Grants, visit: https://www2.gov.bc.ca/gov/content/sports-culture/gambling-fundraising/gaminggrants/community-gaming-grants\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0053-001975.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0053-001975.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Drivers should plan for Stanley Park Causeway lane closures this weekend\n        ",
    "resolutionId": null,
    "contents": "\n            VANCOUVER – Drivers are reminded of lane closures this weekend on the Stanley Park Causeway.On Saturday, Dec. 16 and Sunday, Dec. 17, 2023, one lane will be closed from 8 a.m. until 2 p.m. Northbound pedestrians and cyclists will be detoured through Stanley Park and to west side of the causeway/bridge.The closures are in support of an urgent tree-removal project in Stanley Park led by the Vancouver Board of Parks and Recreation.The full schedule of December and January weekend lane closures can be found on the Vancouver Board of Parks and Recreation website: https://www.vancouver.ca/stanley-park-treesWhile efforts are being made to keep impacts to a minimum, people should plan for delays and transit changes to and from the North Shore, and to consider using the Ironworkers Memorial Second Narrows Crossing as an alternative during the times noted above.Watch for traffic-control personnel, obey signs and check DriveBC for updates: https://drivebc.ca/\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0208-001986.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0208-001986.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New data released on people experiencing homelessness in B.C.\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – An innovative approach to data collection and reporting is helping government better understand the underlying factors that lead to homelessness and better support people in finding stable housing and services that meet their needs.The 2021 estimate of the number of people experiencing homelessness in B.C., an update from the 2020 and 2019 estimates, is part of government’s Preventing and Reducing Homelessness Integrated Data project. The project estimates the number of people who experienced homelessness in the province.As the data grows, it allows government to make evidence-based decisions on what services and supports are needed most to prevent or end the cycle for people experiencing homelessness in B.C.The report adds another year of data to the 2020 and 2019 estimates that were released last year. This project links de-identified data from the Ministry of Social Development and Poverty Reduction, the Ministry of Health and BC Housing to estimate the number of people who have experienced homelessness in B.C.With an updated data set for 2021, analysts can begin to see the emergence of some patterns. The numbers offer the ability to monitor seasonal and geographic trends, and demographics of individuals in B.C. who experience homelessness.According to the research, the latest findings show:\n\t11,896 people, on average, were identified as experiencing homelessness each month, (range = 11,331 in February to 12,758 in December).\n\t26,240 people experienced homelessness in B.C. at some point in 2021. In comparison, 24,270 people experienced homelessness at some point in 2020, and 24,507 people experienced homelessness at some point in 2019.\n\t10,424 people were newly identified in 2021 as not having experienced homelessness in 2020 or 2019, while 10,013 people who had experienced homelesness in 2020 did not meet the definition of experiencing it again in 2021.\nThe data counts people who accessed income assistance and people who reported having no fixed address and people who accessed a shelter over the course of 2021. The data also shows where people are experiencing homelessness, whether their homelessness was short term or chronic, and examines when people enter and exit homelessness.Government is using this data to implement Belonging in BC, the Province’s plan to prevent and reduce homelessness. The plan adds thousands of new supportive housing units and hundreds of complex-care spaces provincewide, and creates multidisciplinary regional response teams designed to rapidly respond to encampments to better support people sheltering outdoors to move inside.Quick Facts:\n\tThe Belonging in BC homelessness plan is delivered through initiatives across government and supported by investments of $1.18 billion in Budget 2023 and $633 million in Budget 2022.\n\tSince 2017, government has helped approximately 5,600 people who were experiencing, or at risk of, homelessness move into new supportive housing.\n\tAnother 2,300 supportive homes are underway, including approximately 860 homes coming to Vancouver and 250 in Victoria.\n\tIn addition, the Province is funding more than 5,500 shelter spaces in 55 communities throughout the province this winter, including permanent, temporary and extreme-weather response shelters.\nLearn More: To view the full report and find out more about what the Province is doing to help prevent homelessness, visit:\nhttps://www2.gov.bc.ca/gov/content/housing-tenancy/affordable-and-social-housing/homelessness/homelessness-cohort\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0179-001995.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0179-001995.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Minister’s statement on filing the next unexplained wealth order\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Mike Farnworth, Minister of Public Safety and Solicitor General, has released the following statement about an unexplained wealth order (UWO) application filing:“Today, another unexplained wealth order application was filed with the British Columbia Supreme Court, with a hearing date expected on Feb. 1, 2024.“I cannot comment on the filing of these unexplained wealth-order applications while they are before the court and the subject of ongoing litigation. However, I can confirm that we will continue to forfeit illegally obtained assets and redirect them to community safety and crime-prevention initiatives, which help repair the damage done by those who think that they can profit from crimes and illegal enterprises in British Columbia.“The public can be assured that British Columbia will continue to take decisive action against suspected unlawful activity. This UWO filing sends a clear message that we will seek out ill-gotten gains and redirect them to community safety initiatives.”Quick Fact:\n\tThe filed Notice of Civil Claim and the filed application for an unexplained wealth order can be found on Court Services Online by referencing Supreme Court of British Columbia Vancouver Registry #S-238490.\n\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0092-001994.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0092-001994.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Minister’s statement on City of Vancouver's resolution on Park Board\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Anne Kang, Minister of Municipal Affairs, has released the following statement in response to the City of Vancouver’s resolution on the Vancouver Park Board:“We respect the decision of Vancouver city council on the future of the park board. The Ministry of Municipal Affairs will begin work with the city to move forward on this significant change to governance in Vancouver. There are a number of items that need to be addressed, including land ownership and the future of the workers at the park board, and we need to make sure First Nations are consulted. We are asking the City of Vancouver to provide the Province with a transition plan to address these considerations so we can move forward together.”\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0054-001991.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0054-001991.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Fish-friendly flood infrastructure in Lower Fraser River protects communities, salmon\n        \n            Facts about the British Columbia Salmon Restoration and Innovation Fund\n        ",
    "resolutionId": null,
    "contents": "\n            COQUITLAM – The governments of B.C. and Canada are taking action to improve flood resilience for communities and support salmon runs in the Lower Fraser River area, helping protect homes and wild salmon.“As the impacts of climate change continue to threaten communities and the health of B.C.’s watersheds, it is more important than ever that we act now to both prevent flooding and support wild salmon runs,” said Nathan Cullen, Minister of Water, Land and Resource Stewardship and Minister Responsible for Fisheries. “The Resilient Waters project will benefit local communities, B.C. fisheries and the incredible diversity of fish, in particular wild salmon, that call the Lower Fraser River region home.”The Lower Fraser River and its tributaries are home to the largest collection of salmon runs in the world, supporting local communities and B.C. fisheries. But the watershed faces significant challenges, including outdated flood-control infrastructure that blocks vital migration routes for salmon.The B.C. Salmon Restoration and Innovation Fund (BCSRIF) will provide $3.6 million to support the Resilient Waters project. The Resilient Waters project is a collaborative effort led by MakeWay Charitable Society and involves partnerships with government agencies, Indigenous communities, non-profit organizations and research institutions, working together to address critical issues facing the salmon populations in the Lower Fraser Watershed.The goal of the project is to restore connections to more than 1,500 kilometres of wild salmon habitat in the Fraser Valley by replacing 156 aging flood-control structures, such as pump stations, flood boxes and dikes, while advancing best practices in fish-friendly flood infrastructure to protect communities.“With extreme environmental events on the rise and salmon populations in decline, the time to take action is now. Through the joint federal-provincial BC Salmon Restoration and Innovation Fund, we’re investing in projects in the Coquitlam area that will work to improve flood-control infrastructure and habitat restoration,” said Diane Lebouthillier, federal Minister of Fisheries, Oceans and the Canadian Coast Guard. “With support from our Pacific Salmon Strategy Initiative, which funds and co-ordinates efforts to stem the decline of salmon populations, these projects will protect communities and fish habitats from floods while giving salmon a better chance to thrive in the critical waters of the Fraser River.”The Resilient Waters project will also provide:\n\t7.5 hectares of high-quality juvenile coho and chinook rearing habitat within an existing wildlife management area;\n\ta research project to better understand the effects of pumps on salmon; and\n\ta post-restoration monitoring program to assess the success of sites where flood infrastructure has been restored for fish passage.\nQuotes:Fin Donnelly, Parliamentary Secretary for Watershed Restoration –“The Resilient Waters project demonstrates British Columbians, communities, First Nations and our governments’ commitment to securing B.C.’s watersheds and promoting community resilience. It will serve to enhance the health of our watersheds and fortify our communities, wild salmon populations and ecosystems against climate and environmental challenges. This BCSRIF investment underscores the importance of innovative practices and highlights our dedication to creating a legacy of thriving watershed ecosystems for generations to come.”Dan Straker, Resilient Waters project manager, MakeWay Charitable Society – “MakeWay and the Resilient Waters project are very excited to continue our work on solutions that improve flood resilience for communities and for salmon in the Lower Mainland. BCSRIF has supported our work since the beginning and we are now seeing real change on the ground.\"Lina Azeez, habitats program director, Watershed Watch Salmon Society – “Watershed Watch Salmon Society applauds our federal and provincial governments for stepping up to support this important work to restore our salmon runs and improve flood control. With more than 156 outdated flood-control structures in the Lower Fraser impacting fish and fish habitat, there is still plenty more to do. These projects show how we can work together to put solutions in place that protect our communities, while also supporting the needs of B.C.’s wild salmon.\"\nLearn More:For more information about BCSRIF, visit: https://www.dfo-mpo.gc.ca/fisheries-peches/initiatives/fish-fund-bc-fonds-peche-cb/index-eng.htmlA backgrounder follows.\n        \n            \n\tThe British Columbia Salmon Restoration and Innovation Fund (BCSRIF) is a program funded jointly by the federal and provincial governments.\n\tThe Government of Canada is providing 70% of the funding and the Province of British Columbia is providing 30%.\n\tThe fund will be available to support projects until March 31, 2026.\n\tBCSRIF has supported approximately 100 projects in its Phase 1 to protect and restore wild Pacific salmon and other priority fish populations since 2019.\n\tOther recipients of BCSRIF Phase 2 projects are expected to be announced by the end of this year or early in 2024.\n\tBCSRIF Phase 2 is supported by the three pillars of innovation, infrastructure and science partnerships to protect and restore wild Pacific salmon and other priority fish populations, and to ensure the fish and seafood sector in B.C. is positioned for long-term environmental and economic sustainability.\n\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023WLRS0068-001983.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023WLRS0068-001983.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Expansion of virtual bail supports safer communities\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The provincewide expansion of virtual bail is a significant step toward a more efficient justice system.In collaboration with the Provincial Court, virtual bail hearings, including electronic document submissions for bail hearings by lawyers, have been successfully expanded and implemented throughout B.C. It is an important measure in the Safer Communities Action Plan.“Expanding virtual bail hearings provincewide means more people can access court proceedings faster while staying in their communities, and close to the local services and supports they are connected to,” said Niki Sharma, Attorney General. “By using available technology, we’re adapting to make our justice system more efficient and effective.”Following a successful pilot in northern B.C. in 2021, centralized virtual bail hearings are now operational in the Interior, Vancouver Island, Vancouver Coastal and most recently, Fraser region.With virtual bail hearings, judges, court staff and lawyers can appear in multiple jurisdictions on the same day without the need to travel. Implementation of technology and process changes across the province have resulted in a justice system that can also better adapt to extreme events like wildfires, flooding and pandemics.Early benefits of virtual bail hearings include:\n\treducing displacement of accused people from their own communities and community supports;\n\treducing overnight remands in police cells;\n\treducing travel for sheriffs, prisoners and lawyers;\n\tallowing trials in smaller locations to proceed without being interrupted by bail hearings;\n\treducing trial continuations; and\n\tincreasing access to duty counsel.\nThe Province is continuing to implement the Safer Communities Action Plan to keep those who commit repeat violent offences off streets and strengthen services to build safe, healthy communities.Learn More:For more information about the virtual bail initiative, visit: https://www.provincialcourt.bc.ca/downloads/Practice%20Directions/CRIM05.pdfFor information about Safer Communities Action Plan, visit: https://news.gov.bc.ca/27820\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023AG0073-001989.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023AG0073-001989.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Drug eligibility expanded for children with cystic fibrosis\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – More children in B.C. who are living with cystic fibrosis are now eligible for Trikafta, a medication that has shown to improve lung function and quality of life, as well as reduce the frequency of lung attacks.Coverage criteria for Trikafta in B.C. was expanded on Thursday, Dec. 14, 2023, based on a recommendation from the Canadian Drug Expert Committee (CDEC).In September 2021, the drug was first listed for patients 12 years or older. In September 2022, eligibility was expanded to include children aged six to 11 years. Following a new recommendation from the CDEC, children aged two to five years are now eligible for coverage.Trikafta is a triple-combination medication of ivacaftor, tezacaftor and elexacaftor, used for the treatment of cystic fibrosis in patients who have at least one F508del mutation.The drug is covered through the B.C. Expensive Drugs for Rare Diseases process, which allows patients to access high-cost drugs for rare conditions on a case-by-case basis.Approximately 200 people in B.C. benefit from Trikafta PharmaCare coverage. An estimated 40 more are expected to become eligible with the expanded criteria.Cystic fibrosis, which affects approximately 500 people in B.C., is a genetic disease that largely affects a person’s lungs, but also the pancreas, liver, kidneys and intestine. Long-term challenges can include respiratory difficulties and complications, including frequent lung attacks.\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0153-001988.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0153-001988.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Avian influenza now detected at more than 50 farms\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The Canadian Food Inspection Agency (CFIA) has confirmed 52 farms have been infected with the highly pathogenic H5N1 avian influenza virus in B.C. since Oct. 20, 2023.The premises are primarily in the Fraser Valley and include 47 commercial farms and five small-flock farms.As the fall migration of wild birds over B.C. slows down, the frequency of cases has reduced over the past few weeks. Staff with B.C.’s Ministry of Agriculture and Food are continuing to work closely with the CFIA and B.C. poultry producers to ensure enhanced biosecurity measures are in place to try to limit the spread of disease and protect flocks.An industry-led webinar for producers, supported by the Ministry of Agriculture and Food, CFIA, and public health officials, is scheduled for Tuesday, Dec. 19, 2023. Information will be shared with producers on public health, biosecurity measures and AgriStability (an income-support program) along with a general update about the outbreak. The BC Poultry Association is hosting the session and producers can contact them to register.Earlier this year, the Province introduced a new $5-million Farmed Animal Disease Program to help support farmers with enhanced biosecurity measures, equipment for disease response, research and training so they can better prepare for and prevent the risk of disease, such as avian influenza.While these important tools are in place to help prevent disease spread and protect flocks and farms, viruses can adapt and spread so it is important that farmers and small flock owners remain vigilant.Avian influenza presents an extremely low risk to public health with no risk to food safety. There are currently no anticipated food supply disruptions of either eggs or poultry due to the virus.For poultry owners who suspect their birds may have avian influenza, they should call their veterinarian, their nearest CFIA animal health office or the BC Animal Health Centre at 1 800 661-9903. If people find a sick or injured wild bird, they should leave it where it is and report it to B.C.’s wild bird surveillance hotline at 1 866 431 BIRD (2473).Quick Facts:\n\tAvian influenza is a federally regulated disease, and the Canadian Food Inspection Agency (CFIA) leads the investigation and response with provincial support for testing, mapping, surveillance and disposal.\n\tOnce the CFIA confirms positive tests, a process including quarantine, depopulation and disposal occurs.\n\tB.C.'s Animal Health Centre has tested almost 45,000 samples for avian influenza since April 2022 and more than 6,500 since the fall outbreak began. The laboratory is available seven days per week for testing.\n\tB.C.’s chief veterinarian issued two orders in October to reduce the risk of the virus spreading, including restrictions on poultry events such as shows, markets and auctions, as well as an order for commercial farms to keep their birds indoors.\nLearn More:For information from the CFIA about the current state of avian influenza in Canada, visit: https://inspection.canada.ca/animal-health/terrestrial-animals/diseases/reportable/avian-influenza/latest-bird-flu-situation/status-of-ongoing-avian-influenza-response/eng/1640207916497/1640207916934To read a CFIA factsheet about avian influenza, visit: https://inspection.canada.ca/animal-health/terrestrial-animals/diseases/reportable/avian-influenza/fact-sheet/eng/1356193731667/1356193918453#a2For information from the Ministry of Agriculture and Food information about avian Influenza, including what to be on the lookout for, resources for small-flock owners, deputy chief veterinarian's orders and information on testing, visit: https://www2.gov.bc.ca/gov/content/industry/agriculture-seafood/animals-and-crops/animal-health/reportable-notifiable-diseases/avian-influenza-aiFor a full list of resources for dealing with sick, injured or dead wildlife, visit: https://www2.gov.bc.ca/gov/content/environment/plants-animals-ecosystems/wildlife/wildlife-conservation/wildlife-health/what-to-do-if-you-find-sick-injured-or-dead-wildlife\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023AF0062-001984.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023AF0062-001984.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Tougher action to deter trucks from hitting overpasses will make travel safer\n        ",
    "resolutionId": null,
    "contents": "\n            DELTA – Tougher action is being taken to prevent truckers from crashing into highway infrastructure throughout B.C. as stronger deterrents against unsafe commercial-vehicle drivers will make highway travel safer.Trucking companies involved in infrastructure crashes will see stronger consequences that escalate for repeat offences. In cases where a company has a history of non-compliance, including previous infrastructure crashes, enforcement measures will become increasingly severe. This includes potential suspension and possible cancellation of a company's carrier safety certificate, essentially preventing their operation in B.C.Unprecedented penalties have recently been imposed by suspending a company’s entire fleet, while Commercial Vehicle Safety and Enforcement investigates a crash.  The immediate suspensions and the significant cost they bring to a company will be a permanent tool. However, repeat offenders will face longer suspensions and may have their certificate to operate in B.C. revoked. “Infrastructure crashes have a huge impact. They delay commuters, affect the movement of goods and can impede first responders. This means families, businesses and the economy all suffer,” said Rob Fleming, Minister of Transportation and Infrastructure. “Safety is the priority and this issue needs to stop. That’s why we’re taking tougher action, grounding fleets through suspensions and increasing fines, so highway traffic keeps moving safely and reliably for travellers and commercial vehicles, and people can count on their commute.” Recent regulatory changes will also bring in new and higher fines for various offences, holding carriers and drivers accountable for the safe and professional movement of goods on provincial highways. Additionally, new speed-limiter regulations will further improve safety by requiring heavy commercial vehicles operating in the province to have their speed-limiting systems activated and programmed by April 5, 2024. This will prevent these vehicles from travelling more than 105 km/h on B.C. highways. The fine for speed-limiter non-compliance and tampering is $295 and three driver penalty points.“The BC Trucking Association welcomes and supports the decisive measures taken by the provincial government to enhance safety and reduce infrastructure crashes involving commercial heavy-duty trucks,” said Dave Earle, president and CEO, BC Trucking Association. “These initiatives mark a pivotal step toward creating safer roadways for all and underscore our shared commitment to fostering a culture focused on risk-prevention in the trucking industry.”Specific amendments to the Commercial Transport Regulations and the Motor Vehicle Act Regulations bring in new offences and higher fines to address over-height vehicles and loads, as well as require dump-style vehicles to have in-cab warning devices by June 1, 2024. This will alert a driver if the dump box is raised when the vehicle is in motion. The over-height vehicle related fines will be $575 (previously $115), making this the highest fine of its nature in Canada. Not complying with having in-cab warning devices in dump trucks will result in a fine of $598.While B.C.’s new fines for infrastructure crashes will become the highest in Canada, fine amounts are currently limited by legislation. The Province is reviewing potential legislative changes that would allow even higher fines in the future. Learn More:To learn about the new progressive-enforcement framework, visit: https://www.cvse.ca/whatsnew.htmlFor more information about B.C. legislation, visit: https://workingforyou.gov.bc.ca/legislation\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0207-001985.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0207-001985.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Sharp rise in deaths among people experiencing homelessness continues in 2022\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The deaths of at least 342 people experiencing homelessness were reported to the BC Coroners Service in 2022, continuing an increase in deaths among the unhoused population of 138% in the past two years.During the period studied (2015-22), there were 1,464 deaths involving individuals identified as experiencing homelessness in British Columbia, equating to an average of 183 deaths per year. There was a significant increase from this average in 2021 and 2022.The townships with the highest number of deaths between 2015 and 2022 were Vancouver (306), Surrey (146) and Victoria (118). Almost three quarters (74%) of decedents were aged between 30 and 59, and 82% were male.Because housing data was unavailable at the time of analysis, rates of death and any possible correlation between deaths and the number of people experiencing homelessness in the province could not be determined.Just as it has across all demographics and in communities throughout B.C., the toxic drug supply has significantly contributed to the increased number of deaths among people who are precariously housed or experiencing homelessness. More than eight out of every 10 deaths in the review period were classified as accidental, and of those accidental deaths, more than nine in 10 were determined to have been caused by unregulated drugs.For the purposes of the report, an individual experiencing homelessness was defined as:\n\tA person living outdoors, in a make-shift shelter, a parked vehicle, a vacant home or any other structure not intended for habitation; or\n\tA person staying at an emergency shelter (overnight) or who is temporarily sheltered (suspected to be for less than 30 days) by friends or family, in a short-term shelter, safe house for youth or transition house for women and children fleeing violence.\n\tPersons residing in short-term shelters, safe houses or transition houses for an unknown length of time were also included.\nSome individuals who do not meet the above definitions of homelessness may be considered homeless under other definitions. Examples of individuals who were not considered homeless for the purposes of this report include: people in correctional institutions, hospitals or residential drug or alcohol treatment facilities; and people who have permanent residences but are considered at high risk of homelessness because of unemployment, domestic violence or other factors.Additional key preliminary findings are below. Data is subject to change as additional post-mortem testing results are received:\n\tBetween 2015 and 2020, the annual average was 143 deaths. In comparison, the annual average from 2021 to 2022 was 305 deaths.\n\tMore deaths occurred in the fall (27%) and winter (26%) months of the year.\n\tThe most impacted health authorities were Fraser (32% of deaths) and Vancouver Coastal (24%).\nLearn More:To read the report, Deaths of Individuals Experiencing Homelessness 2015-2022, visit: https://www2.gov.bc.ca/assets/gov/birth-adoption-death-marriage-and-divorce/deaths/coroners-service/statistical/deaths_of_individuals_experiencing_homelessness_2015-2022.pdf\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0091-001978.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0091-001978.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New clinical support, research centre to be built next to new St. Paul’s Hospital\n        \n            What people are saying about the new CSRC\n        ",
    "resolutionId": null,
    "contents": "\n            VANCOUVER – People in B.C. will benefit from advanced patient care resulting from cutting-edge research and integrated health care as the Province approves the business plan and funding for the construction of a state-of-the-art Clinical Support and Research Centre (CSRC) at the new St. Paul’s Hospital.“This new research centre will help define the future of medicine,” said Premier David Eby. “We are going to see scientific breakthroughs translated into real-world health care, delivering better services and treatments for patients. B.C. is becoming a global hub for life sciences and today’s announcement will help us to continue to attract the best scientists and researchers to our province, as well as doctors, nurses and other health-care professionals.”Located near 1002 Station St., directly adjacent to the new St. Paul’s Hospital, the centre will be approximately 34,400 square metres (370,000 square feet) in size and connected with a sky-bridge to the St. Paul’s Hospital on the Jim Pattison Medical Campus, which is under construction.“Clinical research and innovation are drivers of excellence in the health sector and lead to improved patient care and treatment,” said Adrian Dix, Minister of Health. “That’s why our government is investing in establishing a world-class research centre in the heart of the new St. Paul’s Hospital campus that will facilitate the translation of scientific innovation and research into day-to-day clinical practice, resulting in improved patient care and outcomes.”Providence Health Care (PHC) and Providence Research operate several major research centres based at St. Paul’s Hospital and other surrounding locations. Once complete, the centre will be home to these key research centres, programs and disciplines at Providence as well as specialty physician practices to complement care provided in the hospital, allowing for an integrated health campus.“Centred around an innovation centre, and with a direct sky-bridge connection into St. Paul’s Hospital, the CSRC will include specialty medical services in addition to extensive research facilities, corporate support and child care,” said Fiona Dalton, president and chief executive officer, Providence Health Care. “This innovation hub will bring together patients, physicians, researchers and academic partners to create sustainable solutions to the challenges that face health and well-being across the world.”The centre will also include infrastructure for emerging technology such as 3D bio-printing, research data and analytics, corporate services and a 49-space child care centre.“The new Clinical Support and Research Centre is a significant addition to the new St. Paul’s Hospital and will bring B.C.-driven innovation closer to the patients who will need it the most,” said Brenda Bailey, Minister of Jobs, Economic Development and Innovation. “This step is part of B.C.’s Life Sciences and Biomanufacturing Strategy demonstrating that our province continues to be a global leader in life sciences and that we are transforming our vision into action.”The total capital cost of the project is $638.3 million and will be cost-shared by the Province ($331.7 million), Providence Health Care ($215.6 million), St. Paul’s Foundation ($88 million), and ChildCare BC New Spaces Program ($3 million).As the cornerstone of Vancouver’s newest hub for discovery and learning in the False Creek Flats, the CSRC will bolster B.C.’s life sciences community by attracting leading care providers, scientists and industry partners to deliver excellence in care, research and innovation.Building the new centre is part of the StrongerBC Economic Plan’s Life Sciences and Biomanufacturing Strategy. The strategy outlines key actions developed in close consultation with industry and academia to position British Columbia as a global hub for life sciences and biomanufacturing, and as a leading centre for commercial-scale biopharmaceutical and medical manufacturing.Quick Facts:\n\tResearch at Providence that will relocate to the new Clinical Support and Research Centre, includes:\n\t\tCentre for Heart Lung Innovation;\n\t\tBC Centre for Excellence in HIV/AIDS;\n\t\tBC Centre on Substance Use;\n\t\tCentre for Advancing Health Outcomes (formerly known as CHÉOS); and\n\t\tnumerous clinical researchers and programs that will lead studies at the bedside in units throughout the new St. Paul’s Hospital\n\t\nA backgrounder follows.\n        \n            Joan Phillip, MLA for Vancouver-Mount Pleasant –“High-quality health care, close to home, is critical to the health and well-being of communities. The CSRC is going to help patients get top-notch care from research scientists and clinicians who are able to apply innovative solutions into every day clinical practice for better health outcomes. That’s why this investment is such a great news, and I look forward to seeing the project move forward.”Dick Vollet, president and CEO, St. Paul’s Foundation –“The CSRC is where life-changing treatments will be found as leaders in medicine, life sciences, and technology work together to advance discoveries from the lab to the hospital to communities across B.C. and beyond. With the donor community’s help, we can realize the full vision of the new St. Paul’s Hospital – more than just a hospital, it’s the beginning of a new era in health care for British Columbians.”Dr. Darryl Knight, president, Providence research, PHC vice-president, research and academic affairs and associate dean, research, faculty of medicine, University of British Columbia –“We can’t change the world if all the great work done by our renowned researchers stays in the lab. The CSRC will be the innovation vehicle that drives a dynamic exchange of ideas and solutions among patients, physicians, clinician-scientists, researchers, academia and beyond. A nexus of discovery and clinical sciences, the CSRC will expedite life-changing findings, speed-up technology transfer, incubate new start-up ventures and provide substantial training opportunities that will push the boundaries of science, innovation and care. In doing so, it will not only elevate the landscape of scientific achievement, but also drive economic growth, not just in in B.C., but across Canada.”Dr. Julio Montaner, OC, OBC, executive director and physician in chief, BC Centre for Excellence in HIV/AIDS –“We congratulate the Government of British Columbia for its unwavering support of St. Paul’s Hospital and Providence Health Care research and innovation efforts. The CSRC building is a key and critical contributor to this effort. We are confident that this investment will allow SPH/PHC to go far beyond current achievements to ensure we continue to promote targeted disease elimination and as a result contribute to enhance health-care sustainability in B.C.”Dr. Don Sin, director, Centre for Heart Lung Innovation (HLI) and professor of medicine, University of British Columbia –“The new CSRC will bring cutting-edge research to the homes of British Columbians by exploring new frontiers of knowledge, developing innovative technologies and methods, and testing novel therapies and interventions. The new facility will also enable the Province to recruit and retain the brightest minds in medicine and train the next generation of world-class physician-scientists and clinical researchers who will radically transform health care to make it more accessible, more cost-effective and highly targeted, so every patient receives the right treatment for the right diagnosis at the right time.”Dr. Bradley Quon, principal investigator, HLI, associate professor of medicine, UBC; and medical and research director, Adult Cystic Fibrosis Program, St. Paul’s Hospital –  “The CSRC will unleash the full potential of our world-class researchers. With a state-of-the-art, purpose-built facility, our scientists will accelerate their pace of discovery, revolutionizing how diseases are prevented, diagnosed, phenotyped and treated.”Dr. Alana Flexman, anesthesiologist and director of research, department of anesthesia, St. Paul’s Hospital; scientist, Centre for Advancing Health Outcomes; clinical associate professor, UBC – “Research is integral to the exceptional clinical care we provide at St. Paul’s Hospital and enhances our ability to recruit and retain extraordinary people. The CSRC will act as a catalyst to promote further advances in patient care through access to both new infrastructure and the networks of people embedded in this centre. I look forward to the many ways the CSRC will accelerate innovation, discovery and research to improve health outcomes for those we serve.”\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PREM0071-001987.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PREM0071-001987.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Sun Peaks Mountain Resort Municipality opens new child care centre\n        ",
    "resolutionId": null,
    "contents": "\n            SUN PEAKS – Families in the Sun Peaks Mountain Resort Municipality are benefiting from a new child care centre with 52 licensed spaces that will give children early learning experiences and allow parents and guardians to work or pursue other opportunities.“This child care centre is providing care for all ages of children, which is something the community needs,” said Grace Lore, Minister of State for Child Care. “We’re creating reliable child care spaces, supporting working families and strengthening Sun Peak’s economy.”The Province partnered with the municipality to build the Sun Peaks Community Daycare with approximately $1.8 million in ChildCareBC New Spaces funding. The new centre offers child care for children aged up to 12 and is a much-needed resource for families in the area.“Maintaining a stable workforce is an important community goal and this daycare facility will enable more families to make Sun Peaks their home,” said Al Raine, mayor of Sun Peaks Mountain Resort Municipality.The Sun Peaks Community Daycare will be accessible with wheelchair ramps, wide hallways, a universal washroom and handrails. It also features a food-preparation space and an outdoor playground.“We couldn't be more thrilled to unveil the new Sun Peaks Community Daycare,” said Janice Hoppenreys, manager, Sun Peaks Community Daycare. “Opening our doors to care for numerous families within the community fills us with immense excitement and gratitude.”Since 2018, through the ChildCareBC accelerated space-creation programs, more than 33,000 new child care spaces have been funded, with more than 15,000 of these spaces operational. Of these newly operational spaces, more than 560 are in the Kamloops area.The Province and the Government of Canada are investing approximately $300 million to fund the creation of new licensed child care spaces in high-need areas throughout B.C. Applications are being accepted for the ChildCareBC New Spaces Fund from public, not-for-profit child care operators and providers, and Indigenous governments and will do so until there is no more budget.Learn More:For information about the ChildCareBC New Spaces Fund, visit: https://gov.bc.ca/childcare/newspacesfund For information about ChildCareBC, visit: https://gov.bc.ca/childcare/\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ECC0104-001982.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ECC0104-001982.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New rebates make healthier home heating more affordable\n        \n            Facts about wood stoves and alternatives\n        \n            Wood Stove Exchange Program recipientsUpdated Dec. 14, 2023, for clarification\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Keeping warm during winter will have a lower effect on air quality in B.C. as more incentives and education on replacing wood stoves with cleaner, healthier heating options roll out.“Burning wood is one of the largest air-pollution sources affecting B.C. communities, and switching to healthier, clean-heat sources can save people money by heating homes more effectively,” said George Heyman, Minister of Environment and Climate Change Strategy. “By increasing the amount available for rebates, we’re helping more people breathe healthier air in their homes and in their communities.”In partnership with the BC Lung Foundation, the Government of B.C. will provide approximately $240,000 in rebates in 2024 through the Community Wood Smoke Reduction Program. This funding will help replace approximately 470 wood stoves with cleaner alternatives, such as heat pumps or emissions-certified wood stoves, and provide educational materials for municipalities to share with residents.Rebates have increased this year to ensure the program is saving people money in a time of increased global inflation.This year, people in First Nations communities can get as much as $3,000 back for upgrading to a heat pump. Rebates for heat pumps in other participating communities have doubled since last year up to $2,000, based on each community’s air-quality rating. Amounts for upgrading to a Canadian Standards Association (CSA) or an U.S. Environmental Protection Agency (EPA) emissions-certified wood or pellet stove have also increased significantly for all participating communities.“It is important that more people understand the health risks involved with wood-burning stoves,” said Christopher Lam, CEO, BC Lung Foundation. “Our top concern is the fine particulate matter in wood smoke, along with hundreds of other pollutants, including some that cause adverse health effects.”Since 2008, the Community Wood Smoke Reduction Program has provided more than $4 million to replace more than 10,300 old stoves with cleaner heating options. This year, the program will distribute $239,050, including $15,300 for “citizen science” projects, through the British Columbia Lung Foundation.In addition to the Community Wood Smoke Reduction Program rebates, people in B.C. who heat their homes with wood or solid fuels can currently receive a rebate of as much as $2,000 from CleanBC to switch to an electric heat pump. For low-income households, it is as much as $5,000. Combined with federal rebates, people in British Columbia can save as much as $7,000 on the purchase and installation of a heat pump when converting from wood, or as much as $10,000 for income-qualified households. Heat pump rebates are also available from BC Hydro and CleanBC for customers switching from fossil-fuel heating systems to heat pumps.“Modern heat pumps reduce energy bills and are effective even in colder areas of the province, especially when combined with a backup heat source for the coldest days,” Heyman said. “They also have the benefit of providing air conditioning during our increasingly hot summers.”Depending on where they live and how much they earn, people in British Columbian can qualify for multiple rebates that will effectively cover most of the capital and installation costs for many heat pump configurations, especially in First Nation communities.Learn More:For more information, visit: https://www2.gov.bc.ca/gov/content/environment/air-land-water/air/air-pollution/smoke-burning/smoke-reduction-program    For information on heat pump rebates in B.C., visit: https://www.betterhomesbc.caTwo backgrounders follow.\n        \n            \n\tThe smoke from wood-burning stoves and fireplaces contains fine particulate matter and other pollutants known to cause adverse health effects.\n\tWhen weather traps the smoke near the ground, pollution can quickly rise to unhealthy levels.\n\tOlder wood stoves from 30 or more years ago emit far more smoke than newer emissions-certified stoves.\n\t\tReplacing old, inefficient wood stoves with newer, more efficient models reduces overall heating costs for households by using less fuel and heating more efficiently.\n\t\n\tIn British Columbia, all new wood stoves and inserts sold must meet Canadian Standards Association (CSA) or U.S. Environmental Protection Agency (EPA) emission standards.\n\tPeople using wood stoves should use dry, well-seasoned wood cut into pieces 10 to 15 centimetres (four to six inches) in diameter.\n\t\tBurning green or wet wood produces significantly more smoke.\n\t\n\tFirewood should be seasoned for at least six months.\n\t\tIn addition to reducing smoke, burning seasoned wood saves money by reducing wood consumption by 25%.\n\t\n\tBy burning smaller, hotter fires to ensure complete combustion of the wood, very little smoke should be visible coming from the chimney, with no smell of smoke indoors.\n\tWood-burning appliances should be inspected and cleaned at least once a year by a certified technician.\n\n        \n            In 2024, the Community Wood Smoke Reduction Program will increase available incentives for the following groups:First Nation communities can exchange an old wood stove for:\n\tan U.S. Environmental Protection Agency (EPA) or Canadian Standards Association (CSA) emission-certified wood stove: $1,200\n\tan EPA or CSA emission certified pellet stove: $2,000\n\ta heat pump: $3,000\nResidents in communities that have exceeded national air-quality standards can apply to exchange an old wood stove for:\n\tan EPA or CSA emission certified wood stove: $600\n\tan EPA or CSA emission certified pellet stove: $1,500\n\ta heat pump: $2,000\nResidents in other participating B.C. communities can apply to exchange a wood stove for:\n\tan EPA or CSA emission certified wood stove: $600\n\tan EPA or CSA emission certified pellet stove: $1,000\n\ta heat pump: $1,500\n2023-24 Community Wood Smoke Reduction Program funding recipientsFunding for the 2023-24 Community Wood Smoke Reduction Program:\n\tComox Valley Regional District (for Citizen Science Project): $5,000\n\tCowichan Valley Regional District: $20,000\n\tGolden and district: $8,600\n\tPrince George and region, including Lheidli T’enneh First Nation community: $14,250\n\tRegional District of Central Kootenay: $13,000\n\tRegional District of Nanaimo: $69,750\n\tRegional District of Nanaimo (for Citizen Science Project): $10,300\n\tqathet Regional District: $14,000\n\tSalt Spring Island: $40,500\n\tSunshine Coast and Sea to Sky: $30,250\n\tTown of Mackenzie: $13,400\nCommunities with sufficient funds from previous years to continue offering rebates:\n\tAlberni-Clayoquot Regional District\n\tBulkley Valley Lakes District\n\tCity of Kamloops\n\tComox Valley Regional District\n\tDistrict of Vanderhoof\n\tFraser Valley Regional District\n\tKitimat-Terrace and surrounding areas\n\tMetro Vancouver Regional District\n\tRegional District of Central Okanagan, including Westbank First Nation\n\tStrathcona Regional District\n\tVillage of Valemount\n\n        ",
    "reportUrls": [],
    "date": "Dec. 13, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ENV0072-001971.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ENV0072-001971.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Update from BC Coroners Service about increasing deaths from unregulated drugs\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – In response to a recent increase in deaths caused by toxic drugs, the BC Coroners Service is issuing a public safety warning to anyone using substances purchased from the illicit market.In its October 2023 update, the coroners service revealed that the province is expected to record an unprecedented number of unregulated drug-related deaths in 2023. Since that update was released, the number of deaths due to drug toxicity has increased above earlier indications.In recognition of how difficult the holiday season is for those who have lost loved ones, there has historically not been a monthly drug-death reporting update in December. It is important, however, to ensure that people are aware of the continuing risks related to the unregulated drug market and of recent increases in deaths reported.While data is still under review, preliminary indications suggest unregulated drug toxicity has caused more than 200 deaths in November 2023, and that the province has averaged about seven deaths per day for the past seven weeks.Unregulated drug deaths in the winter months have historically increased over the numbers reported during the rest of the year, so this early increase could be a sign of another challenging season for people who use drugs in B.C.Please do not use drugs alone. It is critically important that people take advantage of every available support to keep themselves safe. This includes accessing local safe consumption sites (SCS) and/or overdose prevention sites (OPS), and/or drug checking services where available. It is recommended that anyone using drugs do so only in the presence of someone who will be able to provide naloxone and/or first aid and call 911.Local health authorities and harm-reduction organizations will continue to provide health advisories as needed as they are best positioned to respond quickly to local concerns.Recent reports of counterfeit hydromorphone tablets in Interior Health make clear that even substances presumed to be safe carry significant risk. The only way to be certain about the substances contained in a product that is purchased illicitly is by having it tested by an approved service.Learn More:Unregulated drug death report (data to Oct. 31, 2023):\nhttps://app.powerbi.com/view?r=eyJrIjoiY2ZkZTgxODAtMmE5Mi00MzNjLTlkNDYtMjRhNjU4Nzk2NGZmIiwidCI6IjZmZGI1MjAwLTNkMGQtNGE4YS1iMDM2LWQzNjg1ZTM1OWFkYyJ9BC Coroners Service Death Review Panel: A Review of Illicit Drug Toxicity Deaths:\nhttps://www2.gov.bc.ca/assets/gov/birth-adoption-death-marriage-anddivorce/deaths/coroners-service/death-reviewpanel/review_of_illicit_drug_toxicity_deaths_2022.pdf\n        ",
    "reportUrls": [],
    "date": "Dec. 13, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0090-001970.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0090-001970.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Province invites proposals for new 264th Street Interchange\n        ",
    "resolutionId": null,
    "contents": "\n            LANGLEY – Three shortlisted teams have been invited by the Province to participate in a request for proposals to design and build a new 264th Street Interchange, a key component of improvements to Highway 1 between 264th Street and Mt. Lehman Road.“The new 264th Street Interchange is essential for more efficient goods movement in our economy, given the Trans-Canada Highway’s importance to the provincial and national supply chain,” said Rob Fleming, Minister of Transportation and Infrastructure. “These improvements are also critically important to create capacity for rapid public-transit service throughout the Fraser Valley region.”The teams invited to submit proposals to enter into a design-build agreement with the Province are, in alphabetical order:\n\tAecon-Norland General Partnership: A general partnership between Aecon Constructors, a division of Aecon Construction Group Inc. and Norland Projects Limited; \n\tKEA Fraser Valley Connectors: A joint venture between Kiewit Infrastructure BC ULC and Emil Anderson Construction (EAC) Inc.; and\n\tMetro Vancouver (Infrastructure) Partnership: A joint venture between Jacob Bros. Construction Inc., BD Hall Constructors Corp., and EBC Inc.\nFollowing an evaluation of submissions, the Province will choose the project's design-build team. Construction will begin in late 2024.The 264th Street Interchange area is highly travelled during morning and afternoon hours, including a high volume of commercial vehicles heading to and from the border crossing. Along with allowing more efficient goods movement, the new interchange will include improvements for active transportation, truck parking and public transit.“We are making the infrastructure improvements necessary to support future growth in the Fraser Valley,” said Dan Coulter, Minister of State for Infrastructure and Transit. “Advance work is already underway on Highway 1 east of 264th Street, which will support an upgraded 264th Street Interchange and highway widening as work progresses.”The 264th Street Interchange and associated highway widening is one of the three major construction contracts that make up Phase 3A of the Province’s Fraser Valley Highway 1 Corridor Improvement Program, a multi-phase program to improve goods movement and travel along Highway 1 in the Fraser Valley through the Sumas Prairie to Chilliwack.The other two contracts will be upgrades to the Mt. Lehman Interchange and 3.7 kilometres of highway widening, and replacement of the Bradner Road overpass with 3.9 kilometres of highway widening. These contracts will go to tender in spring 2024 ahead of the construction season. Completion of Phase 3A is expected in 2029.The widening of Highway 1 between 264th Street and Mt. Lehman Road has an approved budget of $2.3 billion.Learn More:More information on the Fraser Valley Highway 1 Corridor Improvement Program is available at: https://www2.gov.bc.ca/gov/content/transportation-projects/fraser-valley-highway1\n        ",
    "reportUrls": [],
    "date": "Dec. 20, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0211-002012.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0211-002012.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Richmond Hospital redevelopment reaches milestone\n        \n            What people are saying about Richmond Hospital redevelopment\n        \n            Richmond Hospital redevelopment phases\n        ",
    "resolutionId": null,
    "contents": "\n            RICHMOND – People in Richmond are accessing enhanced care as the newly refurbished and relocated cancer care clinic opens at Richmond Hospital.“The opening of the modernized cancer clinic marks a significant milestone toward strengthening our public health-care system and connecting people with the care they need in their own communities,” said Adrian Dix, Minister of Health. “The cancer clinic is part of the Richmond Hospital redevelopment project and is an example of work being done across the province to upgrade or expand hospitals, empowering health-care workers to continue to deliver people-focused services and high-quality care.”With work on Phase 1 well underway, renovations are wrapping up on the ground floor of the Milan Ilich Pavilion. They include the updated cancer-care clinic, which opened to patients on Nov. 27, 2023. It has two additional examination rooms and care bays, as well as a clinical teaching room.The Richmond Hospital cancer-care clinic is leading a transformative approach to cancer care through the innovative Remote Symptom Monitoring (RSM) system. Recognizing the emotional and physical toll of chemotherapy and the gaps in communication that can affect a patient’s well-being, the RSM will help provide timely access to clinicians and reduce reliance on emergency department visits for manageable symptoms. Enrolment to the system began in early December 2023, marking a significant step toward improving patients’ cancer care journey.Phase 2 of the updates to Richmond Hospital begins in spring 2024 with the issuing of a request for qualifications (RFQ) for the new Yurkovich Family Pavilion. Through the RFQ process, Vancouver Coastal Health will identify builders who will be invited to participate in a competitive request for proposals process. This stage will determine who will be chosen to lead design and construction. The pavilion will house an emergency department with 86 spaces, increased from 62, and add three operating rooms for a total of 11. The nine-floor facility’s pre- and post-surgical care spaces will grow from 26 to 69. The Pavilion will also contain an intensive-care unit, a fully equipped medical imaging department with four CT scanners and two MRI machines, a pharmacy, and short-stay pediatrics.Phase 3 of the project includes renovations to the south tower to create new in-patient psychiatry and psychiatric assessment units so existing services will be in one location and brought up to modern standards. The south tower will also have a maternity ward and neonatal intensive-care unit. The entire project is expected to be complete in 2031.The cost of the project is approximately $861 million and will be shared by the provincial government through Vancouver Coastal Health and Richmond Hospital Foundation.Richmond Hospital opened in 1966 and has 240 beds that serve Richmond, South Vancouver and Delta, as well as people using Vancouver International Airport and BC Ferries facilities. The six-floor north tower is home to surgical suites, medical imaging, a pharmacy, as well as administrative, academic and support services.  The hospital redevelopment project is the largest health-care investment in Richmond’s history. Two backgrounders follow.\n        \n            Aman Singh, MLA, Richmond-Queensborough –“The opening of the updated cancer care clinic in the Milan Ilich Pavilion at Richmond Hospital is a significant step to ensuring better access to cancer care for people in Richmond and Queensborough. The new transformative approach to cancer care will help people along the way in their cancer journey.”Henry Yao, MLA, Richmond South Centre –“As a cancer survivor, I know patients and families in Richmond will directly benefit from the opening of the updated cancer clinic, additional examination rooms and care bays at Richmond Hospital. These groundbreaking investments and people-focused health-care services strengthen cancer care, and bring peace of mind to patients who need it the most, and their loved ones.”Kelly Greene, MLA, Richmond-Steveston –“Today, we’re another step closer to making sure the people of Richmond can access high-quality acute care, including cancer care, in their own community. As Richmond’s population continues to grow and age, so does demand for health-care services. Our government is taking action to meet increasing demand by supporting the transformational redevelopment of Richmond Hospital.” Jo-Ann Tait, vice-president, Richmond community, Vancouver Coastal Health –“We’re pleased to open the new cancer-care clinic and continue with the next phase of the redevelopment at Richmond Hospital. This new clinic will transform the future of cancer care in the community and help Vancouver Coastal Health deliver the highest quality care possible for patients during their treatment journey. The successful transition to the new space is a testament to the commitment and hard work by our incredibly talented staff and physicians.”Dr. Kim Nguyen Chi, executive vice-president and chief medical officer, Provincial Health Services Authority –“We know how important it is to our patients and their loved ones to have access to medical oncology treatments and followup care close to home. As part of B.C.’s Community Oncology Network, Richmond Hospital’s expanded cancer-care clinic will better serve this growing city and complement the care we provide through our BC Cancer centres and community sites throughout the province.”Natalie Meixner, president and CEO, Richmond Hospital Foundation –“We are grateful that the new Cancer Care Clinic is now open for people in Richmond. We eagerly anticipate the construction of the Yurkovich Family Pavilion and are excited to joyfully celebrate this progress alongside our donors and the community. This will mark the beginning of a new era for Richmond health care.”\n        \n            Phase 1 \n\tRenovations to the Milan Ilich Pavilion.\n\tRelocation of services and demolition of Park Centre and Rotunda buildings.\n\tPark Centre was home to the cancer-care clinic and psychiatric emergency unit; the rotunda hosted offices and meeting rooms.\nPhase 2\n\tConstruction of the new 216-bed Yurkovich Family Pavilion, expected to be complete in 2029.\nPhase 3\n\tFocuses on south tower and Ilich Pavilion renovations.\nPhase 4\n\tDemolition of the north tower and power plant. The entire project is anticipated to be complete in 2031.\n\n        ",
    "reportUrls": [],
    "date": "Dec. 20, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0157-002013.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0157-002013.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            B.C. reinforcing manufacturing sector on Vancouver Island\n        ",
    "resolutionId": null,
    "contents": "\n            NANAIMO – New funding for manufacturing businesses on Vancouver Island will increase advanced manufacturing capabilities, make better use of available wood fibre in the forest sector and create and protect local jobs.“We’re working together with innovative manufacturing companies as they look to grow and bring long-term, sustainable jobs to communities throughout B.C.,” said Brenda Bailey, Minister of Jobs, Economic Development and Innovation. “By investing in companies as they upgrade and modernize, we’re also investing in strengthening local economies.”The Government of B.C. is contributing as much as $3.4 million through the BC Manufacturing Jobs Fund to help Nanaimo-based VMAC Global Technology Inc. grow its operations by establishing a new 465-square-metre (5,000 square feet) manufacturing facility. It also will help buy equipment to scale up the production of lightweight air compressors for the heavy-duty commercial electric vehicle (EV) market, including semi-trucks, buses and other specialized vehicles requiring air brakes and air suspension.VMAC’s technology allows for longer range and lower maintenance costs, enabling greater adoption among the commercial market and significantly reducing emissions. VMAC also incorporates circular economy elements into its operations by reusing aluminum and steel in production and maximizing the use of all raw materials. This project increases B.C.’s advanced manufacturing capabilities, aligns with CleanBC’s priorities to strengthen adoption and infrastructure of heavy-duty EVs, and creates 45 new jobs at VMAC.“As a successful manufacturing and export business in Nanaimo, with over 180 employees, VMAC is proud to provide high-quality local jobs and support various local suppliers in Nanaimo, on Vancouver Island and in B.C.,” said Brent Johnston, CEO, VMAC Global Technology Inc. “This has been VMAC’s driving purpose for the past 38 years and the support from the Province of British Columbia will enable us to continue this mission.”Two Island-based wood-product manufacturers are receiving funds from the BC Manufacturing Jobs Fund to grow their businesses, while creating and maintaining local jobs:\n\tPort Alberni – Franklin Forest Products Ltd. will receive as much as $425,000 to buy new equipment that will allow it to shift from processing old-growth logs to a broader range of log sizes and grades, helping the company protect 37 existing jobs and create five new ones; and\n\tChemainus – BioFlame Briquettes, which manufactures briquettes from waste sawdust and logging residual from the forestry industry, will receive as much as $117,320 to buy and commission a hammermill and briquette press that will increase fibre diversity and production at its facility, allow it to take logging waste directly from the forest to reduce wildfire risk and decrease risk of fibre supply uncertainty, and create four new jobs.\nThe BC Manufacturing Jobs Fund supports for-profit organizations to plan and launch shovel-ready, high-value industrial and manufacturing projects that bring direct benefits and stable, family-supporting jobs to communities, while driving clean and inclusive growth throughout the province.Building resilient economies is part of the Province’s work through the StrongerBC Economic Plan to build a strong and sustainable economy through clean and inclusive growth. Supporting B.C.’s manufacturing and agricultural sectors helps bring government closer to its goal of building a more innovative economy for people, businesses and communities throughout B.C.Quotes:Doug Routley, MLA for Nanaimo-North Cowichan –“Seeing homegrown companies like VMAC and BioFlame expanding their operations and creating new opportunities for local workers means the investments from the BC Manufacturing Jobs Fund are helping grow strong, sustainable economies.”Josie Osborne, MLA for Mid Island-Pacific Rim – “Franklin Forest Products has been employing people in Port Alberni for over 30 years and it’s really great news that it will be able to expand operations with new equipment and provide five more family-supporting jobs.”Mike McKay, president, Franklin Forest Products Ltd. – “Franklin Forest Products appreciates the financial support from the Province. The funds will help retool the operation to become less reliant on old-growth timber and protect the nearly 40 jobs in the Port Alberni community.”Marcus Woernle, CEO, BioFlame Briquettes – “Thanks to the BC Manufacturing Fund, BioFlame is able to acquire the necessary equipment to transform low-value wood waste into densified biomass. This waste includes construction and logging residue, allowing BioFlame to increase production and meet demand.”Learn More:Learn about the BC Manufacturing Jobs Fund: https://gov.bc.ca/ManufacturingJobsFund  Learn about the StrongerBC Economic Plan: https://strongerbc.gov.bc.ca/planLearn about the CleanBC Roadmap to 2030: https://cleanbc.gov.bc.ca\n        ",
    "reportUrls": [],
    "date": "Dec. 20, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023JEDI0074-002011.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023JEDI0074-002011.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New housing underway for women leaving violence in Nanaimo\n        ",
    "resolutionId": null,
    "contents": "\n            NANAIMO – Women and their children leaving violence in and around Nanaimo will soon have access to 47 safe spaces as construction starts on a new transitional and second-stage housing development.“Safe housing is fundamental for women, gender-diverse people, and their children who are reshaping their lives after experiencing violence or trauma,” said Ravi Kahlon, Minister of Housing. “These new safe spaces will be instrumental in providing safety, security and peace of mind for families across Nanaimo. We will continue to work in partnership with organizations like the Haven Society to provide the safety, supports and services that can help rebuild people’s lives.”The four-storey, wood-frame building will provide 30 self-contained second-stage housing units with their own bathroom and kitchen, as well as 10 rooms with a total of 17 transition beds for short-term stays. Three second-stage housing units and one transition room will be wheelchair accessible.The housing will be operated by Haven Society, which supports adults and children leaving gender-based violence. This new building will replace an ageing 17-unit transition home operated by Haven Society. Once construction is finished, Haven will transfer its services and programming to the new building, which has a communal kitchen, amenity room and expanded programming spaces. The building is also close to public parks and a public recreation centre.“No one should feel unsafe in their home and their community. Yet too many women and gender-diverse people continue to face obstacles after leaving intimate-partner violence,” said Kelli Paddon, Parliamentary Secretary for Gender Equity. “These new transition and second-stage homes will offer much-needed support through programming and living arrangements to survivors and their children as they work to rebuild their lives in a safe and compassionate space.”Transition housing provides safe, temporary shelter with supports for people who need a place to go after leaving a violent or abusive situation. After a stay in a transition house, guests can move to second-stage housing for approximately six to 18 months before moving to more permanent housing in the community. Second-stage housing includes services to help women rebuild their independence, including support groups, system navigation and individualized assistance.Construction is expected to be completed in fall 2024.This project is part of a $19-billion housing investment by the B.C. government. Since 2017, the Province has more than 77,000 homes that have been delivered or are underway, including more than 1,600 homes in Nanaimo.Quotes:Sheila Malcolmson, MLA for Nanaimo, and Minister of Social Development and Poverty Reduction – “Women and children fleeing violence need safe housing for a new start. Partnering with Nanaimo’s beloved Haven Society, our government is providing much-needed housing to help stabilize and heal after violence, so that women and their children are able to put down roots and look forward to a more secure future.”Daylene Jones, executive director, Haven Society –“With the rental market in Nanaimo having only a 2.2% vacancy rate, finding affordable housing for women and families leaving violence is incredibly difficult. The addition of these second-stage units will help immensely in the transition from leaving abuse to finding long-term security and stability.”Leonard Krog, mayor of Nanaimo –“Council is incredibly grateful and pleased to welcome this very significant and much-needed housing. Gender-based violence is a serious issue. Haven Society will be better able to deliver their valuable services and supports with this new facility.”Quick Facts:\n\tThe Province, through BC Housing, is providing $17.5 million through the Building BC: Women’s Transition Housing Fund for the land and construction of the building.\n\tResidents of the second-stage home will pay either 30% of their income for rent or, for those receiving income or disability assistance, the provincial shelter rate.\n\tTransition homes guests will not be charged rent.\n\tAs is generally the case for projects that support women and children leaving violence, the address of this project has not been disclosed for safety reasons.\nLearn More:To learn more about government’s new Homes for People action plan, visit: https://news.gov.bc.ca/releases/2023HOUS0019-000436To learn about the steps the Province is taking to tackle the housing crisis and deliver affordable homes for people in British Columbia, visit: https://strongerbc.gov.bc.ca/housing/\n        ",
    "reportUrls": [],
    "date": "Dec. 20, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0181-002004.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0181-002004.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Red Chris Porphyry Copper-Gold Mine fined $25,000 for non-compliance\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The Environmental Assessment Office (EAO) issued an administrative penalty totalling $25,000 to Newmont Corporation (formerly Newcrest Red Chris Mining Limited) on Dec. 18, 2023.The company was fined for not complying with an order in 2019 for Newcrest Red Chris Mining Limited to install and electrify fencing around the full perimeter of the workcamp for its Red Chris Porphyry Copper-Gold Mine in northeastern B.C., as required.Electric fencing helps prevent dangerous interactions between people and wildlife, specifically in this case, grizzly bears, a blue-listed species of special concern in British Columbia. Project records show frequent grizzly bear activity in the area and at least two instances of problematic human/bear interactions in or around the camp.Multiple inspections of the project by EAO compliance and enforcement officers, going back as far as 2018, found repeated non-compliance with fencing requirements, including incomplete, not electrified or not operational fencing. The EAO has issued multiple warnings and orders.The deficiencies were rectified after the EAO ordered Newcrest again in July 2023 to have functioning electric fencing in place around the entire workcamp perimeter within 30 days or the workcamp would be shut down. An additional administrative penalty has been recommended related to the ongoing non-compliance and subsequent 2023 order, but a decision is still pending.While urgent issues identified during inspections that pose an immediate risk are addressed right away through enforcement tools such as warnings and stop-work orders, project operators may also be subsequently subject to financial penalties.The EAO takes compliance seriously. When a project receives an environmental assessment certificate, it contains legally binding requirements that must be followed for the life of the project. These requirements are intended to prevent negative environmental, social, cultural, health or economic impacts and impacts to First Nations.As a neutral regulator, the EAO has a team of compliance and enforcement officers who monitor all certified projects, conducting both routine and spot inspections and taking enforcement action as necessary. This helps ensure that projects are built, operated and decommissioned in compliance with all requirements.The EAO continues to actively monitor the Red Chris mine to make sure all requirements are being met.Quick Facts:\n\tThe Red Chris Porphyry Copper-Gold Mine is located 18 kilometres southeast of the Village of Iskut and approximately 80 kilometres south of Dease Lake.\n\tNewmont Corporation acquired Newcrest Red Chris Mining Limited in November 2023.\n\tThe project received an environmental assessment certificate in 2005, one of the key authorizations required to build and operate the mine.\n\tThe approval included a requirement to implement specific measures to prevent or reduce the potential for adverse impacts to bears at the site.\n\tProject construction began in 2012 and the mine opened and began extracting ore in 2015.\nLearn More:For information about the administrative penalty, go to:\nhttps://www.projects.eao.gov.bc.ca/p/588510c4aaecd9001b8155e3/documents?keywords=RCDC-EF-2023&sortBy=-score&currentPage=1For information about the Red Chris Porphyry Copper-Gold Mine project, go to: https://projects.eao.gov.bc.ca/projects-list and search “Red Chris”For more information about the environmental assessment process, visit: \nhttps://www2.gov.bc.ca/gov/content/environment/natural-resource-stewardship/environmental-assessments/the-environmental-assessment-process\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ENV0073-002008.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ENV0073-002008.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Repairs coming to Canal Road on South Pender Island\n        ",
    "resolutionId": null,
    "contents": "\n            PENDER ISLAND – A section of Canal Road on South Pender Island damaged during the heavy rain and flooding in November 2021 will soon be repaired, improving safety and reliability for residents and visitors.A tender for the repair project has been posted to BC Bid. Work is expected to begin in February 2024, including:\n\tclearing, rock blasting and offloading the existing slide and roadway;\n\trealigning the road onto solid bedrock;\n\tupsizing the existing culvert;\n\tinstalling a reinforced retaining wall; and\n\tbuilding a temporary barge landing facility at Boundary Passage Drive to transport equipment and materials.\nThe damaged section of road is approximately 2.5 kilometres east of Pender Canal Bridge, the link between North Pender Island and South Pender Island. Permanent repairs will increase the road’s resilience in future extreme rain events, helping island residents safe and connected.Safety measures were implemented following the flooding damage to the road, including single-lane-alternating traffic with timed signals at each end of the site, slope deformation monitors to track earth movement and load restrictions during and after significant rain events.Crews will continue to monitor road deformation and perform necessary maintenance throughout the project.Additional federal environmental permitting has been secured due to the project’s proximity to the Gulf Islands National Park Reserve. Revegetation and mitigation measures will be in place following construction.Single-lane-alternating traffic will remain in place for the duration of the work. Drivers should expect delays, including intermittent road closures for up to four hours. All efforts will be made to minimize traffic disruptions during peak travel times. Advance notice of traffic disruptions will be provided via DriveBC.Drivers are reminded to drive for the conditions, observe construction-zone speed limits and follow the direction of traffic-control signs and personnel.Updates will be available at @DriveBC on X (Twitter) and online: https://DriveBC.ca\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0210-002006.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0210-002006.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Minister’s statement on major forfeiture of PacNet assets\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Mike Farnworth, Minister of Public Safety and Solicitor General, has released the following statement regarding the B.C. Civil Forfeiture Office’s single largest forfeiture in the history of the program:“Today, the B.C. Civil Forfeiture Office has concluded proceedings that will result in the forfeiture of $10 million from PacNet Services Ltd., a money-service business that was headquartered in B.C. and provided payment-processing services, including to individuals found guilty of or alleged to be running fraudulent scams against vulnerable seniors and other persons in Canada and around the world.“This is the single largest forfeiture of assets in the history of the civil forfeiture program. I wish to specially acknowledge the work of the Vancouver Police Department which investigated PacNet and referred the matter to the Civil Forfeiture Office, as well as the financial intelligence provided by the Financial Transactions and Reports Analysis Centre of Canada (FINTRAC) which supported this process.“I can confirm that we will continue to pursue the forfeiture of assets that are suspected to be proceeds of unlawful activity and redirect them to community safety and crime-prevention initiatives. This major forfeiture sends a clear message that British Columbia will continue to take decisive action against suspected proceeds of unlawful activity.“PacNet Services Ltd. will forfeit the $10 million pursuant to a settlement agreement with the director of civil forfeiture, under which there has been no admission or finding of unlawful activity on the part of PacNet Services Ltd. or its principals.”Quick Fact:\n\tThe filed Fifth Further Amended Notice of Civil Claim and the filed Consent Forfeiture Order can be found on Court Services Online by referencing Supreme Court of British Columbia Vancouver Registry #S-18260.\n\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0093-002007.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0093-002007.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Mental-health, substance-use supports available during holiday season\n        \n            What to know about available mental-health, substance-use supports\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – While the holiday season is a time for celebrations, it can also be a time of year when people may feel lonely, stressed or triggered.The past few years have been difficult for people due to global unrest, the lasting impacts of natural disasters and the pandemic. On top of this, people in B.C. continue to lose friends, family and community members to unrelenting toxic-drug poisonings.These challenges can adversely affect people’s mental health. If you are struggling emotionally or if you know someone who is, please reach out for help. Crisis supports and resources are available online, over the phone and in person.People continue to be affected by the devastating effects of the poisoned-drug supply. It is a very dangerous time for people who use illicit street drugs. It is important that those who use drugs get them tested and do not use alone. The Province has a wide range of life-saving services available, such as drug checking, supervised-consumption sites, prescribed pharmaceutical alternatives, treatment and recovery, and more.The Province has expanded mental-health and substance-use care to meet people where they are at, no matter where they are in their journey, so they can connect to the care that is right for them. If you or someone you know is struggling this season and beyond, please know that care is available.Learn More:To learn about mental-health and substance-use supports in B.C., visit: https://helpstartshere.gov.bc.ca/For more information and resources for youth in B.C., visit: https://poisondrugs.gov.bc.ca/To read A Pathway to Hope roadmap, government’s plan to build an integrated system of mental-health and addictions care for people in B.C., visit: https://news.gov.bc.ca/files/BCMentalHealthRoadmap_2019.pdfA backgrounder follows.\n        \n            The holiday season is a time to enjoy and celebrate and it’s also a time to take special care of your mental health and the mental health of those close to you. If you need support during the holidays or any time of the year, please reach out. Help is available.Guides to mental-health and substance-use services:\n\tProvince of B.C. online guide for finding mental-health and substance-use supports is available at:  https://helpstartshere.gov.bc.ca/\n\tProvince of B.C. online guide for virtual mental-health supports is available at: https://gov.bc.ca/MentalHealthSupports\nCrisis and suicide helplines:Canada’s suicide-crisis helpline: 988 (call or text). A safe space to talk, 24 hours a day, every day of the year.Crisis intervention and suicide-prevention centre: \n\tConfidential, non-judgmental, free emotional support for people experiencing feelings of distress or despair, including thoughts of suicide.\n\tCall 1 800 SUICIDE (784-2433) or visit: https://crisiscentre.bc.ca/\nKUU-US crisis-response service: \n\t24/7, culturally aware crisis support for Indigenous people in British Columbia.\n\tCall 1 800 588-8717 or visit: https://www.kuu-uscrisisline.com/​\nOverdose prevention:LifeGuard app:\n\tThe app utilizes a 50-second timer activated by the person using drugs before taking their dose. If the user does not stop the timer alarm, a text-to-voice call will go to 911 alerting medical dispatchers of a potential overdose.\n\tDownload the app at: https://lifeguarddh.com/\nProvince of B.C. overdose prevention website: To learn about services and strategies to prevent overdoses, visit: https://www2.gov.bc.ca/gov/content/overdose/what-you-need-to-know/overdose-preventionNational overdose response service (NORS):\n\tOffers access to harm reduction and social support through a telephone line. The line is operated by persons with lived and living experience of substance use to support individuals who are using alone.\n\tCall 1 888 688-6677 or visit: https://www.nors.ca\nMental-health and substance-use services, supports and referrals:Urgent and primary care centres:\n\tMental-health and substance-use support can be found at urgent and primary care centres in 31 locations throughout B.C. where clinicians are available 365 days a year for same-day access.\n\tTo know more, visit: https://www.healthlinkbc.ca/health-services/urgent-and-primary-care-centres\nAlcohol and drug information and referral service:\nCall toll-free 1 800 663-1441 or 604 660-9382 (Lower Mainland) to find resources, supports and referrals.First Nations virtual doctor of the day:\n\tVirtual doctors can provide referrals to the virtual substance-use and psychiatry service.\n\tCall 1 855 344-3800 to book an appointment.\nHealthLinkBC mental-health learning centre: \nCall 811 (24/7) or visit: www.healthlinkbc.ca/mental-health-substance-use/mental-health  Counselling by community: \n\tFree or low-cost counselling is provided through community-based organizations in all parts of B.C.\n\tTo find an organization near you, visit: https://caibc.ca/ccfprofiles/\nPhone and virtual counselling and mental-health supports:B.C. mental-health support phone line:\n\t24/7 confidential emotional support, information and referrals.\n\tCall 310-6789 (no area code needed).\nBounceBack: \n\tFree online, video and phone-based skills-building program for seniors, adults and youth (13 years and older) experiencing low moods, mild to moderate depression, anxiety, stress or worry.\n\tFor more information, visit: https://bouncebackbc.ca\nProvince of B.C. online guide for virtual mental-health supports is available at: https://gov.bc.ca/MentalHealthSupportsChildren and youth programs and services:Here2Talk:\n\tConfidential, free counselling and referral services by app, phone or online chat available for all registered post-secondary students, 24 hours a day, seven days a week.\n\tCall 1 877 857-3397, or 1 604 642-5212 for students calling from outside of Canada (international calling charges may apply).\n\tTo know more, visit: https://here2talk.ca/\nKidsHelpPhone:\n\tImmediate counselling, support, information and referrals available 24/7.\n\tYouth can call 1 800 668-6868 or text TALK to 686868. Texting support for adults is available by texting TALK to 741741.\n\tTo know more, visit: https://kidshelpphone.ca/\nFoundry:\n\tFoundry virtual services are available provincewide for people 12-24 and their caregivers.\n\tServices include counselling, primary care, peer support and group sessions.\n\tAll services are free and confidential.\n\tCall 1 833 FOUNDRY (308-6379) or visit: https://foundrybc.ca/virtual/\nFamilySmart:\n\tProvides emotional support, information, resources and help in navigating services for parents and caregivers of a child, youth or young adult with a mental health and/or substance-use challenge.\n\tTo know more, visit: https://familysmart.ca/\nMinistry of Children and Family Development: \n\tSupports all children, youth and families in British Columbia to live safe and healthy lives, and provides programs and services to support child and youth mental health.\n\tTo find a child and youth mental-health intake clinic near you, visit: https://gov.bc.ca/ChildYouthMentalHealthIntakeClinics\nEASE (Everyday Anxiety Strategies for Educators) At Home:\n\tFree anxiety activities and resources for B.C. parents, caregivers and families to help children manage worries and everyday anxiety at home. \n\tView or download these activities for grades K-7 at: https://healthymindsbc.gov.bc.ca/ease-at-home-k-7/ or for grades 8-12 at https://healthymindsbc.gov.bc.ca/ease-at-home-8-12/\nKelty mental-health resource centre: \n\tFree mental-health and substance-use information, resources and peer support for B.C. parents, caregivers and families of children and youth.\n\tCall 1 800 665-1822 or visit: https://keltymentalhealth.ca/\nConfident Parents: Thriving Kids:\n\tTelephone-based skill-building programs offered through the Canadian Mental Health Association – B.C. Division to support parents with children aged 3-12 experiencing behavioural or anxiety challenges.\n\tTo know more, visit: https://welcome.cmhacptk.ca/\nBig Worries, Strong Spirit:\n\tThe We are Indigenous support program is a free telephone-coaching program supporting First Nations, Metis and Inuit families in B.C., whose children aged 3-12 years are struggling with the experience of big worries or fears.\n\tBuilding off the success of Confident Parents: Thriving Kids anxiety program, the program was guided, created and developed through Indigenous perspectives for Indigenous families.\n\tTo know more, visit: https://welcome.cmhacptk.ca/bigworries. \nYouth substance-use treatment services: For information on how to access youth-focused substance-use treatment beds, including information on referral and facility locations throughout the province, visit: https://gov.bc.ca/youthsubstanceusecareY Mind and Mind Medicine:\n\tA free seven-week early-intervention program for people 13-30 experiencing mild to moderate anxiety.\n\tTo know more, visit: https://www.ymca.ca/ymind\nSupports for seniors:BC211: Phone or text 211 - Seniors looking for help or people would like to volunteer to help seniors, including virtual or telephone visits, visit: https://www.bc211.ca/Supports for frontline workers:Care to Speak:\n\tPeer support for B.C. healthcare workers.\n\tTo access support, call 1 866 802-7337 (PEER) or visit: https://careforcaregivers.ca/caretospeak/  \nCare for Caregivers:\n\tMental-health support for health-care providers, including trusted information, free workshops to support employees and quick daily-coping tips.\n\tTo know more, visit: https://www.careforcaregivers.ca/\nMobile response team (MRT):\n\tMental-health support for health-care workers in long-term care facilities and those working on the frontlines of the overdose public health emergency.\n\tCall 1 888 686-3022 or email MRT@phsa.ca\nOnline mental-health hub:\n\tProvides information, webinars and workshops to help employees manage stress and build resilience.\n\tTo know more, visit: https://www.workmentalhealthbc.ca/\nTreatment and recovery services:Province of B.C. guide to treatment and recovery services is available at: https://www2.gov.bc.ca/gov/content/overdose/what-you-need-to-know/recovery-services-treatment-support\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MMHA0079-002005.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MMHA0079-002005.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Cache Creek crossing restoration moving ahead\n        ",
    "resolutionId": null,
    "contents": "\n            CACHE CREEK – Travellers passing through Cache Creek will soon have a safer, more reliable journey, with work about to begin on the Cache Creek Crossing Restoration Project. The Highway 97 Cache Creek Crossing Restoration Project includes the installation of a bridge to replace the culvert under Highway 97 where it crosses Cache Creek. The new four-lane bridge will be designed to handle peak river flows and debris, especially during spring freshet. It will accommodate increases in peak water flows caused by climate change and will be built to ensure structural stability against erosion.In addition to improving travel for Cache Creek residents, the upgrades will improve the resilience and reliability of the vital Highway 97 corridor.A $5.4-million contract for the project was awarded to Acres Enterprises Ltd. Work is scheduled to be complete by Aug. 31, 2024.Preparation work is underway and will include the relocation of a watermain in advance of bridge construction. During the coming months, construction crews will continue work at the site, such as construction of the bridge and realigning and widening the creek.Travellers are advised to watch for construction and traffic personnel.Learn More:For real-time updates, check the DriveBC website: https://www.drivebc.caFor more information about the project, visit: https://www2.gov.bc.ca/gov/content/transportation-projects/other-transportation-projects/cache-creek-crossing\n        ",
    "reportUrls": [],
    "date": "Dec. 19, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0209-002003.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0209-002003.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Parliamentary secretary’s statement on International Day to End Violence Against Sex Workers\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Kelli Paddon, Parliamentary Secretary for Gender Equity, has released the following statement in recognition of the International Day to End Violence Against Sex Workers:“Today, people worldwide rally for an end to violence against sex workers. Today, also known as Red Umbrella Day, is an important reminder that violence against people doing sex work remains prevalent in communities throughout B.C.“All people have a right to be treated with respect and dignity, to be safe in their homes and workplaces, to be free from violence and with equal access to supports and justice.“But we also know that there is far too much stigma, discrimination and violence against sex workers.“Last week, we released Safe and Supported: B.C.’s gender-based violence action plan, which includes support for bad-date reporting to create a system for sex workers to anonymously share reports of violent clients or negative incidents, helping to keep others safe.“Earlier in December, I visited the WISH Drop-In Centre Society, one of the community-based service providers that collaborates on the bad-date project along with Living in Community, PACE Society, Peers Resource Society and SWAN Vancouver. I’d like to recognize the important work of these organizations, along with so many others, for being there for sex workers and advocating for their safety and well-being.“On this day and every day, I encourage all British Columbians to speak out against discrimination, violence, oppression and stigmatization.“We are all so much stronger when we come together to raise awareness, lift up the voices of those with lived experience and address the critical issues that impact the most vulnerable in our communities.“On this important day, I join thousands in voicing my support for sex workers, their families and friends in calling for an end to the violence that remains all too prevalent here in B.C. and communities throughout the world.”Learn More:To learn about Bad Date & Aggressor Reporting Program (BC BDAR), visit: https://bcbdar.org/\n        ",
    "reportUrls": [],
    "date": "Dec. 17, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023FIN0074-001997.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023FIN0074-001997.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Expanded care coming to Burnaby Hospital\n        \n            What people are saying about the Burnaby Hospital redevelopment\n        ",
    "resolutionId": null,
    "contents": "\n            BURNABY – People in Burnaby are one step closer to getting expanded patient care as the Burnaby Hospital redevelopment moves forward with the structural building and concrete pouring completed.“We are marking an important milestone of the new six-storey Phase 1 pavilion of the Burnaby Hospital redevelopment project,” said Adrian Dix, Minister of Health. “It’s exciting to see the progress as this project will support our ongoing work to strengthen health care in British Columbia and provide people in Burnaby and the surrounding communities improved access to care in a modern hospital.”Completion of the structural work means the focus will shift to finishing the building’s exterior and interior.Phase 1 of the Burnaby Hospital redevelopment includes the construction of the new pavilion and the expansion and renovations of the existing Support Facilities Building. The pavilion will include maternity, neonatal intensive care, mental health in-patient and medical in-patient units. The estimated completion date for the new pavilion is 2025.“As we celebrate this milestone in the redevelopment of Burnaby Hospital, I will continue to work hard with our government to ensure people have access to care in the community, which is critical,” said Anne Kang, MLA for Burnaby-Deer Lake. The expansion and renovations of the Support Facilities Building, which includes the Jim Pattison Surgery Centre and the Burnaby Community Emergency Department, will feature 10 new or upgraded state-of-the-art operating rooms, renovations to the emergency department and a new energy facility.This announcement builds on the recently approved Phase 2 of the Burnaby Hospital redevelopment, which will add a new 160-bed inpatient tower and integrated cancer centre, which will include 54 ambulatory care rooms, 31 chemotherapy chairs, space for five linear accelerators, space for 2 PET/CT scanners, an oncology pharmacy, and clinical trials and research space.The redevelopment project will result in 399 beds across the campus.“I am pleased to celebrate this significant project milestone at Burnaby Hospital, which has been the heart of health care in this community for over 70 years,” said Dr. Victoria Lee, president and CEO, Fraser Health. “This redevelopment will add capacity to our hospital and bring in state-of-the-art equipment, enabling our staff and medical staff to provide high-quality care to our patients for many years to come. Thank you to our staff and medical staff who are epitomizing agility and innovation as they move this work forward.”The total cost of the redevelopment is more than $2.4 billion with funding from the Province, Burnaby Hospital Foundation and BC Cancer Foundation.“Our community came together in such a strong way by helping raise over $30 million to support Phase 1 of this redevelopment. I am certain that every one of our donors who contributed to this first step in our redevelopment is pleased to see the progress of the project, marked by this ceremonial event,” said Kristy James, president and CEO, Burnaby Hospital Foundation. “The foundation shares our gratitude to all our donors, including exceptional support from the Beedie family, Jim Pattison and the City of Burnaby that have inspired us all.”Burnaby Hospital opened in 1952. It provides a range of acute care services, including emergency care, critical care, surgery, maternity, neonatal intensive care, palliative and adult mental-health and substance-use services.Learn More:To learn more about Burnaby Hospital Redevelopment, visit: https://www.fraserhealth.ca/your-community/burnaby/burnaby-hospital-redevelopment-projectA backgrounder follows.\n        \n            Raj Chouhan, MLA for Burnaby-Edmonds –“This occasion is testament to the collaborative efforts of our partners and the community to make sure people have access to care in a fully redeveloped and modern hospital for decades to come.”Katrina Chen, MLA for Burnaby-Lougheed –“Health care is key to the well-being of our community. I am honoured to support this redevelopment project as we ‘top off’ this facility and continue to work together to provide more quality public health-care services.”Janet Routledge, MLA for Burnaby-North – “This is a significant step for people in Burnaby as we move forward on redeveloping Burnaby Hospital, and I thank all of our partners for working so hard for the community and I look forward to further critical and exciting project milestones.”Mike Hurley, mayor, Burnaby – “For more than 70 years, Burnaby residents have relied on the outstanding care provided by physicians and staff at the Burnaby Hospital. This redevelopment project will ensure that we can continue to meet the health-care needs of our community for generations to come.”\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0155-002001.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0155-002001.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New affordable homes coming for First Nations in Merritt\n        ",
    "resolutionId": null,
    "contents": "\n            MERRITT – First Nations families, elders and youth in Merritt will have access to more affordable rental homes, with construction underway on a 52-unit development.“People thrive when they can live in the community they know, close to their family and friends,” said Ravi Kahlon, Minister of Housing. “Our government is proud to support the Nicola Bands to build housing in their communities. These 52 new homes will play a key role in helping many elders, youth and families build good lives, and we will continue to work with Indigenous partners to build on- and off-reserve housing.”  The new four-storey building, located at 2640 Spring Bank Ave., will help address the housing needs for First Nations community members from five Nicola Bands: Upper Nicola Band, Lower Nicola Indian Band, Coldwater Indian Band, Nooaitch Indian Band and Shackan Indian Band. It will feature a mix of studio and one-, two- and three-bedroom units. Thirty-six of the 52 units will either be accessible or adaptable to accommodate current and changing accessibility needs. Each unit will have a private balcony.The Nicola Native Lodge Society is providing the land for the project and will manage the housing. The development will accommodate intergenerational living, such as elders and youth in the same building, which is aligned with the society’s vision for culturally safe housing. The building will also feature an amenity space for social gatherings and cultural ceremonies.Construction is expected to be completed by spring 2025.This project is part of a $19-billion housing investment by the B.C. government. Since 2017, the Province has more than 77,000 homes delivered or underway, including approximately 170 homes in Merritt.Quotes:Arnie Lampreau, Chief, Shackan Indian Band –“This project was a dream of many of our Nlaka’pamux Elders and leaders, many of whom have passed away and never saw the dream become a reality. The thought of going outside Nicola Valley was one of the fears of our people. This is a chance for the future people to retire and have a safe place to live.”Stuart Jackson, Chief, Lower Nicola Indian Band –“It is with great pleasure that this project has come to fruition. Housing shortages are a crisis in our communities and this project will help alleviate some of these challenges. I raise my hands to all the people behind the scenes who turned this dream into a reality. Huxme’l knee.”Sharon Stone, board director, Shackan Indian Band –“We recognize housing has an impact on many First Nations people. We need a place to call home, a sense of belonging, a sense of identity to be grounded to, and walk among the living plants, trees, rocks and water. Once we feel this, we will be at peace with ourselves, family and connected to one another.”John Aldag, Member of Parliament for Cloverdale-Langley City on behalf of Sean Fraser, federal Minister of Housing, Infrastructure and Communities –“Investing in affordable housing is more important than ever. Through the partnership with the Government of British Columbia, people of all ages will have access to housing so they can remain in their community. This project announced today is just one example of what we can achieve with our partners. I look forward to the completion of these housing projects and the positive impact it will have in our community.”Michael Goetz, mayor of Merritt –“We are thrilled to welcome such a distinctive and inclusive affordable housing project like the Spring Bank multi-unit development within our community. This project will not only bring much needed housing to the community, but it will also bring us one step closer to building a more integrated and supportive community that embraces our diverse cultures and honours the spirit of reconciliation.”Quick Facts:\n\tThe Province, through BC Housing, is contributing approximately $10 million to the project through the Building BC: Indigenous Housing Fund.  \n\tA joint contribution of approximately $1.3 million, through the Canada-British Columbia Bilateral Agreement under the National Housing Strategy, also went toward the project.\n\tBudget 2023 added approximately $1.3 billion to the Indigenous Housing Fund, for a total of approximately $1.8 billion to build 3,500 units of social housing for Indigenous Peoples on and off reserve.\n\tCanada’s National Housing Strategy is a 10-year, $82-plus billion plan that will give more people in Canada a place to call home.  \nLearn More:To learn about B.C.’s new Homes for People action plan, visit: https://news.gov.bc.ca/releases/2023HOUS0019-000436To learn about the steps the Province is taking to tackle the housing crisis and deliver affordable homes for people in British Columbia, visit: https://strongerbc.gov.bc.ca/housing/To find out about the National Housing Strategy, visit: https://www.placetocallhome.ca/For information about Canada Mortgage and Housing Corporation, visit: https://www.cmhc-schl.gc.ca/\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0180-001999.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0180-001999.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            B.C. supports implementation of emergency management act, keeping people safe\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Under B.C.’s new emergency management legislation, people and communities are safer and better prepared for the increasingly severe emergencies and disasters the province is experiencing due to climate change.The work of an expert task force on emergencies is also well underway and will reinforce the legislation by providing action-oriented recommendations in advance of the 2024 wildfire season. B.C.’s newly enshrined Emergency and Disaster Management Act is focused on disaster risk reduction and enhanced emergency preparedness, and recognizes Indigenous Peoples’ inherent rights of self-government in relation to emergency management.“In B.C., summers are getting hotter, winters are getting more unpredictable, and flooding is becoming more severe. The new Emergency and Disaster Management Act places a greater emphasis on mitigating the impacts of emergencies before they happen,” said George Heyman, acting Minister of Emergency Management and Climate Readiness, and Minister of Environment and Climate Change Strategy. “We’re working with First Nations and local governments to ensure our collective readiness against climate-related hazards, but time is of the essence. That’s why we’re providing funding to help communities put Indigenous engagement requirements in the act into motion.”The new act brings in a number of changes that make it the most comprehensive and forward-looking emergency management legislation in Canada. Some of these changes include:\n\tincreasing emphasis on disaster risk reduction and shifting from a response focus to all four phases of emergency management (mitigation, preparedness, response and recovery);\n\timplementing a need for climate-informed risk assessments by provincial ministries, local authorities, critical infrastructure owners and public-sector agencies to better understand and prepare for the hazards communities face;\n\trecognizing Indigenous Peoples as true partners in emergency management and establishing a framework for agreements between First Nations and other authorities that can help advance shared decision-making and co-ordination.\nBy working together, communities can be better prepared for emergencies and can more effectively co-ordinate response efforts. Guided by the United Nations Sendai Framework for Disaster Risk Reduction and B.C.’s Declaration on the Rights of Indigenous Peoples Act, the new Emergency and Disaster Management Act includes engagement provisions that require municipalities and regional districts to consult and co-operate with Indigenous governing bodies and incorporate Indigenous knowledge and cultural safety across emergency management practices.To support this work, the Province is providing $18 million to communities to consult and collaborate in advance of emergency events. The funding is intended to:\n\tsupport relationship-building across jurisdictions through consultation and co-operation with Indigenous governing bodies;\n\tensure the incorporation of Indigenous knowledge and cultural safety across emergency management practices;\n\tsupport policy improvements that reflect the lived experience of Indigenous Peoples and;\n\taddress the disproportionate effects on Indigenous Peoples during emergency events.\nUnder the act, municipalities and regional districts must include available Indigenous knowledge in their approach to emergency management, ensuring this knowledge contributes to actions that are taken before, during and after emergencies.“It is critical for local governments and authorities to fully understand our inherent rights and jurisdiction in relation to emergency management,” said Robert Phillips, First Nations Summit political executive. “We welcome this new funding to support First Nations and local authorities’ engagement as an essential and necessary component to the implementation of the act. First Nations governments are in full support of building strong relationships and open communication regarding emergency planning, prevention, response and recovery, with their neighbouring authorities and governments.”Indigenous knowledge is based on thousands of years of accumulated experiences and can provide expertise and insight into how to reduce disaster risk and manage emergencies. The United Nations Office for Disaster Risk Reduction has recognized that local Indigenous knowledge is a valuable contributor to planning and decision-making in emergency management.“With the climate crisis rapidly escalating, it is critical that First Nations are supported to be full partners in decision-making about our territories,” said Chief Don Tom, vice-president of the Union of BC Indian Chiefs. “Engagement on legislation and regulations is incredibly expensive and requires legal and technical capacity, and the funding announced today will help us participate.”Terry Teegee, Regional Chief of the BC Assembly of First Nations, said: “The Chiefs in B.C. recently supported the First Nations Disaster Risk Reduction Action Plan that guides priorities for improving emergency management jurisdiction and services by First Nations. B.C. and local governments must respect and implement First Nations priorities, laws and policies. The climate emergency affects First Nations disproportionately more than any other people and we have only seen inadequate investments in all pillars of emergency management. All new regulations require First Nations to co-draft, co-develop and reach consent. We applaud the Province’s efforts to improve emergency management in B.C.”Public engagement is underway on future regulations, including for local authorities and post-emergency financial assistance. People are encouraged to share their experiences and feedback on Disaster Financial Assistance to help inform new regulations for people recovering from a disaster. Engagement is open until Jan. 31, 2024.Once local authority regulations are developed and in force, municipalities and regional districts will be required to include available Indigenous knowledge in risk assessments and emergency management plans. Plans will identify hazards and potential consequences, including consequences to sites of heritage value, and include a consideration of people disproportionately impacted by the effects of emergencies.All First Nations in B.C. are eligible to apply for the $200-million Declaration Act Engagement Fund. This fund is helping enhance capacity for First Nations to consult and co-operate with the Province on the implementation of the Declaration Act Action Plan, as well as the development and alignment of provincial laws with the UN Declaration on the Rights of Indigenous Peoples.“The Declaration Act Engagement Fund is creating flexibility for First Nations to engage with the Province on areas of interest in ways that respond to their unique needs and priorities, including emergency management preparedness,” said Murray Rankin, Minister of Indigenous Relations and Reconciliation. “The new Emergency and Disaster Management Act responds to a key action item in our Declaration Act Action Plan and supports the work being done together to implement the Declaration Act.”Communities can also access funding for preparing for and mitigating emergencies and climate-related disasters through the $369-million Community Emergency Preparedness Fund (CEPF), which has six funding streams. The next application deadline for the Disaster Risk Reduction-Climate Adaptation funding stream is March 28, 2024.“Improving collaboration and co-operation between First Nations and local governments will strengthen the ability of all communities to prepare for emergencies and work together when they arise,” said Trish Mandewo, president, Union of British Columbia Municipalities. “The consultation requirement placed upon local governments through the recent emergency management legislation is as considerable as it is important. The funding provided through this initiative and the CEPF program will assist local government engagement with neighbouring First Nations. Local governments look forward to receiving guidance from the Province on the details necessary to fulfil this requirement.”The legislation follows global best practices for disaster risk reduction and incorporates all four phases of emergency management: mitigation, preparedness, response and recovery.Quick Facts:\n\tThe Emergency and Disaster Management Act replaces the Emergency Program Act, which hadn’t been substantially updated since 1993.\n\tModernized emergency management regulations to complement the act are being introduced in a phased approach.\n\tThe regulations, including local authority and post-emergency financial assistance, will be developed in consultation and co-operation with First Nations.\n\tIn addition to continuous improvements to emergency management, the act will be reviewed within five years.\n\tA 14-member task force composed of experts in emergency and wildfire management has been appointed by Premier David Eby and is working on providing recommendations on enhancing emergency preparedness and response in advance of the 2024 wildfire season.\nLearn More:For guidelines on the Indigenous Engagement Requirements funding program, visit:\nhttps://www2.gov.bc.ca/gov/content/safety/emergency-management/local-emergency-programs/financial/ierfpTo learn more about the Emergency and Disaster Management Act, including details about phased implementation, visit:\nhttps://www2.gov.bc.ca/EmergencyManagementActTo participate in the public engagement on emergency management regulations, visit:\nhttps://engage.gov.bc.ca/emergencymanagementregulationsTo learn more about B.C.’s Declaration on the Rights of Indigenous Peoples Act, visit:\nhttps://www2.gov.bc.ca/gov/content/governments/indigenous-people/new-relationship/united-nations-declaration-on-the-rights-of-indigenous-peoplesFor more information about B.C. legislation, visit: https://workingforyou.gov.bc.ca/legislation\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023EMCR0080-001992.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023EMCR0080-001992.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Connectivity funding application intake opens Jan. 8\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The third intake of the Connecting Communities BC (CCBC) funding program will open for applications on Jan. 8, 2024.In March 2022, the governments of B.C. and Canada announced a partnership to invest as much as $830 million, each contributing $415 million toward high-speed connectivity infrastructure projects in rural and remote areas.Through the CCBC program, the Province aims to provide all remaining underserved households and First Nations communities with access to high-speed internet by 2027. This program fulfils a call to action in the Declaration Act Action Plan.Eligible applicants can apply for funding to support the expansion of high-speed internet to households in specific areas of interest in the province that do not have access to internet speeds of at least 50 Megabits per second (Mbps) download speed and 10 Mbps upload speed.This intake is open to First Nations-led or First Nations-supported projects in any area of the province. Otherwise, areas of interest for Intake 3 will target connectivity gaps and remote areas in the northeast, northwest and along the central and north coast, including parts of Haida Gwaii and northwestern Vancouver Island.Areas of interest are outlined in the application guide available online: https://www2.gov.bc.ca/gov/content/governments/connectivity-in-bc/20601/20601-63737Intake 3 will be open until March 14, 2024. Subsequent intakes will be launched until the program has achieved its connectivity goals.The Connecting Communities BC program completed two intakes between September 2022 and February 2023. Project applications from previous intakes are in review, with approved projects expected to be announced in a short time.Learn More:Connecting Communities BC Application Guide:\nhttps://www2.gov.bc.ca/gov/content/governments/connectivity-in-bc/20601/20601-63737Connecting Communities BC:\nwww.gov.bc.ca/connectingcommunitiesbcConnectivity in B.C.:\nhttps://www2.gov.bc.ca/gov/content/governments/connectivity-in-bcStrongerBC: Good Lives in Strong Communities:\nhttps://news.gov.bc.ca/files/Good-Lives-Strong-Communities-2023.pdf\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023CITZ0033-001998.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023CITZ0033-001998.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Young artists among people receiving $18.2 million in provincial funding\n        ",
    "resolutionId": null,
    "contents": "\n            SURREY – Young artists are among the people benefiting from an $18.2-million investment in arts and culture programs throughout the province through Community Gaming Grants.Arts Umbrella, a non-profit centre for arts education with locations in Vancouver, Surrey and South Surrey, received $225,000 to provide free community programming for young artists in dance, theatre, and art and design.“The continued support we receive from Community Gaming Grants is critical, helping us to provide nurturing, stimulating and inclusive community programming completely free of charge to over 6,500 deserving young people each year,” said Susan Smith Alexander, senior director of programming, Arts Umbrella. “This stable funding helps us to plan with confidence and inspire children and youth who otherwise would not have access to quality arts programming.”Similar arts-and-culture grants will provide greater community access to a variety of programs at more than 650 organizations across B.C.“Through Community Gaming Grants, the Province is helping organizations like Arts Umbrella to reach more people through their work,” said Anne Kang, Minister of Municipal Affairs. “From arts and literature to festivals and museums, B.C. has a thriving arts-and-culture sector that keeps our communities vibrant and healthy. These grants are helping organizations to keep costs down for art students, museum visitors, festival-goers and anybody participating in arts-and-culture activities.”Grant recipients will deliver programs that preserve and/or provide public access to arts, heritage or culture, including:\n\tLadysmith Festival of Lights ($46,000);\n\tNelson and District Museum, Archives, Art Gallery and Historical Society ($36,400);\n\tOkanagan Symphony Society ($164,500);\n\tSociété francophone de Maillardville for the Festival du Bois in Coquitlam ($90,000); and\n\tStage North Theatre Society ($24,500).\nThe funding is part of $140 million provided annually through Community Gaming Grants to not-for-profit organizations throughout B.C. These grants help approximately 5,000 organizations to deliver ongoing programs and services in their communities.The Province has also announced an additional $11.2 million in Community Gaming Grants for 1,300 school parent advisory councils (PACs) and district parent advisory councils (DPACs) in B.C.Quotes:Lana Popham, Minister of Tourism, Arts, Culture and Sport – “B.C. has the greatest concentration of artists and cultural workers per capita in Canada. We're proud to support the arts-and-culture sector through the Community Gaming Grants, as it plays a vital role in promoting the resilience, vitality and well-being of our communities. We strongly believe that everyone should have access to arts and culture in their communities.”Mike Starchuck, MLA for Surrey-Cloverdale – “The cost of everything is going up, which makes it harder for people to find affordable things to do with friends and family. This funding will help not-for-profit organizations keep events and festivals free or low-cost, and it will help families keep their kids in art classes, dance lessons, music or other activities.”Christine Hawkins, chair, BC Association for Charitable Gaming –“The BC Association for Charitable Gaming applauds the tenacity of arts-and-culture organizations across the province as they produce transformational events in their communities. Gaming funding is a critical component of the arts organizations’ annual production cycle and we are grateful for this support to the communities served.”Paul Larocque, president and CEO, Arts Umbrella –“When I think of the next generation of young people, I have great faith in the role that arts education can play in their lives. I have witnessed so many transformative moments when a new passion is discovered. Thanks to our supporters and Community Gaming Grants, our Donor-Funded Community Programs harness the same expertise as our tuition-based classes, bringing the Arts Umbrella experience to children and youth across Metro Vancouver, at little to no cost.”Quick Facts:\n\tSince 2017, Community Gaming Grants have annually supported programs that directly benefit British Columbians and their communities, helping more than 5,100 arts-and-culture sector not-for-profit organizations.\n\tGrants also fund human and social services, sport, public safety and environmental conservation, as well as parent and district parent advisory councils in B.C. schools.\n\tEligible organizations can apply for one of the six sectors of grants, as well as a capital-project grant.\nLearn More:To see the full list of arts-and-culture sector recipients, visit: https://news.gov.bc.ca/files/CGGPayments_Apr2023toSept2023_ArtsCulture.pdfFor more information about $11.2 million provided to parent advisory councils, visit: http://news.gov.bc.ca/releases/2023MUNI0053-001975For more information on Community Gaming Grants, visit: https://www2.gov.bc.ca/gov/content/sports-culture/gambling-fundraising/gaming-grants/community-gaming-grants\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0055-001993.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0055-001993.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Student activities enhanced by funding for parent advisory councils\n        ",
    "resolutionId": null,
    "contents": "\n            COLDSTREAM – Students from kindergarten to grade 12 are learning and growing beyond the classroom, thanks to $11.2 million in funding for parent advisory councils in B.C.“As a mother and a teacher, I know first-hand how important it is for students to learn, grow and have fun together outside the classroom,” said Anne Kang, Minister of Municipal Affairs. “Parents who volunteer their time and energy to create opportunities for students shouldn’t be left to do all the fundraising themselves. I know these grants are helping parent advisory councils create vibrant and healthy communities in their kids’ schools.”More than 1,300 parent advisory councils (PACs) and district parent advisory councils (DPACs) in B.C. received Community Gaming Grants to pay for events, activities and equipment in support of student learning and parent involvement. For example, Coldstream Elementary School’s PAC received $6,440 and plans to target funding to ensure all Grade 3 students have access to swimming lessons.“Our PAC is focused on providing students with experiences not all families can afford these days,” said Saleha Patel, president, Coldstream Elementary School parent advisory council. “We live in an area with many lakes and knowing how to swim is critical. Without funding from the PAC, our students might not have the chance to take swimming lessons to gain this necessary life skill.”PACs can use the grants to pay for equipment and costs associated with a range of extracurricular activities, including sports, performances, movie nights, dances, field trips and conferences. DPAC groups can use the funds for informational and promotional materials for parents, meeting-room rentals, presenter fees, travel for meetings, and more.“Parents and our school PACs are essential partners in our schools. The incredible work that they do creates a strong sense of community, as well as activities and opportunities, for all students to connect, learn and thrive,” said Rachna Singh, Minister of Education and Child Care. “These annual Community Gaming Grants to our PACs support learning, sport, arts and play for all kids in our community schools.”The $11.2 million for PACs and DPACs is part of $140 million provided annually through Community Gaming Grants to not-for-profit organizations throughout B.C. These grants help approximately 5,000 organizations to deliver ongoing programs and services in their communities.The Province has also announced an additional $18.2 million in Community Gaming Grants for arts and culture organizations in B.C.Quotes:Harwinder Sandhu, MLA for Vernon-Monashee – “Parent advisory councils play an important role in schools for students and parents alike. As a mother of school-age children, I understand how hardworking and important our PACs are. They do exceptional work to support our students and contribute to their school life experience. I am so excited about this funding. I know this will help thousands of amazing volunteer teams deliver extracurricular activities for all our students in Vernon-Monashee.”Christine Hawkins, chair, BC Association for Charitable Gaming (BCACG) –“Once again, students across the province are benefiting from direct gaming funding in 2024 through their parent and district parent advisory councils. Our organization assists both councils as they access this important funding source, which underpins community involvement in B.C.”Laura Ward, president, BC Confederation of Parent Advisory Councils – “This essential funding supports enriching activities, experiences and equipment for students, and for parent education and information. By bridging resource gaps and empowering parents to be involved, the Community Gaming Grants funding plays a crucial role in promoting collaboration, community engagement and student success throughout British Columbia’s public education system.”Quick Facts:\n\tCommunity Gaming Grants have annually supported programs and capital projects that have benefited people in British Columbia and their communities since 2017.\n\tThe Province also provides Community Gaming Grants to other sectors such as human and social services, public safety, environmental conservation, arts and culture, and sports.\nLearn More:To view the list of PAC and DPAC sector recipients, visit: https://news.gov.bc.ca/files/CGGPayments_Apr2023toSept2023.pdfFor more information about $18.2 million provided to parent advisory councils, visit: https://news.gov.bc.ca/releases/2023MUNI0055-001993For information about Community Gaming Grants, visit: https://www2.gov.bc.ca/gov/content/sports-culture/gambling-fundraising/gaminggrants/community-gaming-grants\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0053-001975.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0053-001975.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Drivers should plan for Stanley Park Causeway lane closures this weekend\n        ",
    "resolutionId": null,
    "contents": "\n            VANCOUVER – Drivers are reminded of lane closures this weekend on the Stanley Park Causeway.On Saturday, Dec. 16 and Sunday, Dec. 17, 2023, one lane will be closed from 8 a.m. until 2 p.m. Northbound pedestrians and cyclists will be detoured through Stanley Park and to west side of the causeway/bridge.The closures are in support of an urgent tree-removal project in Stanley Park led by the Vancouver Board of Parks and Recreation.The full schedule of December and January weekend lane closures can be found on the Vancouver Board of Parks and Recreation website: https://www.vancouver.ca/stanley-park-treesWhile efforts are being made to keep impacts to a minimum, people should plan for delays and transit changes to and from the North Shore, and to consider using the Ironworkers Memorial Second Narrows Crossing as an alternative during the times noted above.Watch for traffic-control personnel, obey signs and check DriveBC for updates: https://drivebc.ca/\n        ",
    "reportUrls": [],
    "date": "Dec. 15, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0208-001986.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0208-001986.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New data released on people experiencing homelessness in B.C.\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – An innovative approach to data collection and reporting is helping government better understand the underlying factors that lead to homelessness and better support people in finding stable housing and services that meet their needs.The 2021 estimate of the number of people experiencing homelessness in B.C., an update from the 2020 and 2019 estimates, is part of government’s Preventing and Reducing Homelessness Integrated Data project. The project estimates the number of people who experienced homelessness in the province.As the data grows, it allows government to make evidence-based decisions on what services and supports are needed most to prevent or end the cycle for people experiencing homelessness in B.C.The report adds another year of data to the 2020 and 2019 estimates that were released last year. This project links de-identified data from the Ministry of Social Development and Poverty Reduction, the Ministry of Health and BC Housing to estimate the number of people who have experienced homelessness in B.C.With an updated data set for 2021, analysts can begin to see the emergence of some patterns. The numbers offer the ability to monitor seasonal and geographic trends, and demographics of individuals in B.C. who experience homelessness.According to the research, the latest findings show:\n\t11,896 people, on average, were identified as experiencing homelessness each month, (range = 11,331 in February to 12,758 in December).\n\t26,240 people experienced homelessness in B.C. at some point in 2021. In comparison, 24,270 people experienced homelessness at some point in 2020, and 24,507 people experienced homelessness at some point in 2019.\n\t10,424 people were newly identified in 2021 as not having experienced homelessness in 2020 or 2019, while 10,013 people who had experienced homelesness in 2020 did not meet the definition of experiencing it again in 2021.\nThe data counts people who accessed income assistance and people who reported having no fixed address and people who accessed a shelter over the course of 2021. The data also shows where people are experiencing homelessness, whether their homelessness was short term or chronic, and examines when people enter and exit homelessness.Government is using this data to implement Belonging in BC, the Province’s plan to prevent and reduce homelessness. The plan adds thousands of new supportive housing units and hundreds of complex-care spaces provincewide, and creates multidisciplinary regional response teams designed to rapidly respond to encampments to better support people sheltering outdoors to move inside.Quick Facts:\n\tThe Belonging in BC homelessness plan is delivered through initiatives across government and supported by investments of $1.18 billion in Budget 2023 and $633 million in Budget 2022.\n\tSince 2017, government has helped approximately 5,600 people who were experiencing, or at risk of, homelessness move into new supportive housing.\n\tAnother 2,300 supportive homes are underway, including approximately 860 homes coming to Vancouver and 250 in Victoria.\n\tIn addition, the Province is funding more than 5,500 shelter spaces in 55 communities throughout the province this winter, including permanent, temporary and extreme-weather response shelters.\nLearn More: To view the full report and find out more about what the Province is doing to help prevent homelessness, visit:\nhttps://www2.gov.bc.ca/gov/content/housing-tenancy/affordable-and-social-housing/homelessness/homelessness-cohort\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0179-001995.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HOUS0179-001995.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Minister’s statement on filing the next unexplained wealth order\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Mike Farnworth, Minister of Public Safety and Solicitor General, has released the following statement about an unexplained wealth order (UWO) application filing:“Today, another unexplained wealth order application was filed with the British Columbia Supreme Court, with a hearing date expected on Feb. 1, 2024.“I cannot comment on the filing of these unexplained wealth-order applications while they are before the court and the subject of ongoing litigation. However, I can confirm that we will continue to forfeit illegally obtained assets and redirect them to community safety and crime-prevention initiatives, which help repair the damage done by those who think that they can profit from crimes and illegal enterprises in British Columbia.“The public can be assured that British Columbia will continue to take decisive action against suspected unlawful activity. This UWO filing sends a clear message that we will seek out ill-gotten gains and redirect them to community safety initiatives.”Quick Fact:\n\tThe filed Notice of Civil Claim and the filed application for an unexplained wealth order can be found on Court Services Online by referencing Supreme Court of British Columbia Vancouver Registry #S-238490.\n\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0092-001994.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0092-001994.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Minister’s statement on City of Vancouver's resolution on Park Board\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Anne Kang, Minister of Municipal Affairs, has released the following statement in response to the City of Vancouver’s resolution on the Vancouver Park Board:“We respect the decision of Vancouver city council on the future of the park board. The Ministry of Municipal Affairs will begin work with the city to move forward on this significant change to governance in Vancouver. There are a number of items that need to be addressed, including land ownership and the future of the workers at the park board, and we need to make sure First Nations are consulted. We are asking the City of Vancouver to provide the Province with a transition plan to address these considerations so we can move forward together.”\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0054-001991.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MUNI0054-001991.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Fish-friendly flood infrastructure in Lower Fraser River protects communities, salmon\n        \n            Facts about the British Columbia Salmon Restoration and Innovation Fund\n        ",
    "resolutionId": null,
    "contents": "\n            COQUITLAM – The governments of B.C. and Canada are taking action to improve flood resilience for communities and support salmon runs in the Lower Fraser River area, helping protect homes and wild salmon.“As the impacts of climate change continue to threaten communities and the health of B.C.’s watersheds, it is more important than ever that we act now to both prevent flooding and support wild salmon runs,” said Nathan Cullen, Minister of Water, Land and Resource Stewardship and Minister Responsible for Fisheries. “The Resilient Waters project will benefit local communities, B.C. fisheries and the incredible diversity of fish, in particular wild salmon, that call the Lower Fraser River region home.”The Lower Fraser River and its tributaries are home to the largest collection of salmon runs in the world, supporting local communities and B.C. fisheries. But the watershed faces significant challenges, including outdated flood-control infrastructure that blocks vital migration routes for salmon.The B.C. Salmon Restoration and Innovation Fund (BCSRIF) will provide $3.6 million to support the Resilient Waters project. The Resilient Waters project is a collaborative effort led by MakeWay Charitable Society and involves partnerships with government agencies, Indigenous communities, non-profit organizations and research institutions, working together to address critical issues facing the salmon populations in the Lower Fraser Watershed.The goal of the project is to restore connections to more than 1,500 kilometres of wild salmon habitat in the Fraser Valley by replacing 156 aging flood-control structures, such as pump stations, flood boxes and dikes, while advancing best practices in fish-friendly flood infrastructure to protect communities.“With extreme environmental events on the rise and salmon populations in decline, the time to take action is now. Through the joint federal-provincial BC Salmon Restoration and Innovation Fund, we’re investing in projects in the Coquitlam area that will work to improve flood-control infrastructure and habitat restoration,” said Diane Lebouthillier, federal Minister of Fisheries, Oceans and the Canadian Coast Guard. “With support from our Pacific Salmon Strategy Initiative, which funds and co-ordinates efforts to stem the decline of salmon populations, these projects will protect communities and fish habitats from floods while giving salmon a better chance to thrive in the critical waters of the Fraser River.”The Resilient Waters project will also provide:\n\t7.5 hectares of high-quality juvenile coho and chinook rearing habitat within an existing wildlife management area;\n\ta research project to better understand the effects of pumps on salmon; and\n\ta post-restoration monitoring program to assess the success of sites where flood infrastructure has been restored for fish passage.\nQuotes:Fin Donnelly, Parliamentary Secretary for Watershed Restoration –“The Resilient Waters project demonstrates British Columbians, communities, First Nations and our governments’ commitment to securing B.C.’s watersheds and promoting community resilience. It will serve to enhance the health of our watersheds and fortify our communities, wild salmon populations and ecosystems against climate and environmental challenges. This BCSRIF investment underscores the importance of innovative practices and highlights our dedication to creating a legacy of thriving watershed ecosystems for generations to come.”Dan Straker, Resilient Waters project manager, MakeWay Charitable Society – “MakeWay and the Resilient Waters project are very excited to continue our work on solutions that improve flood resilience for communities and for salmon in the Lower Mainland. BCSRIF has supported our work since the beginning and we are now seeing real change on the ground.\"Lina Azeez, habitats program director, Watershed Watch Salmon Society – “Watershed Watch Salmon Society applauds our federal and provincial governments for stepping up to support this important work to restore our salmon runs and improve flood control. With more than 156 outdated flood-control structures in the Lower Fraser impacting fish and fish habitat, there is still plenty more to do. These projects show how we can work together to put solutions in place that protect our communities, while also supporting the needs of B.C.’s wild salmon.\"\nLearn More:For more information about BCSRIF, visit: https://www.dfo-mpo.gc.ca/fisheries-peches/initiatives/fish-fund-bc-fonds-peche-cb/index-eng.htmlA backgrounder follows.\n        \n            \n\tThe British Columbia Salmon Restoration and Innovation Fund (BCSRIF) is a program funded jointly by the federal and provincial governments.\n\tThe Government of Canada is providing 70% of the funding and the Province of British Columbia is providing 30%.\n\tThe fund will be available to support projects until March 31, 2026.\n\tBCSRIF has supported approximately 100 projects in its Phase 1 to protect and restore wild Pacific salmon and other priority fish populations since 2019.\n\tOther recipients of BCSRIF Phase 2 projects are expected to be announced by the end of this year or early in 2024.\n\tBCSRIF Phase 2 is supported by the three pillars of innovation, infrastructure and science partnerships to protect and restore wild Pacific salmon and other priority fish populations, and to ensure the fish and seafood sector in B.C. is positioned for long-term environmental and economic sustainability.\n\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023WLRS0068-001983.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023WLRS0068-001983.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Expansion of virtual bail supports safer communities\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The provincewide expansion of virtual bail is a significant step toward a more efficient justice system.In collaboration with the Provincial Court, virtual bail hearings, including electronic document submissions for bail hearings by lawyers, have been successfully expanded and implemented throughout B.C. It is an important measure in the Safer Communities Action Plan.“Expanding virtual bail hearings provincewide means more people can access court proceedings faster while staying in their communities, and close to the local services and supports they are connected to,” said Niki Sharma, Attorney General. “By using available technology, we’re adapting to make our justice system more efficient and effective.”Following a successful pilot in northern B.C. in 2021, centralized virtual bail hearings are now operational in the Interior, Vancouver Island, Vancouver Coastal and most recently, Fraser region.With virtual bail hearings, judges, court staff and lawyers can appear in multiple jurisdictions on the same day without the need to travel. Implementation of technology and process changes across the province have resulted in a justice system that can also better adapt to extreme events like wildfires, flooding and pandemics.Early benefits of virtual bail hearings include:\n\treducing displacement of accused people from their own communities and community supports;\n\treducing overnight remands in police cells;\n\treducing travel for sheriffs, prisoners and lawyers;\n\tallowing trials in smaller locations to proceed without being interrupted by bail hearings;\n\treducing trial continuations; and\n\tincreasing access to duty counsel.\nThe Province is continuing to implement the Safer Communities Action Plan to keep those who commit repeat violent offences off streets and strengthen services to build safe, healthy communities.Learn More:For more information about the virtual bail initiative, visit: https://www.provincialcourt.bc.ca/downloads/Practice%20Directions/CRIM05.pdfFor information about Safer Communities Action Plan, visit: https://news.gov.bc.ca/27820\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023AG0073-001989.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023AG0073-001989.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Drug eligibility expanded for children with cystic fibrosis\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – More children in B.C. who are living with cystic fibrosis are now eligible for Trikafta, a medication that has shown to improve lung function and quality of life, as well as reduce the frequency of lung attacks.Coverage criteria for Trikafta in B.C. was expanded on Thursday, Dec. 14, 2023, based on a recommendation from the Canadian Drug Expert Committee (CDEC).In September 2021, the drug was first listed for patients 12 years or older. In September 2022, eligibility was expanded to include children aged six to 11 years. Following a new recommendation from the CDEC, children aged two to five years are now eligible for coverage.Trikafta is a triple-combination medication of ivacaftor, tezacaftor and elexacaftor, used for the treatment of cystic fibrosis in patients who have at least one F508del mutation.The drug is covered through the B.C. Expensive Drugs for Rare Diseases process, which allows patients to access high-cost drugs for rare conditions on a case-by-case basis.Approximately 200 people in B.C. benefit from Trikafta PharmaCare coverage. An estimated 40 more are expected to become eligible with the expanded criteria.Cystic fibrosis, which affects approximately 500 people in B.C., is a genetic disease that largely affects a person’s lungs, but also the pancreas, liver, kidneys and intestine. Long-term challenges can include respiratory difficulties and complications, including frequent lung attacks.\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0153-001988.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023HLTH0153-001988.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Avian influenza now detected at more than 50 farms\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The Canadian Food Inspection Agency (CFIA) has confirmed 52 farms have been infected with the highly pathogenic H5N1 avian influenza virus in B.C. since Oct. 20, 2023.The premises are primarily in the Fraser Valley and include 47 commercial farms and five small-flock farms.As the fall migration of wild birds over B.C. slows down, the frequency of cases has reduced over the past few weeks. Staff with B.C.’s Ministry of Agriculture and Food are continuing to work closely with the CFIA and B.C. poultry producers to ensure enhanced biosecurity measures are in place to try to limit the spread of disease and protect flocks.An industry-led webinar for producers, supported by the Ministry of Agriculture and Food, CFIA, and public health officials, is scheduled for Tuesday, Dec. 19, 2023. Information will be shared with producers on public health, biosecurity measures and AgriStability (an income-support program) along with a general update about the outbreak. The BC Poultry Association is hosting the session and producers can contact them to register.Earlier this year, the Province introduced a new $5-million Farmed Animal Disease Program to help support farmers with enhanced biosecurity measures, equipment for disease response, research and training so they can better prepare for and prevent the risk of disease, such as avian influenza.While these important tools are in place to help prevent disease spread and protect flocks and farms, viruses can adapt and spread so it is important that farmers and small flock owners remain vigilant.Avian influenza presents an extremely low risk to public health with no risk to food safety. There are currently no anticipated food supply disruptions of either eggs or poultry due to the virus.For poultry owners who suspect their birds may have avian influenza, they should call their veterinarian, their nearest CFIA animal health office or the BC Animal Health Centre at 1 800 661-9903. If people find a sick or injured wild bird, they should leave it where it is and report it to B.C.’s wild bird surveillance hotline at 1 866 431 BIRD (2473).Quick Facts:\n\tAvian influenza is a federally regulated disease, and the Canadian Food Inspection Agency (CFIA) leads the investigation and response with provincial support for testing, mapping, surveillance and disposal.\n\tOnce the CFIA confirms positive tests, a process including quarantine, depopulation and disposal occurs.\n\tB.C.'s Animal Health Centre has tested almost 45,000 samples for avian influenza since April 2022 and more than 6,500 since the fall outbreak began. The laboratory is available seven days per week for testing.\n\tB.C.’s chief veterinarian issued two orders in October to reduce the risk of the virus spreading, including restrictions on poultry events such as shows, markets and auctions, as well as an order for commercial farms to keep their birds indoors.\nLearn More:For information from the CFIA about the current state of avian influenza in Canada, visit: https://inspection.canada.ca/animal-health/terrestrial-animals/diseases/reportable/avian-influenza/latest-bird-flu-situation/status-of-ongoing-avian-influenza-response/eng/1640207916497/1640207916934To read a CFIA factsheet about avian influenza, visit: https://inspection.canada.ca/animal-health/terrestrial-animals/diseases/reportable/avian-influenza/fact-sheet/eng/1356193731667/1356193918453#a2For information from the Ministry of Agriculture and Food information about avian Influenza, including what to be on the lookout for, resources for small-flock owners, deputy chief veterinarian's orders and information on testing, visit: https://www2.gov.bc.ca/gov/content/industry/agriculture-seafood/animals-and-crops/animal-health/reportable-notifiable-diseases/avian-influenza-aiFor a full list of resources for dealing with sick, injured or dead wildlife, visit: https://www2.gov.bc.ca/gov/content/environment/plants-animals-ecosystems/wildlife/wildlife-conservation/wildlife-health/what-to-do-if-you-find-sick-injured-or-dead-wildlife\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023AF0062-001984.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023AF0062-001984.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Tougher action to deter trucks from hitting overpasses will make travel safer\n        ",
    "resolutionId": null,
    "contents": "\n            DELTA – Tougher action is being taken to prevent truckers from crashing into highway infrastructure throughout B.C. as stronger deterrents against unsafe commercial-vehicle drivers will make highway travel safer.Trucking companies involved in infrastructure crashes will see stronger consequences that escalate for repeat offences. In cases where a company has a history of non-compliance, including previous infrastructure crashes, enforcement measures will become increasingly severe. This includes potential suspension and possible cancellation of a company's carrier safety certificate, essentially preventing their operation in B.C.Unprecedented penalties have recently been imposed by suspending a company’s entire fleet, while Commercial Vehicle Safety and Enforcement investigates a crash.  The immediate suspensions and the significant cost they bring to a company will be a permanent tool. However, repeat offenders will face longer suspensions and may have their certificate to operate in B.C. revoked. “Infrastructure crashes have a huge impact. They delay commuters, affect the movement of goods and can impede first responders. This means families, businesses and the economy all suffer,” said Rob Fleming, Minister of Transportation and Infrastructure. “Safety is the priority and this issue needs to stop. That’s why we’re taking tougher action, grounding fleets through suspensions and increasing fines, so highway traffic keeps moving safely and reliably for travellers and commercial vehicles, and people can count on their commute.” Recent regulatory changes will also bring in new and higher fines for various offences, holding carriers and drivers accountable for the safe and professional movement of goods on provincial highways. Additionally, new speed-limiter regulations will further improve safety by requiring heavy commercial vehicles operating in the province to have their speed-limiting systems activated and programmed by April 5, 2024. This will prevent these vehicles from travelling more than 105 km/h on B.C. highways. The fine for speed-limiter non-compliance and tampering is $295 and three driver penalty points.“The BC Trucking Association welcomes and supports the decisive measures taken by the provincial government to enhance safety and reduce infrastructure crashes involving commercial heavy-duty trucks,” said Dave Earle, president and CEO, BC Trucking Association. “These initiatives mark a pivotal step toward creating safer roadways for all and underscore our shared commitment to fostering a culture focused on risk-prevention in the trucking industry.”Specific amendments to the Commercial Transport Regulations and the Motor Vehicle Act Regulations bring in new offences and higher fines to address over-height vehicles and loads, as well as require dump-style vehicles to have in-cab warning devices by June 1, 2024. This will alert a driver if the dump box is raised when the vehicle is in motion. The over-height vehicle related fines will be $575 (previously $115), making this the highest fine of its nature in Canada. Not complying with having in-cab warning devices in dump trucks will result in a fine of $598.While B.C.’s new fines for infrastructure crashes will become the highest in Canada, fine amounts are currently limited by legislation. The Province is reviewing potential legislative changes that would allow even higher fines in the future. Learn More:To learn about the new progressive-enforcement framework, visit: https://www.cvse.ca/whatsnew.htmlFor more information about B.C. legislation, visit: https://workingforyou.gov.bc.ca/legislation\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0207-001985.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023MOTI0207-001985.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Sharp rise in deaths among people experiencing homelessness continues in 2022\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – The deaths of at least 342 people experiencing homelessness were reported to the BC Coroners Service in 2022, continuing an increase in deaths among the unhoused population of 138% in the past two years.During the period studied (2015-22), there were 1,464 deaths involving individuals identified as experiencing homelessness in British Columbia, equating to an average of 183 deaths per year. There was a significant increase from this average in 2021 and 2022.The townships with the highest number of deaths between 2015 and 2022 were Vancouver (306), Surrey (146) and Victoria (118). Almost three quarters (74%) of decedents were aged between 30 and 59, and 82% were male.Because housing data was unavailable at the time of analysis, rates of death and any possible correlation between deaths and the number of people experiencing homelessness in the province could not be determined.Just as it has across all demographics and in communities throughout B.C., the toxic drug supply has significantly contributed to the increased number of deaths among people who are precariously housed or experiencing homelessness. More than eight out of every 10 deaths in the review period were classified as accidental, and of those accidental deaths, more than nine in 10 were determined to have been caused by unregulated drugs.For the purposes of the report, an individual experiencing homelessness was defined as:\n\tA person living outdoors, in a make-shift shelter, a parked vehicle, a vacant home or any other structure not intended for habitation; or\n\tA person staying at an emergency shelter (overnight) or who is temporarily sheltered (suspected to be for less than 30 days) by friends or family, in a short-term shelter, safe house for youth or transition house for women and children fleeing violence.\n\tPersons residing in short-term shelters, safe houses or transition houses for an unknown length of time were also included.\nSome individuals who do not meet the above definitions of homelessness may be considered homeless under other definitions. Examples of individuals who were not considered homeless for the purposes of this report include: people in correctional institutions, hospitals or residential drug or alcohol treatment facilities; and people who have permanent residences but are considered at high risk of homelessness because of unemployment, domestic violence or other factors.Additional key preliminary findings are below. Data is subject to change as additional post-mortem testing results are received:\n\tBetween 2015 and 2020, the annual average was 143 deaths. In comparison, the annual average from 2021 to 2022 was 305 deaths.\n\tMore deaths occurred in the fall (27%) and winter (26%) months of the year.\n\tThe most impacted health authorities were Fraser (32% of deaths) and Vancouver Coastal (24%).\nLearn More:To read the report, Deaths of Individuals Experiencing Homelessness 2015-2022, visit: https://www2.gov.bc.ca/assets/gov/birth-adoption-death-marriage-and-divorce/deaths/coroners-service/statistical/deaths_of_individuals_experiencing_homelessness_2015-2022.pdf\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0091-001978.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0091-001978.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New clinical support, research centre to be built next to new St. Paul’s Hospital\n        \n            What people are saying about the new CSRC\n        ",
    "resolutionId": null,
    "contents": "\n            VANCOUVER – People in B.C. will benefit from advanced patient care resulting from cutting-edge research and integrated health care as the Province approves the business plan and funding for the construction of a state-of-the-art Clinical Support and Research Centre (CSRC) at the new St. Paul’s Hospital.“This new research centre will help define the future of medicine,” said Premier David Eby. “We are going to see scientific breakthroughs translated into real-world health care, delivering better services and treatments for patients. B.C. is becoming a global hub for life sciences and today’s announcement will help us to continue to attract the best scientists and researchers to our province, as well as doctors, nurses and other health-care professionals.”Located near 1002 Station St., directly adjacent to the new St. Paul’s Hospital, the centre will be approximately 34,400 square metres (370,000 square feet) in size and connected with a sky-bridge to the St. Paul’s Hospital on the Jim Pattison Medical Campus, which is under construction.“Clinical research and innovation are drivers of excellence in the health sector and lead to improved patient care and treatment,” said Adrian Dix, Minister of Health. “That’s why our government is investing in establishing a world-class research centre in the heart of the new St. Paul’s Hospital campus that will facilitate the translation of scientific innovation and research into day-to-day clinical practice, resulting in improved patient care and outcomes.”Providence Health Care (PHC) and Providence Research operate several major research centres based at St. Paul’s Hospital and other surrounding locations. Once complete, the centre will be home to these key research centres, programs and disciplines at Providence as well as specialty physician practices to complement care provided in the hospital, allowing for an integrated health campus.“Centred around an innovation centre, and with a direct sky-bridge connection into St. Paul’s Hospital, the CSRC will include specialty medical services in addition to extensive research facilities, corporate support and child care,” said Fiona Dalton, president and chief executive officer, Providence Health Care. “This innovation hub will bring together patients, physicians, researchers and academic partners to create sustainable solutions to the challenges that face health and well-being across the world.”The centre will also include infrastructure for emerging technology such as 3D bio-printing, research data and analytics, corporate services and a 49-space child care centre.“The new Clinical Support and Research Centre is a significant addition to the new St. Paul’s Hospital and will bring B.C.-driven innovation closer to the patients who will need it the most,” said Brenda Bailey, Minister of Jobs, Economic Development and Innovation. “This step is part of B.C.’s Life Sciences and Biomanufacturing Strategy demonstrating that our province continues to be a global leader in life sciences and that we are transforming our vision into action.”The total capital cost of the project is $638.3 million and will be cost-shared by the Province ($331.7 million), Providence Health Care ($215.6 million), St. Paul’s Foundation ($88 million), and ChildCare BC New Spaces Program ($3 million).As the cornerstone of Vancouver’s newest hub for discovery and learning in the False Creek Flats, the CSRC will bolster B.C.’s life sciences community by attracting leading care providers, scientists and industry partners to deliver excellence in care, research and innovation.Building the new centre is part of the StrongerBC Economic Plan’s Life Sciences and Biomanufacturing Strategy. The strategy outlines key actions developed in close consultation with industry and academia to position British Columbia as a global hub for life sciences and biomanufacturing, and as a leading centre for commercial-scale biopharmaceutical and medical manufacturing.Quick Facts:\n\tResearch at Providence that will relocate to the new Clinical Support and Research Centre, includes:\n\t\tCentre for Heart Lung Innovation;\n\t\tBC Centre for Excellence in HIV/AIDS;\n\t\tBC Centre on Substance Use;\n\t\tCentre for Advancing Health Outcomes (formerly known as CHÉOS); and\n\t\tnumerous clinical researchers and programs that will lead studies at the bedside in units throughout the new St. Paul’s Hospital\n\t\nA backgrounder follows.\n        \n            Joan Phillip, MLA for Vancouver-Mount Pleasant –“High-quality health care, close to home, is critical to the health and well-being of communities. The CSRC is going to help patients get top-notch care from research scientists and clinicians who are able to apply innovative solutions into every day clinical practice for better health outcomes. That’s why this investment is such a great news, and I look forward to seeing the project move forward.”Dick Vollet, president and CEO, St. Paul’s Foundation –“The CSRC is where life-changing treatments will be found as leaders in medicine, life sciences, and technology work together to advance discoveries from the lab to the hospital to communities across B.C. and beyond. With the donor community’s help, we can realize the full vision of the new St. Paul’s Hospital – more than just a hospital, it’s the beginning of a new era in health care for British Columbians.”Dr. Darryl Knight, president, Providence research, PHC vice-president, research and academic affairs and associate dean, research, faculty of medicine, University of British Columbia –“We can’t change the world if all the great work done by our renowned researchers stays in the lab. The CSRC will be the innovation vehicle that drives a dynamic exchange of ideas and solutions among patients, physicians, clinician-scientists, researchers, academia and beyond. A nexus of discovery and clinical sciences, the CSRC will expedite life-changing findings, speed-up technology transfer, incubate new start-up ventures and provide substantial training opportunities that will push the boundaries of science, innovation and care. In doing so, it will not only elevate the landscape of scientific achievement, but also drive economic growth, not just in in B.C., but across Canada.”Dr. Julio Montaner, OC, OBC, executive director and physician in chief, BC Centre for Excellence in HIV/AIDS –“We congratulate the Government of British Columbia for its unwavering support of St. Paul’s Hospital and Providence Health Care research and innovation efforts. The CSRC building is a key and critical contributor to this effort. We are confident that this investment will allow SPH/PHC to go far beyond current achievements to ensure we continue to promote targeted disease elimination and as a result contribute to enhance health-care sustainability in B.C.”Dr. Don Sin, director, Centre for Heart Lung Innovation (HLI) and professor of medicine, University of British Columbia –“The new CSRC will bring cutting-edge research to the homes of British Columbians by exploring new frontiers of knowledge, developing innovative technologies and methods, and testing novel therapies and interventions. The new facility will also enable the Province to recruit and retain the brightest minds in medicine and train the next generation of world-class physician-scientists and clinical researchers who will radically transform health care to make it more accessible, more cost-effective and highly targeted, so every patient receives the right treatment for the right diagnosis at the right time.”Dr. Bradley Quon, principal investigator, HLI, associate professor of medicine, UBC; and medical and research director, Adult Cystic Fibrosis Program, St. Paul’s Hospital –  “The CSRC will unleash the full potential of our world-class researchers. With a state-of-the-art, purpose-built facility, our scientists will accelerate their pace of discovery, revolutionizing how diseases are prevented, diagnosed, phenotyped and treated.”Dr. Alana Flexman, anesthesiologist and director of research, department of anesthesia, St. Paul’s Hospital; scientist, Centre for Advancing Health Outcomes; clinical associate professor, UBC – “Research is integral to the exceptional clinical care we provide at St. Paul’s Hospital and enhances our ability to recruit and retain extraordinary people. The CSRC will act as a catalyst to promote further advances in patient care through access to both new infrastructure and the networks of people embedded in this centre. I look forward to the many ways the CSRC will accelerate innovation, discovery and research to improve health outcomes for those we serve.”\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PREM0071-001987.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PREM0071-001987.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Sun Peaks Mountain Resort Municipality opens new child care centre\n        ",
    "resolutionId": null,
    "contents": "\n            SUN PEAKS – Families in the Sun Peaks Mountain Resort Municipality are benefiting from a new child care centre with 52 licensed spaces that will give children early learning experiences and allow parents and guardians to work or pursue other opportunities.“This child care centre is providing care for all ages of children, which is something the community needs,” said Grace Lore, Minister of State for Child Care. “We’re creating reliable child care spaces, supporting working families and strengthening Sun Peak’s economy.”The Province partnered with the municipality to build the Sun Peaks Community Daycare with approximately $1.8 million in ChildCareBC New Spaces funding. The new centre offers child care for children aged up to 12 and is a much-needed resource for families in the area.“Maintaining a stable workforce is an important community goal and this daycare facility will enable more families to make Sun Peaks their home,” said Al Raine, mayor of Sun Peaks Mountain Resort Municipality.The Sun Peaks Community Daycare will be accessible with wheelchair ramps, wide hallways, a universal washroom and handrails. It also features a food-preparation space and an outdoor playground.“We couldn't be more thrilled to unveil the new Sun Peaks Community Daycare,” said Janice Hoppenreys, manager, Sun Peaks Community Daycare. “Opening our doors to care for numerous families within the community fills us with immense excitement and gratitude.”Since 2018, through the ChildCareBC accelerated space-creation programs, more than 33,000 new child care spaces have been funded, with more than 15,000 of these spaces operational. Of these newly operational spaces, more than 560 are in the Kamloops area.The Province and the Government of Canada are investing approximately $300 million to fund the creation of new licensed child care spaces in high-need areas throughout B.C. Applications are being accepted for the ChildCareBC New Spaces Fund from public, not-for-profit child care operators and providers, and Indigenous governments and will do so until there is no more budget.Learn More:For information about the ChildCareBC New Spaces Fund, visit: https://gov.bc.ca/childcare/newspacesfund For information about ChildCareBC, visit: https://gov.bc.ca/childcare/\n        ",
    "reportUrls": [],
    "date": "Dec. 14, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ECC0104-001982.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ECC0104-001982.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            New rebates make healthier home heating more affordable\n        \n            Facts about wood stoves and alternatives\n        \n            Wood Stove Exchange Program recipientsUpdated Dec. 14, 2023, for clarification\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – Keeping warm during winter will have a lower effect on air quality in B.C. as more incentives and education on replacing wood stoves with cleaner, healthier heating options roll out.“Burning wood is one of the largest air-pollution sources affecting B.C. communities, and switching to healthier, clean-heat sources can save people money by heating homes more effectively,” said George Heyman, Minister of Environment and Climate Change Strategy. “By increasing the amount available for rebates, we’re helping more people breathe healthier air in their homes and in their communities.”In partnership with the BC Lung Foundation, the Government of B.C. will provide approximately $240,000 in rebates in 2024 through the Community Wood Smoke Reduction Program. This funding will help replace approximately 470 wood stoves with cleaner alternatives, such as heat pumps or emissions-certified wood stoves, and provide educational materials for municipalities to share with residents.Rebates have increased this year to ensure the program is saving people money in a time of increased global inflation.This year, people in First Nations communities can get as much as $3,000 back for upgrading to a heat pump. Rebates for heat pumps in other participating communities have doubled since last year up to $2,000, based on each community’s air-quality rating. Amounts for upgrading to a Canadian Standards Association (CSA) or an U.S. Environmental Protection Agency (EPA) emissions-certified wood or pellet stove have also increased significantly for all participating communities.“It is important that more people understand the health risks involved with wood-burning stoves,” said Christopher Lam, CEO, BC Lung Foundation. “Our top concern is the fine particulate matter in wood smoke, along with hundreds of other pollutants, including some that cause adverse health effects.”Since 2008, the Community Wood Smoke Reduction Program has provided more than $4 million to replace more than 10,300 old stoves with cleaner heating options. This year, the program will distribute $239,050, including $15,300 for “citizen science” projects, through the British Columbia Lung Foundation.In addition to the Community Wood Smoke Reduction Program rebates, people in B.C. who heat their homes with wood or solid fuels can currently receive a rebate of as much as $2,000 from CleanBC to switch to an electric heat pump. For low-income households, it is as much as $5,000. Combined with federal rebates, people in British Columbia can save as much as $7,000 on the purchase and installation of a heat pump when converting from wood, or as much as $10,000 for income-qualified households. Heat pump rebates are also available from BC Hydro and CleanBC for customers switching from fossil-fuel heating systems to heat pumps.“Modern heat pumps reduce energy bills and are effective even in colder areas of the province, especially when combined with a backup heat source for the coldest days,” Heyman said. “They also have the benefit of providing air conditioning during our increasingly hot summers.”Depending on where they live and how much they earn, people in British Columbian can qualify for multiple rebates that will effectively cover most of the capital and installation costs for many heat pump configurations, especially in First Nation communities.Learn More:For more information, visit: https://www2.gov.bc.ca/gov/content/environment/air-land-water/air/air-pollution/smoke-burning/smoke-reduction-program    For information on heat pump rebates in B.C., visit: https://www.betterhomesbc.caTwo backgrounders follow.\n        \n            \n\tThe smoke from wood-burning stoves and fireplaces contains fine particulate matter and other pollutants known to cause adverse health effects.\n\tWhen weather traps the smoke near the ground, pollution can quickly rise to unhealthy levels.\n\tOlder wood stoves from 30 or more years ago emit far more smoke than newer emissions-certified stoves.\n\t\tReplacing old, inefficient wood stoves with newer, more efficient models reduces overall heating costs for households by using less fuel and heating more efficiently.\n\t\n\tIn British Columbia, all new wood stoves and inserts sold must meet Canadian Standards Association (CSA) or U.S. Environmental Protection Agency (EPA) emission standards.\n\tPeople using wood stoves should use dry, well-seasoned wood cut into pieces 10 to 15 centimetres (four to six inches) in diameter.\n\t\tBurning green or wet wood produces significantly more smoke.\n\t\n\tFirewood should be seasoned for at least six months.\n\t\tIn addition to reducing smoke, burning seasoned wood saves money by reducing wood consumption by 25%.\n\t\n\tBy burning smaller, hotter fires to ensure complete combustion of the wood, very little smoke should be visible coming from the chimney, with no smell of smoke indoors.\n\tWood-burning appliances should be inspected and cleaned at least once a year by a certified technician.\n\n        \n            In 2024, the Community Wood Smoke Reduction Program will increase available incentives for the following groups:First Nation communities can exchange an old wood stove for:\n\tan U.S. Environmental Protection Agency (EPA) or Canadian Standards Association (CSA) emission-certified wood stove: $1,200\n\tan EPA or CSA emission certified pellet stove: $2,000\n\ta heat pump: $3,000\nResidents in communities that have exceeded national air-quality standards can apply to exchange an old wood stove for:\n\tan EPA or CSA emission certified wood stove: $600\n\tan EPA or CSA emission certified pellet stove: $1,500\n\ta heat pump: $2,000\nResidents in other participating B.C. communities can apply to exchange a wood stove for:\n\tan EPA or CSA emission certified wood stove: $600\n\tan EPA or CSA emission certified pellet stove: $1,000\n\ta heat pump: $1,500\n2023-24 Community Wood Smoke Reduction Program funding recipientsFunding for the 2023-24 Community Wood Smoke Reduction Program:\n\tComox Valley Regional District (for Citizen Science Project): $5,000\n\tCowichan Valley Regional District: $20,000\n\tGolden and district: $8,600\n\tPrince George and region, including Lheidli T’enneh First Nation community: $14,250\n\tRegional District of Central Kootenay: $13,000\n\tRegional District of Nanaimo: $69,750\n\tRegional District of Nanaimo (for Citizen Science Project): $10,300\n\tqathet Regional District: $14,000\n\tSalt Spring Island: $40,500\n\tSunshine Coast and Sea to Sky: $30,250\n\tTown of Mackenzie: $13,400\nCommunities with sufficient funds from previous years to continue offering rebates:\n\tAlberni-Clayoquot Regional District\n\tBulkley Valley Lakes District\n\tCity of Kamloops\n\tComox Valley Regional District\n\tDistrict of Vanderhoof\n\tFraser Valley Regional District\n\tKitimat-Terrace and surrounding areas\n\tMetro Vancouver Regional District\n\tRegional District of Central Okanagan, including Westbank First Nation\n\tStrathcona Regional District\n\tVillage of Valemount\n\n        ",
    "reportUrls": [],
    "date": "Dec. 13, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ENV0072-001971.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023ENV0072-001971.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  },
  {
    "title": "\n            Update from BC Coroners Service about increasing deaths from unregulated drugs\n        ",
    "resolutionId": null,
    "contents": "\n            VICTORIA – In response to a recent increase in deaths caused by toxic drugs, the BC Coroners Service is issuing a public safety warning to anyone using substances purchased from the illicit market.In its October 2023 update, the coroners service revealed that the province is expected to record an unprecedented number of unregulated drug-related deaths in 2023. Since that update was released, the number of deaths due to drug toxicity has increased above earlier indications.In recognition of how difficult the holiday season is for those who have lost loved ones, there has historically not been a monthly drug-death reporting update in December. It is important, however, to ensure that people are aware of the continuing risks related to the unregulated drug market and of recent increases in deaths reported.While data is still under review, preliminary indications suggest unregulated drug toxicity has caused more than 200 deaths in November 2023, and that the province has averaged about seven deaths per day for the past seven weeks.Unregulated drug deaths in the winter months have historically increased over the numbers reported during the rest of the year, so this early increase could be a sign of another challenging season for people who use drugs in B.C.Please do not use drugs alone. It is critically important that people take advantage of every available support to keep themselves safe. This includes accessing local safe consumption sites (SCS) and/or overdose prevention sites (OPS), and/or drug checking services where available. It is recommended that anyone using drugs do so only in the presence of someone who will be able to provide naloxone and/or first aid and call 911.Local health authorities and harm-reduction organizations will continue to provide health advisories as needed as they are best positioned to respond quickly to local concerns.Recent reports of counterfeit hydromorphone tablets in Interior Health make clear that even substances presumed to be safe carry significant risk. The only way to be certain about the substances contained in a product that is purchased illicitly is by having it tested by an approved service.Learn More:Unregulated drug death report (data to Oct. 31, 2023):\nhttps://app.powerbi.com/view?r=eyJrIjoiY2ZkZTgxODAtMmE5Mi00MzNjLTlkNDYtMjRhNjU4Nzk2NGZmIiwidCI6IjZmZGI1MjAwLTNkMGQtNGE4YS1iMDM2LWQzNjg1ZTM1OWFkYyJ9BC Coroners Service Death Review Panel: A Review of Illicit Drug Toxicity Deaths:\nhttps://www2.gov.bc.ca/assets/gov/birth-adoption-death-marriage-anddivorce/deaths/coroners-service/death-reviewpanel/review_of_illicit_drug_toxicity_deaths_2022.pdf\n        ",
    "reportUrls": [],
    "date": "Dec. 13, 2023",
    "url": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0090-001970.htm",
    "minutesUrl": "https://archive.news.gov.bc.ca/releases/news_releases_2020-2024/2023PSSG0090-001970.htm",
    "city": "BC (province)",
    "meetingType": "Ministry of Housing",
    "metroCity": null
  }
]