[
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1048670736.pdf",
    "text": "City of Richmond\nThe Council of the City of Richmond enacts as follows: \n1. Consolidated Fees Bylaw No. 8636, Amendment Bylaw No. 10486\nThe Consolidated Fees Bylaw No. 8636, as amended, is further amended: \na) by deleting the schedules attached to Bylaw No. 8636, as amended, and substituting the schedules attached to and forming part of this Bylaw. \nThis Bylaw comes into force and effect on January 1, 2024. \nThis Bylaw is cited as \"Consolidated Fees Bylaw No. 8636, Amendment Bylaw No. 10486\". \nFIRST READING \nSECOND READING \nTHIRD READING \nADOPTED Bylaw 10486 \nMAYOR \nDocument Number: 7335580 \nCNCL-244 \nOCT 10 2023. \nOCT 10 2023 \nOCT 10 2023 \nCORPORATE OFFICER \nCity of RICHMOND \nAPPROVED foreby originating dept. \nAPPROVED for legality by SolicitorSchedules to Bylaw 10486\nSCHEDULE - ANIMAL CONTROL REGULATION\nAnimal Control Regulation Bylaw No. 7932\nCat Breeding Permit Fee\nSection 2.2 Description\nCat breeding permit for three years\n\nAnimal Control Regulation Bylaw No. 7932\nImpoundment Fees\nSection 8 Description\n1st time in any calendar year\nNeutered male or spayed female dog\nNon-neutered male or unspayed female dog\nDangerous Dog\n\n2nd time in any calendar year\nNeutered male or spayed female dog\nNon-neutered male or unspayed female dog\nDangerous Dog*\n\n3rd time and subsequent times in any calendar year\nNeutered male or spayed female dog\nNon-neutered male or unspayed female dog\nDangerous Dog\nBird\nDomestic farm animal\nOther animal\nImpoundment fee also subject to transportation costs\n\n7335580 Fee $47.25\nCNCL-245 Fee Page 2 $54.00\n$162.00\n$662.00\n$107.00\n$335.00\n$1,314.00\nImpoundment fee also subject to transportation costs\n*Subject always to the power set out in Section 8.3.12 of Animal Control Regulation Bylaw No. 7932 to apply for an order that a dog be destroyed.\n\nNote: In addition to the fees payable above (if applicable), a license fee will be charged where a dog is not currently licensed.\n\n$335.00\n$662.00\n$1,314.00\n$8.25\n$80.25\n$40.50",
    "maxPages": 2,
    "type": "image",
    "createDate": "2024-02-05T01:22:45.030Z",
    "updateDate": "2024-02-05T01:22:45.030Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Application_by_Terra_8120_Number_1_Road_Limited_Partnership_for_Rezoning70635.pdf",
    "text": "7401059\nReport to Committee\nTo: Planning Committee\nDate: October 25, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 21-945869\nRe: Application by Terra 8120 Number 1 Road Limited Partnership for Rezoning at 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” Zone to the “Low Density Townhouses (RTL4)” Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10498, for the rezoning of 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, be introduced and given first reading.\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing\nCONCURRENCE OF GENERAL MANAGER\nCity of Richmond\nPLN - 7\nOctober 25, 2023 - 2 - RZ 21-945869\n7401059\nStaff Report\nOrigin\nTerra 8120 Number 1 Road Limited Partnership (on behalf of Cliff Chun and Kai Shen Hsiung of 1296168 BC Ltd. and Yi Jen Wang and Kai Shen Hsiung of Terra West Properties Ltd.) has applied to the City of Richmond for permission to rezone 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, to permit the development of nine townhouse units, with vehicle access from No. 1 Road. A location map and aerial photo of the subject site are provided in Attachment 1.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is provided in Attachment 2.\nExisting Site Condition and Context\nA survey of the subject site is included in Attachment 3. The subject site consists of two lots located on the east side of No. 1 Road, between Blundell Road and Coldfall Road.\nSubject Site Existing Housing Profile\nThe subject site consists of two lots, each containing a single-family dwelling that is tenant occupied. The existing dwellings are proposed to be demolished. The applicant has indicated that the tenants are aware of the redevelopment proposal and the applicant will ensure compliance with the Residential Tenancy Act.\nSurrounding Development\nExisting development immediately surrounding the subject site is as follows:\nTo the North: Are three lots, two with newer construction zoned “Compact Single Detached (RC1)” and one zoned “Single Detached (RS1/E)”, each containing a single-family dwelling.\nTo the South: Is a lot zoned “Single Detached (RS1/E)”, containing a single-family dwelling. Beyond that is a large lot zoned “Low Density Townhouses (RTL4)”, containing 28 townhouses.\nTo the East: Are lots zoned “Single Detached (RS1/B)”, each containing a single-family dwelling fronting Corless Place.\nTo the West: Across No. 1 Road are compact lots zoned “Single Detached (RS1/K)” and “Compact Single Detached (RC1)”, each containing a single-family dwelling.\nPLN - 8\nOctober 25, 2023 - 3 - RZ 21-945869\n7401059\nRelated Policies & Studies\nOfficial Community Plan\nThe Official Community Plan (OCP) land use designation for the subject properties is “Neighbourhood Residential”. This redevelopment proposal is consistent with this designation.\nArterial Road Land Use Policy\nLand Use Designation\nThe Arterial Road Land Use Policy designation for the subject properties is “Arterial Road Townhouse”, subject to the development criteria in the Policy. This redevelopment proposal is consistent with this designation.\nLot Width and Residual Lots\nThe development criteria for townhouses in the Arterial Road Land Use Policy call for land assembly with a minimum 50 m frontage on a major arterial road and avoiding the creation of residual sites with less than a 50 m frontage. The Policy also recognizes that land assembly with existing narrow lots or on lots containing newer dwellings will be difficult to redevelop. The Policy provides flexibility for the minimum frontage in these circumstances provided the application can meet other guidelines and requirements. This includes the ability to consolidate vehicle access points and securing shared access by means of a Statutory Right-of-Way (SRW) agreement to adjacent properties to enable their potential redevelopment in the future.\nAlthough this redevelopment proposal involves land assembly with a frontage less than 50 m on No. 1 Road (i.e., 40 m), staff support the application for the following reasons:\nx The applicant has provided documentation indicating that efforts have been made in 2021 and 2023 to acquire the property to the south at 8180 No. 1 Road in order to achieve the minimum arterial road frontage width of 50 m, but that the owner is not interested in redeveloping their property at this time.\nx Due to existing newer development and unique lot geometry immediately north of the subject site, the applicant has indicated that it is not financially feasible to pursue land assembly with those properties as part of this redevelopment proposal.\nx The applicant has submitted a preliminary concept plan to show how the neighbouring properties to the north and south could redevelop in the future with shared vehicle access through the subject site (a copy of which is on file).\nx Prior to final adoption of the rezoning bylaw, the applicant must register a SRW agreement on Title for public right-of-passage over the entire drive-aisle and on-site truck turnaround area opposite the site entry to secure future shared access to sites to the south and north. The SRW agreement is to contain language to indicate that the on-site truck turnaround area opposite the site entry can be removed from the SRW area and used as additional outdoor amenity space for the sole use of the subject development when the adjacent property to the south is redeveloped for townhouses and on-site truck turnaround is accommodated by creating a T-intersection of the drive-aisles on the lots.\nPLN - 9",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:22:18.718Z",
    "updateDate": "2024-02-05T01:22:18.718Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Application_by_Navreet_Gill_for_Rezoning_at_11831_11833_Seabrook_Crescent70634.pdf",
    "text": "7409688\nReport to Committee\nTo: Planning Committee\nDate: October 23, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 22-010976\nRe: Application by Navreet Gill for Rezoning at 11831/11833 Seabrook Crescent from the \"Single Detached (RS1/E)\" Zone to the \"Single Detached (RS2/B)\" Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10510, for the rezoning of 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone, be introduced and given first reading.\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing \nCONCURRENCE OF GENERAL MANAGER\nCity of Richmond\nPLN - 39\nOctober 23, 2023 - 2 - RZ 22-010976\n7409688\nStaff Report\nOrigin\nNavreet Gill has applied on behalf of the property owners, 1303287 B.C. Ltd. (Balraj Singh Sanghera and Rajbir Kaur Chatha), to rezone 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone in order to permit the property to be subdivided into two single-family lots, each with vehicle access from Seabrook Crescent. A location map and aerial photo are provided in Attachment 1. The proposed subdivision plan and draft site plan are provided in Attachment 2.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile\nThe subject site contains an existing un-stratified non-conforming duplex (two-unit dwelling), which will be demolished prior to subdivision. Both dwelling units are currently tenant occupied and do not contain any secondary suites. The applicant has indicated that the tenants are aware of the redevelopment proposal and the applicant will ensure compliance with the Residential Tenancy Act.\nSurrounding Development\nDevelopment immediately surrounding the site is as follows:\nTo the North: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the South: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the East: Across the lane, an existing duplex on a lot zoned “Single Detached (RS1/E)” fronting onto No. 5 Road. There is a Rezoning application and Development Permit (RZ 22-019002/DP 23-028942) at 10111/10113 No. 5 Road to permit the development of three front-back duplex lots. The rezoning application received third reading on October 16, 2023.\nTo the West: Across Seabrook Crescent, an existing duplex on a lot zoned “Single Detached (RS1/E)”.\nRelated Policies & Studies\nOfficial Community Plan\nThe subject site is designated as “Neighbourhood Residential” in the Official Community Plan (OCP). This proposal is consistent with this OCP designation.\nPLN - 40\nOctober 23, 2023 - 3 - RZ 22-010976\n7409688\nSingle-Family Lot Size Policy 5434/ Zoning Bylaw 8500\nThe subject property is located within the area covered by Lot Size Policy 5434, adopted by City Council in 1990, amended in 1991 and 2006 (Attachment 4). The Policy permits a majority of lots within the Policy Area (including the subject property) to be rezoned and subdivided in accordance with the provisions of the “Single Detached (RS1/E)” zone.\nThe subject site is currently occupied by a legal duplex. Section 2.3.7 of Richmond Zoning Bylaw 8500 provides that the Lot Size Policy does not apply to a rezoning that a legal duplex and which are intended to be subdivided into no more than two single-family lots. The proposed rezoning and subdivision complies with Section 2.3.7 and would result in the creation of two single-family lots being 444.9 m2 and 450.2 m2 in area. Further, the proposed rezoning and subdivision would comply with the minimum lot dimensions and size applicable to the “Single Detached (RS2B)” zone.\nMinistry of Transportation & Infrastructure Approval\nAs the subject site is located within 800 m of an intersection of a Provincial Limited Access Highway and a City road, this redevelopment proposal was referred to the Ministry of Transportation and Infrastructure (MOTI) for review and comment. Preliminary confirmation has been received from MOTI indicating that they have no objections to the proposed redevelopment. Final approval from MOTI is required prior to final adoption of the rezoning bylaw.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nPLN - 41",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:21:38.891Z",
    "updateDate": "2024-02-05T01:21:38.891Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_4-_Application_-_10840_10860_Bonavista_Gate70723.pdf",
    "text": "7349947\nReport to Committee\nTo: Planning Committee\nDate: October 3, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 22-011063\nRe: Application by Pati Yik of Kennon Construction for Rezoning at 10840/10860 Bonavista Gate from the “Two-Unit Dwellings (RD1)” Zone to the “Single Detached (RS2/C)” Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10497, for the rezoning of 10840/10860 Bonavista Gate from the “Two-Unit Dwellings (RD1)” zone to the “Single Detached (RS2/C)” zone, be introduced and given first reading.\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing\nCONCURRENCE OF GENERAL MANAGER COF G\nPH - 111\nOctober 3, 2023 - 2 - RZ 22-011063\n7349947\nStaff Report\nOrigin: Pati Yik of Kennon Construction has applied on behalf of the property owners, Thomas Mau Shing Ng, Ling Y Ha and Shui Ting Chua to the City of Richmond to rezone 10840 and 10860 Bonavista Gate from the “Two-Unit Dwellings (RD1)” zone to the “Single Detached (RS2/C)” zone in order to subdivide the existing duplex lot into two single-family lots, each with vehicle access from Bonavista Gate (Attachment 1). The proposed subdivision plan and site plan are provided in Attachment 2.\nFindings of Fact: A Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile: This site is currently occupied by an existing duplex (two-family) dwelling, which will be demolished prior to subdivision. The existing two-family dwelling is owner-occupied and does not contain any secondary suites.\nSurrounding Development: Development immediately surrounding the site is as follows: To the North: An existing strata-titled duplex on a lot zoned “Single Detached (RS1/E)”. To the South: Existing single detached houses on a lot zoned “Single Detached (RS1/E)”. To the East: An existing strata-titled duplex on a lot zoned “Two-Unit Dwellings (RD1)”. To the West: Single family dwellings on lots zoned “Single Detached (RS1/E)” across Bonavista Gate.\nRelated Policies & Studies: Official Community Plan/Steveston Area Plan: The property is designated as Neighbourhood Residential in the Official Community Plan (OCP), and as Single Family in the Steveston Area Plan (Attachment 4). This proposal is consistent with both of those land use designations. Floodplain Management Implementation Strategy: The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPH - 112\nOctober 3, 2023 - 3 - RZ 22-011063\n7349947\nPublic Consultation: A rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property. Should the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment. Public notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nAnalysis: Proposed Rezoning and Subdivision: The applicant is proposing to rezone the subject site and subdivide it into two single-family lots, each with a secondary suite, with access from Bonavista Gate. This development proposal is consistent with development in the area. The proposed subdivision plan and site plan are shown in Attachment 2. Staff worked with the applicant to modify the building envelope to enable retention of trees on site at the front and rear of the property. Existing Legal Encumbrances: There is a 3.0 m wide Statutory Right-of-Way (SRW) in the backyard along the eastern property line for sanitary sewer utility purposes. The applicant has been advised that encroachment into the SRW is not permitted. A City Covenant is registered on both 10840 and 10860 Bonavista Gate Titles that restrict the development to a duplex, therefore, the duplex covenants must be discharged from Title prior to the final adoption of the rezoning bylaw. There is a Land Tax Deferment Act Agreement currently registered on the 10840 Bonavista Gate Title (proposed Lot A), which allows the property owner to defer the payment of taxes. All deferred taxes must be paid and the agreement must be discharged from Title prior to the preparation and registration of any legal documents associated with this rezoning application. Transportation and Site Access: Vehicle access is proposed to be from Bonavista Gate for both of the proposed lots. The existing driveways will be removed and new driveways will be constructed as detailed in the Site Servicing and Frontage Improvements sub-section of this report. Two parking spaces will be provided for each dwelling unit in the garage.\nPH - 113",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:21:03.664Z",
    "updateDate": "2024-02-05T01:21:03.664Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_3_-_Application_-_Interface_Architecture_Inc70721.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: September 18, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 21-939470\nRe: Application by Interface Architecture Inc. for Rezoning at 5471, 5491/5493, 5531, 5551, 5571, 5591, 5595, 5611/5613 Steveston Highway from “Single Detached (RS1/B)” Zone, “Single Detached (RS1/E)” Zone and “Two-Unit Dwellings (RD1)” Zone to “Medium Density Townhouses (RTM2)” Zone\nStaff Recommendation\nThat Richmond Zoning Bylaw 8500, Amendment Bylaw 10496, for the rezoning of 5471, 5491/5493, 5531, 5551, 5571, 5591, 5595, 5611/5613 Steveston Highway from “Single Detached (RS1/B)” zone, “Single Detached (RS1/E)” zone and “Two-Unit Dwellings (RD1)” zone to the “Medium Density Townhouses (RTM2)” zone, be introduced and given first reading.\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:el\nAtt. 7\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing \nCONCURRENCE OF GENERAL MANAGER\nPH - 53\nStaff Report\nOrigin\nInterface Architecture Inc., on behalf of Steveston Townhouse Ventures Inc. (Incorporation number: BC1293948; Director: Barry Cavanaugh & Robert Arthur Barker), has applied to the City of Richmond for permission to rezone 5471, 5491/5493, 5531, 5551, 5571, 5591, 5595, 5611/5613 Steveston Highway (Attachment 1) from “Single Detached (RS1/B)” zone, “Single Detached (RS1/E)” zone and “Two-Unit Dwellings (RD1)” zone to the “Medium Density Townhouses (RTM2)” zone in order to permit the development of 30 townhouse units with seven secondary suites and a right-in/right-out vehicle access from Steveston Highway.\nProject Description\nThe eight properties (ten units) under this application have a total combined frontage of approximately 151 m along Steveston Highway and a 22 m frontage along Lassam Road; these properties will be required to be consolidated into one development parcel prior to final adoption of the rezoning bylaw. The proposed density is 0.65 floor area ratio (FAR). The site layout includes 12 two-storey units and 18 three-storey units in ten townhouse clusters. Seven secondary suites and five accessible units are included in this proposal. Vehicle access is provided by a single right-in/right-out driveway access to Steveston Highway. A preliminary site plan, building elevations and landscape plan are contained in Attachment 2.\nA Servicing Agreement will be required for the design and construction of frontage beautification works and service connections.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile\nThe subject site currently contains six single-family homes and four duplex units. The applicant advised that there are no secondary suites in the homes and that all ten homes are currently tenanted. The developer advised that they have made these homes available to tenants at half the market rates with the clear understanding from all tenants that these are short term rentals within a development site and the homes will be demolished and legal notice to end tenancies in keeping with the Residential Tenancy Act will be issued.\nSurrounding Development\nExisting development immediately surrounding the subject site is as follows:\nTo the North: Existing single-family dwellings on lots zoned “Single Detached (RS1/B)”.\nTo the South: Across Steveston Highway, existing single-family dwellings on lots zoned “Single Detached (RS1/D)” and “Single Detached (RS1/E)”.\nPH - 54\nTo the East: Across Lassam Road, existing single-family dwellings on lots zoned “Single Detached (RS1/B)”.\nTo the West: A recently constructed 28-unit townhouse complex on a lot zoned “Medium Density Townhouses (RTM2)”.\nRelated Policies & Studies\nOfficial Community Plan/Steveston Area Plan\nThe 2041 Official Community Plan (OCP) Land Use Map designation for the subject site is “Neighbourhood Residential”. The Steveston Area Land Use Map designation for the subject site is “Multiple-Family”. This redevelopment proposal for 30 townhouses is consistent with these designations.\nArterial Road Land Use Policy\nThe Arterial Road Land Use Policy in the City’s 2041 OCP (Bylaw 9000), directs appropriate townhouse development onto certain arterial roads outside the City Centre. The subject site is identified for “Arterial Road Townhouse” on the Arterial Road Housing Development Map and the proposal is in compliance with the Townhouse Development Requirements under the Arterial Road Policy.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nAnalysis\nBuilt Form and Architectural Character\nThe applicant proposes to consolidate the eight properties into one development parcel, with a total net site area of 6,214 m2. The proposal consists of 30 townhouses, in a mix of two-storey and three-storey townhouse units in 10 clusters.\nPH - 55",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:20:21.581Z",
    "updateDate": "2024-02-05T01:20:21.581Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_2_-_Application_-_Hari_Singh_Gill_for_Rezoning_at_3300_Granville_Ave70720.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: September 18, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 22-026766\nRe: Application by Hari Singh Gill for Rezoning at 3300 Granville Avenue from \"Single Detached (RS1/E)\" Zone to \"Single Detached (RS2/B)\" Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10495, for the rezoning of 3300 Granville Avenue from “Single Detached (RS1/E)” zone to “Single Detached (RS2/B)” zone, be introduced and given first reading.\nREPORT CONCURRENCE ROUTED TO: CONCURRENCE\nAffordable Housing \nCONCURRENCE OF GENERAL MANAGER PH - 32\nStaff Report\nOrigin: Hari Singh Gill has applied to rezone the property at 3300 Granville Avenue from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone to allow the property to be subdivided into two single-family lots (Attachment 1). Vehicle access is proposed to be from Granville Avenue. The proposed subdivision plan is shown in Attachment 2.\nFindings of Fact: A Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile: This site is currently occupied by an existing single-family dwelling, which will be demolished prior to subdivision. The existing single-family dwelling is unoccupied and does not contain a secondary suite.\nSurrounding Development: Development immediately surrounding the site is as follows:\nTo the North: Across Granville Avenue, single detached houses zoned “Single Detached – Terra Nova (ZS2)”; and townhouses zoned “Town Housing – Granville Avenue (Terra Nova) and Dixon Avenue (Ash Street Sub Area) (ZT20)”.\nTo the South: Fronting onto Lockhart Road, single detached houses zoned “Single Detached (RS2/B)”.\nTo the East: Along Granville Avenue, single detached houses zoned “Single Detached (RS1/B)” and “Single Detached (RS1/E)”.\nTo the West: Along Granville Avenue, single detached houses zoned “Single Detached (RS1/B)” and “Single Detached (RS1/E)”; and zoned “Single Detached (RS1/K)” along Marrington Road.\nRelated Policies & Studies\nOfficial Community Plan (OCP Designation): The Official Community Plan (OCP) land use designation for the subject property is “Neighbourhood Residential” (NRES). The proposed rezoning and subdivision application is consistent with this designation.\nLot Size Policy 5447: The subject property falls within Single-Family Lot Size Policy 5447, which allows for the subdivision of the subject property consistent with the R1/B zone (Attachment 4). The rezoning and subdivision proposed in this application is consistent with this Lot Size Policy.\nFloodplain Management Implementation Strategy: The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation: A rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property. Should the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment. Public notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nAnalysis\nProposed Rezoning and Subdivision: The applicant is proposing to rezone the subject site and subdivide into two single-family lots, each with a one bedroom secondary suite. This development proposal is consistent with the redevelopment along this block of Granville Avenue, including the adjacent properties. The proposed subdivision plan is shown in Attachment 2.\nExisting Legal Encumbrances: There is an existing Statutory Right-of-Way (SRW) for the City in the rear yard for sanitary sewer services. The applicant has been advised that encroachment into the SRW is not permitted.\nTransportation and Site Access: Vehicle access is proposed to be from Granville Avenue. The existing driveway will be removed and new driveways will be constructed through a Servicing Agreement as detailed in the Site Servicing and Frontage Improvements sub-section of this report. PH - 34",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:19:38.001Z",
    "updateDate": "2024-02-05T01:19:38.001Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_1_-_Application_-_Matthew_Cheng_-_7300_St70719.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: September 18, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 21-943417\nRe: Application by Matthew Cheng for Rezoning at 7300 St. Albans Road from \"Single Detached (RS1/E)\" Zone to \"High Density Townhouses (RTH1)\" Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10494, for the rezoning of 7300 St. Albans Road from \"Single Detached (RS1/E)\" zone to \"High Density Townhouses (RTH1)\" zone, be introduced and given first reading.\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:ak\nAtt. 6\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing \nC\nONCURRENCE OF GENERAL MANAGER\nPH - 5\nStaff Report\nOrigin\nMatthew Cheng, on behalf of 1124053 B.C. LTD (Director: Pavendeep Kooner), has applied to the City of Richmond for permission to rezone 7300 St. Albans Road from the \"Single Detached (RS1/E)\" zone to the \"High Density Townhouses (RTH1)\" zone to permit the development of four townhouse units with one secondary suite (Attachment 1).\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 2).\nSubject Site Existing Housing Profile\nThe subject site contains an unoccupied single-family dwelling.\nSurrounding Development\nThe subject site fronts St. Albans Road. Existing development immediately surrounding the subject site is as follows:\nTo the North: The St. Albans' Anglican Church zoned \"Assembly (ASY)\".\nTo the South: A seven-unit townhouse complex zoned \"Medium Density Low Rise Apartments (RAM1)\".\nTo the East: A 36-unit townhouse complex zoned \"Medium Density Low Rise Apartments (RAM1)\".\nTo the West: Across St. Albans Road, a three-storey apartment (over a single-storey parking structure) zoned \"Medium Density Low Rise Apartments (RAM1)\".\nExisting Legal Encumbrances\nThere is a City Statutory Right-of-Way (SRW) registered on Title of the subject property for the sanitary sewer located along the east property line. The applicant has been advised that encroachment into the SRW is not permitted.\nRelated Policies & Studies\nOfficial Community Plan/City Centre Area Plan\nThe subject property is designated as \"Neighbourhood Residential\" in the Official Community Plan (OCP). The subject property is also located within the City Centre Area, Schedule 2.10 of the OCP and is designated \"Sub-Area B.1: Mixed Used - Low Rise Residential & Limited Commercial\" which is intended for grade-oriented housing in the form of townhouses with a common parking structure of conventional and stacked townhouses.\nPH - 6\nThe proposed development provides for a similar form to the adjacent development to the south and the preliminary design complies with the Sub-Area B.1 guidelines in terms of land use, density and overall neighbourhood character. At the Development Permit (DP) stage, the townhouses' design, form and character will be further reviewed.\nAs set out in the City Centre Area Plan, the applicant is required to provide a contribution at a rate of $0.34 per buildable square foot for future City Community Planning studies.\nRegistration of a legal agreement on Title is required, ensuring that future owners are aware that the development is subject to potential impacts due to other developments that may be approved within the City Centre.\nSt. Albans Sub-Area Plan\nThe proposed development is consistent with the Multi-Family Low Rise land use designation in the St. Albans Sub-Area Plan, which envisions three-storey apartments, townhouses, two-family or single-family dwellings (Attachment 3). The proposal for four three-storey townhouse units and one secondary suite is also generally consistent with the surrounding developments.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not yet received any comments from the public about the rezoning application in response to the rezoning sign on site.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the public will have an opportunity to further comment on all of the proposed amendments at a Public Hearing.\nPublic notification of the Public Hearing will be provided as per the Local Government Act and the City's Zoning Bylaw 8500.\nAnalysis\nBuilt Form and Architectural Character\nThe applicant proposes to construct a total of four townhouse units and one secondary suite with access from St. Albans Road. The layout of the townhouse units is oriented around a single driveway providing access to the site from St. Albans Road and a north-south internal maneuvering aisle providing access to the unit garages. A total of two three-storey duplex clusters are proposed.\nPH - 7",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:19:13.400Z",
    "updateDate": "2024-02-05T01:19:13.400Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1048770862.pdf",
    "text": "City of Richmond 7335387 The Council of the City of Richmond enacts as follows: I. Alexandra District Energy Utility Bylaw No. 8641, as amended, is further amended by deleting section 6.1 and replacing it with the following: Bylaw 10487 Alexandra District Energy Utility Bylaw No. 8641 Amendment Bylaw No. 10487 \"6.1 Service Connection and Energy Transfer Station (a) In order to provide the Services and bill a Customer for Energy delivered, the Service Provider will, subject to Section 6.3 (Supply and Installation of Service Connection and Energy Transfer Station by Customer) and Section 6.6 (Additional Service Connections, Energy Transfer Stations) below, serve each Designated Property with one Service Connection and one Energy Transfer Station. (b) If a Designated Property has more than one building, then each building on the Designated Property must have its own Energy Transfer Station, and the Customer must apply for such additional Energy Transfer Station(s) pursuant to Section 6.6 (Additional Service Connections, Energy Transfer Station) below. (c) The technical specifications of all Service Connections and Energy Transfer Stations and the components thereof will be determined by the Service Provider.\" Alexandra District Energy Utility Bylaw No. 8641, as amended, is further amended by deleting section 6.6 and replacing it with the following: \"6.6 Additional Service Connections, Energy Transfer Stations (a) A Customer may apply to the Service Provider for one or more additional Service Connections at a Designated Property, which additional Service Connection(s) together with the related Energy Transfer Station(s) may be provided at the sole discretion of the Service Provider. (b) A Customer may apply to the Service Provider for one or more additional Energy Transfer Stations at a Designated Property, which additional Energy Transfer Station(s) may be provided at the sole discretion of the Service Provider. (c) If the Service Provider agrees to install an additional Service Connection and/or Energy Transfer Station, the Service Provider may charge the Customer CNCL - 151Bylaw 10487 (d) Page 2 additional ETS and Service Connection Installation Fees for the provision, supply, delivery and installation of the additional Service Connection and/or Energy Transfer Station. The Service Provider may bill each additional Service Connection and/or Energy Transfer Station from a separate meter and account. The Alexandra District Energy Utility Bylaw No. 8641, as amended, is further amended by deleting Schedule C (Rates and Charges) in its entirety and replacing it with a new Schedule C attached as Schedule A to this Bylaw. This Bylaw is cited as \"Alexandra District Energy Utility Bylaw No. 8641, Amendment Bylaw No. 10487\" FIRST READING SECOND READING THIRD READING ADOPTED MAYOR CNCL - 152 NOV 14 2023 NOV 14 2023 NOV 14 2023 CORPORATE OFFICER CITY OF RICHMOND APPROVED for content by originating dept CR APPROVED for legally by So BRB Bylaw 10487 (d) Page 2 additional ETS and Service Connection Installation Fees for the provision, supply, delivery and installation of the additional Service Connection and/or Energy Transfer Station. The Service Provider may bill each additional Service Connection and/or Energy Transfer Station from a separate meter and account. The Alexandra District Energy Utility Bylaw No. 8641, as amended, is further amended by deleting Schedule C (Rates and Charges) in its entirety and replacing it with a new Schedule C attached as Schedule A to this Bylaw. This Bylaw is cited as \"Alexandra District Energy Utility Bylaw No. 8641, Amendment Bylaw No. 10487\" FIRST READING SECOND READING THIRD READING ADOPTED MAYOR CNCL - 152 NOV 14 2023 NOV 14 2023 NOV 14 2023 CORPORATE OFFICER CITY OF RICHMOND APPROVED for content by originating dept CR APPROVED for legally by So BRB",
    "maxPages": 2,
    "type": "image",
    "createDate": "2024-02-05T01:18:54.613Z",
    "updateDate": "2024-02-05T01:18:54.613Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Application_by_Gurjit_Pooni_for_Rezoning_at_10511_Lassam_Road70760.pdf",
    "text": "7404492\nReport to Committee\nTo: Planning Committee\nDate: November 6, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 22-011080\nRe: Application by Gurjit Pooni for Rezoning at 10511 Lassam Road from the “Single Detached RS1/E” Zone to the “Single Detached (RS2/B)” Zone\nStaff Recommendation\nThat Richmond Zoning Bylaw 8500, Amendment Bylaw 10513, for the rezoning of 10511 Lassam Road from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone, be introduced and given first reading.\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:ac\nAtt.6\nREPORT CONCURRENCE\nROUTED TO:CONCURRENCE\nAffordable Housing ;\nCONCURRENCE OF GENERAL MANAGER RRENCEOF GENER\nPLN - 7\nNovember 6, 2023 - 2 -RZ 22-011080\n7404492\nStaff Report\nOrigin\nOnyx Premier Homes Ltd. (Directors: Amar Gill and Jasdeep Uppal) have applied to the City of Richmond for permission to rezone 10511 Lassam Road from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone, to permit the property to be subdivided to create two single-family lots with access from Lassam Road. A map and aerial photograph showing the location of the subject site is included in Attachment 1. The proposed subdivision is provided in Attachment 2.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile\nThere is an existing single-family dwelling on the subject property which is currently vacant and proposed to be demolished. There are no existing secondary suites in the dwelling.\nSurrounding Development\nDevelopment immediately surrounding the subject site is as follows:\nTo the North: A school (James McKinney Elementary School) on a lot zoned “School & Institutional Use (SI)”, accessed from Lassam Road.\nTo the South: A single-family dwelling on a property zoned “Single Detached (RS1/B)”, accessed from Lassam Road.\nTo the East: Across Lassam Road, single-family dwellings on lots zoned “Single Detached (RS1/E)”, accessed from Lassam Road.\nTo the West: The parking area for a school (James McKinney Elementary School on a lot zoned “School & Institutional Use (SI)”, accessed from Lassam Road.\nRelated Policies & Studies\nOfficial Community Plan/Steveston Planning Area\nThe subject property is located in the Steveston planning area and is designated as “Neighbourhood Residential” in the Official Community Plan (OCP). The property is designated for “Single Family” use in the Steveston Area Plan. The proposed rezoning and subdivision are consistent with these designations.\nPLN - 8\nNovember 6, 2023 - 3 - RZ 22-011080\n7404492\nSingle Family Lot Size Policy 5420/Zoning Bylaw 8500\nThe subject property is located within the area covered by Lot Size Policy 5420, adopted by City Council in 1989, and subsequently amended by Council on August 7, 1992, and on August 21, 1995 (Attachment 4). The Policy permits properties along Lassam Road to be rezoned and subdivided in accordance with the provisions of the “Single Detached (RS2/B)” zone (minimum 12 m wide lots). Each proposed lot at the subject site will be approximately 12.6 m (41 ft.) wide and approximately 575 m² (6,189.25 ft²) in area which conforms to the RS2/B zone. The proposed rezoning complies with the Lot Size Policy.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nIn accordance with the City’s Early Public Notification Policy No. 1316, a notice of the development proposal was provided to residents within 100 metres of the subject site. In addition, a rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the early public notification or placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nAnalysis\nThis redevelopment proposes to rezone and subdivide an existing single-family lot into two new single-family lots with vehicular access for both new lots off Lassam Road. This rezoning and subdivision is consistent with the emerging lot fabric and vehicular access along Lassam Road.\nExisting Legal Encumbrances\nThere is an existing 3 m wide Statutory Right-of-Way (SRW) for City sanitary service that covers a small portion of the property in the southwest corner which will be expanded and widened northward with utility upgrades. The applicant has been advised that no building encroachment into the SRW is permitted.\nTransportation and Site Access\nThe subject site currently has vehicular access from a driveway letdown along Lassam Road. In accordance with the Residential Lot (Vehicular) Access Regulation Bylaw 7222, vehicle access to proposed Lot 1 and proposed Lot 2 will be from Lassam Road.\nPLN - 9",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:18:26.346Z",
    "updateDate": "2024-02-05T01:18:26.346Z"
  }
]