[
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72966",
    "text": "Meeting October 30, 2023\nFile: 49500 02 REZ #22-36\nCOUNCIL REPORT\nTO: MAYOR & COUNCIL\nFROM: GENERAL MANAGER PLANNING AND DEVELOPMENT\nSUBJECT: REZONING REFERENCE #22-36 – COMMERCIAL RENTAL\nTOWER VII – BRENTWOOD TOWN CENTRE DEVELOPMENT\nPLAN\nPURPOSE: Seek Council authorization to forward REZ #22-36 to future Public Hearing.\nREFERENCES\nAddress: Portion of 4567 Lougheed Highway\nLegal: Portion of Lot 1 District Lots 123 and 124 Group 1 New Westminster District Plan EPP31990 Except Plans EPP40171, EPP59173 and EPP108674\nApplicant: Shape Properties Corp.\n2020 One Bentall Centre, 505 Burrard Street Vancouver, BC PO Box 206\nAttention: Patrick Hunter\nCurrent Zoning: CD Comprehensive Development District (based on C3, C3a General Commercial District, P2 Administration and Assembly District, RM4s, RM5s Multiple Family Residential District and Brentwood Town Centre Plan as guidelines)\nProposed Zoning: Amended CD Comprehensive Development District (based on C3 General Commercial District and Brentwood Town Centre Plan as guidelines and in accordance with the development plan entitled “The Amazing Brentwood Phase 2C-Tower 7” prepared by Arcadis Architects (Canada) Inc.)\nRECOMMENDATIONS\nTHAT a Rezoning Bylaw for REZ #22-36 be prepared and advanced to First Reading and to a Public Hearing at a future date, and;\nTHAT the following be established as prerequisites to the completion of the rezoning:\na. The submission of a suitable plan of development.\nb. The deposit of sufficient monies including a 4% Engineering Administration Fee to cover the costs of all services necessary to serve the site and the completion of a servicing agreement covering all requisite services. All services are to be designed to City standards and constructed in accordance with the Engineering Design. One of the conditions for the release of occupancy permits will be the completion of all requisite services.\nc. The installation of all electrical, telephone and cable servicing, and all other wiring underground throughout the development (as well as underground switching and transformer/service boxes in town centre locations), and to the point of connection to the existing service where sufficient facilities are available to serve the development.\nd. The submission of an undertaking to remove all existing improvements from the subject site within one year of Final Adoption.\ne. The dedication of any rights-of-way deemed requisite.\nf. The granting of any necessary statutory rights-of-way, easements and/or covenants in accordance with Section 3.10 of this report.\ng. The submission of a suitable on-site Stormwater Management System, the deposit of sufficient monies for its provision, and the granting of a Section 219 Covenant to guarantee its provision and continuing operation.\nh. Compliance with the City’s Groundwater Management for Multi-Family Development guidelines.\ni. The submission of a geotechnical and groundwater study.\nj. The submission of a suitable Solid Waste and Recycling Plan.\nk. The review of on-site loading facilities.\nl. The provision of enhanced car wash stalls and an adequately sized and appropriately located garbage handling and recycling material holding space and a commitment to implement the recycling provisions.\nm. The provision of facilities for cyclists in accordance with this report.\nn. The design and provision of units accessible to persons with disabilities, including the provision of customized hardware and cabinet work.\no. The design and provision of units adaptable to persons with disabilities, the provision of customized hardware and cabinet work being subject to the rental of the unit to a disabled person.\np. Compliance with Council-adopted sound criteria.\nq. Compliance with the guidelines for underground parking for visitors.\nr. The submission of a Green Building Plan and Energy Benchmarking.\ns. The submission of a detailed Comprehensive Sign Plan.\nt. The submission of a Site Disclosure Statement and resolution of any resultant conditions.\nu. The deposit of the applicable Parkland Acquisition Charge.\nv. The deposit of the applicable School Site Acquisition Charge.\nw. The deposit of the applicable GVS & DD Sewerage Charge.\nx. The deposit of the applicable Regional Water Cost Charge.\ny. The deposit of the applicable Regional Transportation Development Cost Charge.\nz. The submission of a written undertaking to distribute area plan notification forms, prepared by the City, with disclosure statements; and, to post area plan notification signs, also prepared by the City, on the development site and in the rental office in prominent and visible locations prior to Third Reading, or at the time marketing for the subject development commences, whichever is first, and remain posted for a period of one year, or until such time that all units are rented, whichever is greater.\nCHIEF ADMINISTRATIVE OFFICER’S COMMENTS\nI concur with the recommendation of the General Manager Planning and Development.\nEXECUTIVE SUMMARY\nA rezoning application has been received to permit the construction of a high-rise commercial rental residential apartment building atop a commercial podium and underground parking in accordance with the Brentwood Site Conceptual Master Plan and associated Development Guidelines (REZ #11-22). The purpose of this report is to provide Council with information on the proposal and to recommend that the Rezoning Bylaw be brought forward for First Reading and the rezoning application be forwarded to a future Public Hearing.\n1.0 POLICY SECTION\nThe proposed rezoning application is consistent with the following policies and plans adopted by Council:\n• Regional Context Statement (2013);\n• Corporate Strategic Plan (2022);\n• Official Community Plan (1998);\n• Brentwood Town Centre Development Plan (1996);\n• Economic Development Strategy (2007);\n• Social Sustainability Strategy (2011);\n• Environmental Sustainability Strategy (2016);\n• Climate Action Framework (2020);\n• Transportation Plan (2021);\n• Home Strategy (2021); and,\n• Rental Use Zoning Policy (2020).\n2.0 BACKGROUND\n2.1 On 2013 September 23, Council granted Final Adoption to REZ #11-22, which established the Brentwood Site Conceptual Master Plan and associated Development Guidelines for phased mixed-use retail, office and multiple family redevelopment of The Amazing Brentwood (TAB) site in line with the adopted Brentwood Town Centre Development Plan. As a result, the site is zoned CD Comprehensive Development District (based on the C3 and C3a General Commercial Districts, P2 Administration and Assembly District, RM4s Multiple Family Residential District and RM5s Multiple Family Residential District as guidelines).\n2.2 The subject site is located on the southeast corner of Brentwood Boulevard and the future Ridgelawn Drive in the interior of the TAB site, within the Council adopted Brentwood Town Centre Development Plan, and is designated for C3 General Commercial District, and the Brentwood Town Centre Development Plan as guidelines (see Attachment 1 – REZ #22-36: Sketch #1 and Sketch #2).The site, approximately 5,407 m2 (58,200 sq. ft.) in size (subject to legal survey), is comprised of a portion of 4567 Lougheed Highway, the remainder parcel, and is identified in the Brentwood Site Conceptual Master Plan for a commercial tower. This portion of the remainder parcel is currently improved with TAB sales centre, in the former Zellers retail unit.\n2.3 On 2023 February 06, Council received an initial rezoning report which proposed to rezone the subject development site from its prevailing CD Comprehensive Development District to an amended CD Comprehensive Development District in accordance with the Brentwood Town Centre Development Plan and the development plan entitled “The Amazing Brentwood Phase 2C-Tower 7” prepared by Arcadis Architects (Canada) Inc.\nResults:\n- The proposed rezoning is to CD Comprehensive Development District.\n- The proposed development plan is for a single 56 storey high-rise commercial rental residential apartment building with commercial retail units.\n- Residential vehicular access is provided via an access ramp off Brentwood Boulevard.\n- A total of 614 rental residential dwelling units are proposed for the development.\n- The proposed total density for the subject site based on net site area for Tower VII is 9.24 FAR or 49,896.54 m2.\n- The applicant is proposing to utilize 48,893.00 m2 of C3 density to provide 641 market rental dwelling units in Tower VII.\n- The development is providing 2.5% of all residential units as adaptable and 2.5% of all residential units as accessible.\n- The development is proposing a parking ratio of 0.53 spaces per unit.\n- All residential spaces will be equipped with an individually metered energized outlet capable of providing a Level 2 or higher charging level for an electric vehicle.\n- The TDM strategy includes establishing an alternative transportation fund, car share parking spaces, bike parking spaces, bike wash and repair facilities, and a communications strategy.\n- Covenant and financial securities required for TDM Strategy provision.\n- Engineering Master Plan completed for Brentwood Site Conceptual Master Plan.\n- Engineering Department to assess need for additional services.\n- Necessary dedications obtained as part of master rezoning.\n- Subdivision required for subject site.\n- Airspace parcel subdivision required before occupancy of residential building.\n- Necessary easements, covenants, and rights-of-way to be provided.\n- Section 219 Covenant for various purposes, including balcony enclosure, removal of existing improvements, compliance with acoustical study, stormwater management, accessible parking stalls, compliance with Green Building Plan, and shared visitor parking stalls.\n",
    "maxPages": 8,
    "type": "text",
    "createDate": "2024-02-06T01:06:56.968Z",
    "updateDate": "2024-02-06T01:06:56.968Z"
  }
]