[
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_Application_11230_WilliamsRd_PH_02222261140.pdf",
    "text": "To: City of Richmond Planning Committee\nReport to Committee\nDate: December 14, 2021\nFrom: Wayne Craig\nFile: RZ 21-930446\nDirector, Development\nRe: Application by Habib Samari for Rezoning at 11320 Williams Road from the \"Single Detached (RS1/E)\" Zone to the \"Compact Single Detached (RC2)\" Zone\nStaff Recommendation\nThat Richmond Zoning Bylaw 8500, Amendment Bylaw 10303, for the rezoning of 11320 Williams Road from the \"Single Detached (RSl/E)\" zone to the \"Compact Single Detached (RC2)\" zone, be introduced and given first reading.\nWayne Craig\nDirector, Development\n(604-247-4625)\nStaff Report\nOrigin\nHabib Samari has applied to the City of Richmond for permission to rezone RZ 21-930446 11320 Williams Road from the \"Single Detached (RS 1/E)\" zone to the \"Compact Single Detached (RC2)\" zone, to permit the property to be subdivided to create two single-family lots, both with vehicle access from the rear lane. A location map and aerial photo are provided in Attachment 1.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is provided in Attachment 2. The proposed subdivision plan is provided in Attachment 3.\nSubject Site Existing Housing Profile\nThere is an existing single detached dwelling on the property, which is proposed to be demolished. The dwelling is currently rented and does not contain a secondary suite.\nSurrounding Development\nDevelopment immediately surrounding the subject site is as follows:\nTo the North: Single detached dwellings on lots zoned \"Compact Single Detached (RC1)\" and a single-storey childcare building on a lot zoned \"Assembly (ASY),\" fronting Williams Road with and vehicle access from the rear lane.\nTo the South: Across the lane, single detached dwellings on lots zoned \"Single Detached (RS 1/E),\" fronting Seafield Crescent.\nTo the East: A single detached dwellings on a lot zoned \"Compact Single Detached (RC2),\" fronting Williams Road and with vehicle access from the rear lane.\nTo the West: A single detached dwelling on a lot zoned \"Single Detached (RS 1/E),\" fronting Williams Road and with vehicle access from the rear lane. This lot has similar redevelopment potential and is designated Compact Single Detached in the Arterial Road Land Use Policy.\nRelated Policies & Studies\nOfficial Community Plan\nThe subject property is located in the Shellmont planning area, and is designated \"Neighbourhood Residential\" in the Official Community Plan (OCP) land use map (Attachment 4). The proposed rezoning and subdivision are consistent with this designation.",
    "maxPages": 2,
    "createDate": "2024-02-03T18:39:22.645Z",
    "updateDate": "2024-02-03T18:39:22.645Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_dpp_ketcheson_road69357.pdf",
    "text": "To: From: Re: City of Richmond\nWC:sb Att. 3 Development Permit Panel\nWayne Craig Director, Development\n727618 Wayne Craig Director, Development (604-247-4625)\nReport to Development Permit Panel\nStaff Recommendation\nThat a Development Permit be issued which would permit the construction of 178 residential units in a 14-storey high-rise multi-family apartment building at 3588 Ketcheson Road on a site zoned \"Residential / Limited Commercial (ZMU47)-Capstan Village (City Centre)\".\nDate: August 2, 2023\nFile: DP 22-017484\nApplication by Polygon Talisman Park Ltd. for a Development Permit at 3588 Ketcheson RoadAugust 2, 2023 -2- Staff Report Origin Polygon Talisman Park Ltd. has applied to the City of Richmond for permission to develop 178 housing units in a 14-storey apartment building at 3588 Ketcheson Road, a recently subdivided development site comprising a portion of the property formerly located at 8791 Cambie Road/3600 Sexsmith Road and zoned \"Residential / Limited Commercial (ZMU47)-Capstan Village (City Centre)\". The site is currently vacant. Highlights of the proposed development include: \n• The subject application is the second phase of a four-phase development. The first phase of the development will provide all of the required affordable housing and the majority of the required market rental housing. The associated Development Permit (DP 22-015851) was issued by Council on July 10, 2023. Additional market rental housing is required in the second, third and fourth phases (17 market rental units in each phase). DP 22-017484 \n• The subject development includes 178 apartment units, consisting of 17 market rental units and 161 strata residential units. \n• The subject development provides a range of unit types from one-bedroom to three-bedroom. \no Unit areas are proposed to range from 57 m² to 104 m² (613 ft² to 1,120 ft²). \no All the units will be connected to a City-owned Low Carbon Energy System (as secured through the associated rezoning application). \n• Approximately 1,876.8 m² (20,202 ft) of indoor amenity space. \n• Approximately 1,611 m² (17,341 ft) of outdoor amenity space. \n• Approximately 900 m² (9,692 ft) of publicly accessible open space. A Servicing Agreement is required to accommodate the development and was secured through the associated rezoning application, providing for the design and construction of new roads, road widening, frontage improvements off-site, and on-site public pathway and central green along the north and south edges of the subject site. Development Information Please refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements. 7276188 Background The subject site is located in the centre of the four-phase development, fronting onto new roads provided by the development. The subject site is in the Capstan Village area of the City Centre Planning Area and has a net site area of 4,510.4 m² (48,549.5 ft) in area. Development surrounding the subject site is as follows: To the Northwest: Site for the fourth phase of the subject four-phase development, which will include high-density high-rise residential development.",
    "maxPages": 2,
    "createDate": "2024-02-03T18:37:45.878Z",
    "updateDate": "2024-02-03T18:37:45.878Z"
  }
]