[
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72014",
    "text": "Meeting November 20, 2023\nFile: 49500 20 REZ #20-17\nCOUNCIL REPORT\nTO: MAYOR & COUNCIL\nFROM: GENERAL MANAGER PLANNING AND DEVELOPMENT\nSUBJECT: REVISED REZ #20–17 – A PORTION OF 6229 MARINE DRIVE –\nNON-MARKET HOUSING DEVELOPMENT – EDMONDS TOWN\nCENTRE PLAN\nPURPOSE: To provide a project funding update and to seek Council authorization\nto forward REZ #20-17 to a future Public Hearing while requesting the\nprevious in-stream bylaw be repealed and the new proposed bylaw\nadvanced to second reading and future public hearing.\nREFERENCES\nAddress: A portion of 6229 Marine Drive\nLegal: Portion of Lot A, DLs 155A and 171, Group 1 NWD Plan\nEPP122272\nApplicant: Mania Hormozi\nCLT 0012 Community Society\n220-1651 Commercial Drive, Vancouver, BC, V5L 3Y3\nCurrent Zoning: CD Comprehensive Development District (based on the RM3r\nMultiple Family Residential District, and in accordance with the\ndevelopment guidelines prepared by the City under Rezoning\nReference #19-59)\nProposed Zoning: Amended CD Comprehensive Development District (based on the\nRM2 Multiple Family Residential District and RM2r Multiple Family\nResidential District, the Edmonds Town Centre Plan as guidelines,\nand in accordance with the revised development guidelines\nprovided in Appendix A of the Rezoning Bylaw)\nRECOMMENDATIONS\nTHAT Burnaby Zoning Bylaw 1965, Amendment Bylaw No. 50, 2020 (Bylaw No.\n14250), referenced as the current in-stream Rezoning Bylaw for REZ #20-17, be\nrepealed and abandoned contingent upon the granting by Council of Second\nReading of the new Rezoning Bylaw for REZ #20-17;\nTHAT Burnaby Zoning Bylaw 1965, Amendment Bylaw No. 35, 2023 (Bylaw No.\n14613), which received first reading on November 6, 2023, for REZ #20-17, be\namended in accordance with Section 3.0 and Attachment 2 of the report entitled\n“Revised REZ #20-17 – Portion of 6229 Marine Drive – Non-Market Housing\nDevelopment – Edmonds Town Centre Plan” dated November 20, 2023, and be\nadvanced to Second Reading and to a future Public Hearing;\nTHAT the granting and execution of any necessary Statutory Rights of Way over\nthe subject site be authorized in favour of third-party utility providers to install any\ninfrastructure required to service the site;\nTHAT a copy of this report be sent to BC Housing, and;\nTHAT the following be established as prerequisites to the completion of the\nrezoning:\na) The submission of a suitable plan of development.\nb) The completion of a Subdivision Plan.\nc) The granting of any necessary Section 219 Covenants and Statutory Rights\nof Way.\nCHIEF ADMINISTRATIVE OFFICER’S COMMENTS\nI concur with the recommendation of the General Manager Planning and Development.\nEXECUTIVE SUMMARY\nThe purpose of the proposed rezoning bylaw amendment is to establish development\nguidelines for the subject site to facilitate development of non-market housing.\n1.0 POLICY SECTION\nThe proposed rezoning application is consistent with the following policies and plans\nadopted by Council:\n• Corporate Strategic Plan (2022),\n• Regional Context Statement (2013),\n• Official Community Plan (1998),\n• Economic Development Strategy (2007),\n• Social Sustainability Strategy (2011),\n• Environmental Sustainability Strategy (2016),\n• Transportation Plan (2021),\n• HOME: Housing and Homelessness Strategy (2021), and,\n• Edmonds Town Centre Plan (1994).\n2.0 BACKGROUND\n2.1 The subject site measures approximately 0.81 hectares (1.99 acres) and is\nlocated within Sub-Area 3 of the Edmonds Town Centre Plan, at the southeast\ncorner of Southridge Drive and Byrnepark Drive (see Attachment 1 – REZ #20-\n17: Sketch #1 and Sketch #2). The subject site, together with a larger site to the\nsouthwest measuring approximately 4.24 hectares (10.48 acres), forms a large\nSubject: Revised Rezoning Reference #20-17 – A portion of 6229 Marine Drive – Non-Market\nHousing Development – Edmonds Town Centre Plan\nOpen Council Meeting November 20, 2023 .................................. Page 3\ndevelopment site commonly referred to as the “Bevan Lands”. The overall Bevan\nLands site is designated for medium density multiple family development and is\nconsidered a key site for plan implementation within the Edmonds Town Centre.\nTo the west of the overall Bevan Lands site are City-owned and privately held\nproperties designated for single-family development or a future area rezoning.\nTo the east is Fourteenth Avenue Ravine Park. To the north, across Southridge\nDrive, is a recently developed townhouse and low-rise project (REZ#18-09). To\nthe south, across Marine Drive, are single-family dwellings in the Big Bend\nDevelopment Plan area, with agricultural properties beyond.\nOn November 18, 2019, Council advanced a program to bring forward a number\nof City-owned sites, including the subject site (REZ# 19-59), for non-market\nhousing development, in partnership with other orders of government. REZ# 19-\n59 established development guidelines for the site and received Final Adoption\non November 09, 2020.\n2.2 On November 23, 2020, a Public Hearing report for the subject site (REZ# 20-17)\nwas submitted outlining a more detailed form of development for the two non-\nmarket co-operative buildings with up to 118 units to be operated by the\nCommunity Land Trust (CLT). The application received Second Reading on\nDecember 17, 2020. However, on February 28, 2022 a report was advanced to\nCouncil to note that CLT was not successful, at that time, in obtaining BC\nHousing’s Community Housing Fund to develop the subject site.\n2.3 On June 19, 2023, BC Housing announced that it would be providing funding to\nsix non-market housing projects on City-owned land from the Building BC:\nCommunity Housing Fund (CHF). One of these projects is the subject site. The\nfunding would allow for a cooperative housing project with up to 118 housing\nunits provided at different levels of affordability as per the CHF funding program\nwhich includes 20% at the shelter rate, 50% at RGI (Rent Gear to Income) rates,\nand 30% at LEM (Low End Market) rates.\n2.4 On October 30, 2023",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T19:28:47.278Z",
    "updateDate": "2024-02-05T19:28:47.278Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72972",
    "text": "Meeting October 30, 2023\nFile: 49500 02 REZ 23-06\nCOUNCIL REPORT\nTO: MAYOR & COUNCIL\nFROM: GENERAL MANAGER PLANNING AND DEVELOPMENT\nSUBJECT: REZ #23-06 - BURNABY LAKE VILLAGE CONCEPTUAL MASTER\nPLAN PHASE 1A - BAINBRIDGE URBAN VILLAGE COMMUNITY\nPLAN\nPURPOSE: To seek Council authorization to forward REZ #23-06 to a future\nPublic Hearing.\nREFERENCES\nAddress: Portion of 6800 Lougheed Highway\nLegal: Lot 1, Except: Firstly; Part in LMP44883, Secondly; Part in Plan\nBCP314, Thirdly; Part in Plan BCP1828, Fourthly; Part in Plan\nBCP22451 District Lot 78 Group 1 New Westminster District Plan\n74615\nApplicant: Sperling Limited Corporation\n1701-1166 Alberni Street\nVancouver, BC V6E 3Z3\nAttention: Sean Callaghan\nCurrent Zoning: M2 General Industrial District and R2 Residential District\nProposed Zoning: CD Comprehensive Development District (based on RM5uv-a\nMultiple Family Residential District, RM5r Multiple Family\nResidential District, C2 Community Commercial District, and the\nBainbridge Urban Village Community Plan as guidelines, and in\naccordance with the development plan entitled “Phase 1\nSperling/Saputo/6800, Buildings G & H” prepared by ARCADIS)\nRECOMMENDATIONS\nTHAT a Rezoning Bylaw for REZ #23-06 be prepared and advanced to First\nReading and to a Public Hearing at a future date;\nTHAT the introduction of a Housing Agreement Bylaw be authorized according to\nthe terms outlined in Section 3.11 of the report titled “REZ #23-06 Burnaby Lake\nVillage Conceptual Master Plan Phase 1A – Bainbridge Urban Village Community\nPlan” dated October 30, 2023, contingent upon the granting by Council of\nSecond Reading of the Rezoning Bylaw related to the subject site, and;\nTHAT the following be established as prerequisites to the completion of the\nrezoning:\na. The submission of a suitable plan of development.\nSubject: REZ #23-06 – Burnaby Lake Village Master Plan Phase 1A\nOpen Council Meeting October 30, 2023 ...................................... Page 2\nb. The advancement of the Burnaby Lake Village Conceptual Master Plan\n(REZ #22-28) to Final Adoption prior to, or concurrent with the subject\nrezoning application.\nc. The deposit of sufficient monies including a 4% Engineering\nAdministration Fee to cover the costs of all services necessary to serve\nthe site and the completion of a servicing agreement covering all requisite\nservices. All services are to be designed to City standards and constructed\nin accordance with the Engineering Design. One of the conditions for the\nrelease of occupancy permits will be the completion of all requisite\nservices.\nd. The installation of all electrical, telephone and cable servicing, and all\nother wiring underground throughout the development (as well as\nunderground switching and transformer/service boxes in town centre\nlocations), and to the point of connection to the existing service where\nsufficient facilities are available to serve the development.\ne. The undergrounding of overhead wiring abutting the site.\nf. The completion of the subdivision.\ng. The dedication of any rights-of-way deemed requisite.\nh. The granting of any necessary statutory rights-of-way, easements and/or\ncovenants in accordance with Section 3.10 of this report.\ni. The registration of a Housing Covenant and Housing Agreement.\nj. The submission of a suitable on-site Stormwater Management System,\nthe deposit of sufficient monies for its provision, and the granting of a\nSection 219 Covenant to guarantee its provision and continuing operation.\nk. Compliance with the City’s Groundwater Management for Multi-Family\nDevelopment guidelines.\nl. The submission of a geotechnical and groundwater study.\nm. The execution of an indemnity agreement by the developer saving the City\nharmless from all liability associated with this development in relation to its\ngeotechnical and hydrological (including any potential contaminated\ngroundwater) impacts to surrounding infrastructure and other nearby\ndevelopment.\nn. The submission of a suitable Solid Waste and Recycling Plan.\no. The review of on-site loading facilities.\nSubject: REZ #23-06 – Burnaby Lake Village Master Plan Phase 1A\nOpen Council Meeting October 30, 2023 ...................................... Page 3\np. The provision of enhanced car wash stalls and an adequately sized and\nappropriately located garbage handling and recycling material holding\nspace and a commitment to implement the recycling provisions.\nq. The provision of facilities for cyclists in accordance with this report.\nr. The design and provision of units adaptable to persons with disabilities,\nthe provision of customized hardware and cabinet work being subject to\nthe sale or lease of the unit to a disabled person.\ns. Compliance with Council-adopted sound criteria.\nt. Compliance with the guidelines for underground parking for visitors.\nu. The submission of a Green Building Plan and Energy Benchmarking.\nv. The submission of a detailed Comprehensive Sign Plan.\nw. The submission of a Site Disclosure Statement and resolution of any\nresultant conditions.\nx. The deposit of the applicable Parkland Acquisition Charge.\ny. The deposit of the applicable School Site Acquisition Charge.\nz. The deposit of the applicable GVS & DD Sewerage Charge.\naa. The deposit of the applicable Regional Water Cost Charge.\nbb. The deposit of the applicable Regional Transportation Development Cost\nCharge.\ncc. The submission of a written undertaking to distribute area plan notification\nforms, prepared by the City, with disclosure statements; and, to post area\nplan notification signs, also prepared by the City, on the development site\nand in the sales office in prominent and visible locations prior to Third\nReading, or at the time marketing for the subject development\ncommences, whichever is first, and remain posted for a period of one\nyear, or until such time that all units are sold, whichever is greater.\nCHIEF ADMINISTRATIVE OFFICER’S COMMENTS\nI concur with the recommendation of the General Manager Planning and Development.\nEXECUTIVE SUMMARY\nA rezoning application has been received in order to permit the construction of two mid-\nrise strata apartment buildings atop a commercial podium with underground parking,\nand a mid-rise market and below-market rental building with underground parking in\naccordance with Phase 1A of the Burnaby Lake Village Conceptual Master Plan\n(Rezoning Reference #22-28). The purpose of this report is to provide Council with\nSubject: REZ #23-06 – Burnaby Lake Village Master Plan Phase 1A\nOpen Council Meeting October 30, 2023 ...................................... Page 4\ninformation on the proposal and to recommend that the Rezoning Bylaw be brought\nforward for First Reading and that it be forwarded to a future Public Hearing.\n1.0 POLICY SECTION\nThe proposed rezoning application is consistent with the following policies and plans\nadopted by Council:\n• Regional Context Statement (2013);\n• Corporate Strategic Plan (2022);\n• Official Community Plan (1998);\n• Bainbridge Urban Village Community Plan (2022);\n• Economic Development Strategy (2007);\n• Social Sustainability Strategy (2011);\n• Environmental Sustainability Strategy (2016);\n• Climate Action Framework (2020);\n• Transportation Plan (2021);\n• Home Strategy (2021); and,\n• Rental Use Zoning Policy (2020).\n2.0 BACKGROUND\n2.1 On June 05, 2023, Council granted Second Reading to REZ #22-28 for the\nBurnaby Lake Village Conceptual Master Plan, which established a Conceptual\nMaster Plan framework and companion Design Guidelines",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T19:28:15.166Z",
    "updateDate": "2024-02-05T19:28:15.166Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72966",
    "text": "Meeting October 30, 2023\nFile: 49500 02 REZ #22-36\nCOUNCIL REPORT\nTO: MAYOR & COUNCIL\nFROM: GENERAL MANAGER PLANNING AND DEVELOPMENT\nSUBJECT: REZONING REFERENCE #22-36 – COMMERCIAL RENTAL\nTOWER VII – BRENTWOOD TOWN CENTRE DEVELOPMENT\nPLAN\nPURPOSE: To seek Council authorization to forward REZ #22-36 to a future\nPublic Hearing.\nREFERENCES\nAddress: Portion of 4567 Lougheed Highway\nLegal: Portion of Lot 1 District Lots 123 and 124 Group 1 New\nWestminster District Plan EPP31990 Except Plans EPP40171,\nEPP59173 and EPP108674\nApplicant: Shape Properties Corp.\n2020 One Bentall Centre, 505 Burrard Street\nVancouver, BC PO Box 206\nAttention: Patrick Hunter\nCurrent Zoning: CD Comprehensive Development District (based on C3, C3a\nGeneral Commercial District, P2 Administration and Assembly\nDistrict, RM4s, RM5s Multiple Family Residential District and\nBrentwood Town Centre Plan as guidelines)\nProposed Zoning: Amended CD Comprehensive Development District (based on C3\nGeneral Commercial District and Brentwood Town Centre Plan as\nguidelines and in accordance with the development plan entitled\n“The Amazing Brentwood Phase 2C-Tower 7” prepared by Arcadis\nArchitects (Canada) Inc.)\nRECOMMENDATIONS\nTHAT a Rezoning Bylaw for REZ #22-36 be prepared and advanced to First\nReading and to a Public Hearing at a future date, and;\nTHAT the following be established as prerequisites to the completion of the\nrezoning:\na. The submission of a suitable plan of development.\nSubject: REZ #22-36 – Commercial Rental Tower VII Brentwood Town Centre Development Plan\nOpen Council Meeting October 30, 2023 ...................................... Page 2\nb. The deposit of sufficient monies including a 4% Engineering\nAdministration Fee to cover the costs of all services necessary to serve\nthe site and the completion of a servicing agreement covering all requisite\nservices. All services are to be designed to City standards and constructed\nin accordance with the Engineering Design. One of the conditions for the\nrelease of occupancy permits will be the completion of all requisite\nservices.\nc. The installation of all electrical, telephone and cable servicing, and all\nother wiring underground throughout the development (as well as\nunderground switching and transformer/service boxes in town centre\nlocations), and to the point of connection to the existing service where\nsufficient facilities are available to serve the development.\nd. The submission of an undertaking to remove all existing improvements\nfrom the subject site within one year of Final Adoption.\ne. The dedication of any rights-of-way deemed requisite.\nf. The granting of any necessary statutory rights-of-way, easements and/or\ncovenants in accordance with Section 3.10 of this report.\ng. The submission of a suitable on-site Stormwater Management System,\nthe deposit of sufficient monies for its provision, and the granting of a\nSection 219 Covenant to guarantee its provision and continuing operation.\nh. Compliance with the City’s Groundwater Management for Multi-Family\nDevelopment guidelines.\ni. The submission of a geotechnical and groundwater study.\nj. The submission of a suitable Solid Waste and Recycling Plan.\nk. The review of on-site loading facilities.\nl. The provision of enhanced car wash stalls and an adequately sized and\nappropriately located garbage handling and recycling material holding\nspace and a commitment to implement the recycling provisions.\nm. The provision of facilities for cyclists in accordance with this report.\nn. The design and provision of units accessible to persons with disabilities,\nincluding the provision of customized hardware and cabinet work.\no. The design and provision of units adaptable to persons with disabilities,\nthe provision of customized hardware and cabinet work being subject to\nthe rental of the unit to a disabled person.\np. Compliance with Council-adopted sound criteria.\nSubject: REZ #22-36 – Commercial Rental Tower VII Brentwood Town Centre Development Plan\nOpen Council Meeting October 30, 2023 ...................................... Page 3\nq. Compliance with the guidelines for underground parking for visitors.\nr. The submission of a Green Building Plan and Energy Benchmarking.\ns. The submission of a detailed Comprehensive Sign Plan.\nt. The submission of a Site Disclosure Statement and resolution of any\nresultant conditions.\nu. The deposit of the applicable Parkland Acquisition Charge.\nv. The deposit of the applicable School Site Acquisition Charge.\nw. The deposit of the applicable GVS & DD Sewerage Charge.\nx. The deposit of the applicable Regional Water Cost Charge.\ny. The deposit of the applicable Regional Transportation Development Cost\nCharge.\nz. The submission of a written undertaking to distribute area plan notification\nforms, prepared by the City, with disclosure statements; and, to post area\nplan notification signs, also prepared by the City, on the development site\nand in the rental office in prominent and visible locations prior to Third\nReading, or at the time marketing for the subject development\ncommences, whichever is first, and remain posted for a period of one\nyear, or until such time that all units are rented, whichever is greater.\nCHIEF ADMINISTRATIVE OFFICER’S COMMENTS\nI concur with the recommendation of the General Manager Planning and Development.\nEXECUTIVE SUMMARY\nA rezoning application has been received in order to permit the construction of a high-\nrise commercial rental residential apartment building atop a commercial podium and\nunderground parking in accordance with the Brentwood Site Conceptual Master Plan\nand associated Development Guidelines (REZ #11-22). The purpose of this report is to\nprovide Council with information on the proposal and to recommend that the Rezoning\nBylaw be brought forward for First Reading and the rezoning application be forwarded\nto a future Public Hearing.\n1.0 POLICY SECTION\nThe proposed rezoning application is consistent with the following policies and plans\nadopted by Council:\n• Regional Context Statement (2013);\n• Corporate Strategic Plan (2022);\n• Official Community Plan (1998);\nSubject: REZ #22-36 – Commercial Rental Tower VII Brentwood Town Centre Development Plan\nOpen Council Meeting October 30, 2023 ...................................... Page 4\n• Brentwood Town Centre Development Plan (1996);\n• Economic Development Strategy (2007);\n• Social Sustainability Strategy (2011);\n• Environmental Sustainability Strategy (2016);\n• Climate Action Framework (2020);\n• Transportation Plan (2021);\n• Home Strategy (2021); and,\n• Rental Use Zoning Policy (2020).\n2.0 BACKGROUND\n2.1 On 2013 September 23, Council granted Final Adoption to REZ #11-22, which\nestablished the Brentwood Site Conceptual Master Plan and associated\nDevelopment Guidelines for phased mixed-use retail, office and multiple family\nredevelopment of The Amazing Brentwood (TAB) site in line with the adopted\nBrentwood Town Centre Development Plan. As a result, the site is zoned CD\nComprehensive Development District (based on the C3 and C3a General\nCommercial Districts, P2 Administration and Assembly District, RM4s Multiple\nFamily Residential District and RM5s Multiple Family Residential District as\nguidelines).\n2.2 The subject site is located on the southeast corner of Brentwood Boulevard and\nthe future Ridgelawn Drive in the interior of the TAB site, within the Council\nadopted Brentwood Town Centre Development Plan, and is designated for C3\nGeneral Commercial District, and the Brentwood Town Centre Development Plan\nas guidelines (see Attachment 1 – REZ #22-36: Sketch #1 and Sketch #2).The\nsite, approximately 5,407 m\n2\n(58,200 sq. ft.) in size (subject to legal survey), is\ncomprised of a portion of 4567 Lougheed Highway, the remainder parcel, and is\nidentified in the Brentwood Site Conceptual Master Plan for a commercial tower.\nThis portion of the remainder parcel is currently improved with TAB sales centre,\nin the former Zellers retail unit.\n2.3 On 2023 February 06, Council received an initial rezoning report which proposed\nto rezone the subject development site from its prevailing CD Comprehensive\nDevelopment District to an amended CD Comprehensive Development District.\nThe proposed rezoning is to CD Comprehensive Development District (based on\nC3 General Commercial District and Brentwood Town Centre Plan as guidelines).\nThe applicant has now submitted a plan of development suitable for presentation\nto a Public Hearing.\nSubject: REZ #22-36 – Commercial Rental Tower VII Brentwood Town Centre Development Plan\nOpen Council Meeting October 30, 2023 ...................................... Page 5\n3.0 GENERAL INFORMATION\n3.1 The proposed development plan for the subject site, as shown in Figure #1\nbelow, is for a single 56 storey high-rise commercial rental residential apartment\nbuilding with locally scaled commercial retail units fronting Brentwood Boulevard\nand Ridgelawn Drive over underground parking. The south façade will face a\npedestrian connection between Brentwood Boulevard and Ridgelawn Drive when\nthe existing indoor mall is replaced, and the north side of the site will be\ncompleted with construction of Ridgelawn Drive - both in subsequent phases of\nthe Master Plan.\nFigure #1 – Land Use and Tenure Diagram",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T19:27:38.530Z",
    "updateDate": "2024-02-05T19:27:38.530Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72948",
    "text": "Meeting October 30, 2023\nFile: REZ 22-09\nCOUNCIL REPORT\nTO: MAYOR & COUNCIL\nFROM: GENERAL MANAGER PLANNING AND DEVELOPMENT\nSUBJECT: REZ #22-09 – 5166 HALIFAX STREET – BRENTWOOD TOWN\nCENTRE DEVELOPMENT PLAN\nPURPOSE: To seek Council authorization to forward REZ #22-09 to a future Public\nHearing.\nREFERENCES\nAddress: 5166 Halifax Street\nLegal: Lot 44 District Lot 125 Group 1 New Westminster District Plan 33521\nApplicant: Amacon Construction Ltd.\n500 – 856 Homer Street\nVancouver, BC V6B 2W5\nAttn: Emerson Dohm\nCurrent: RM3 Multiple Family Residential\nProposed: CD Comprehensive Development District (based on RM4 Multiple Family\nResidential District, RM4r Multiple Family Residential District, and the\nBrentwood Town Centre Development Plan as guidelines and in\naccordance with the development plan entitled “Proposed Residential\nDevelopment, 5166 Halifax Street, Burnaby, BC” prepared by Chris\nDikeakos Architects Inc.)\nRECOMMENDATIONS\nTHAT the introduction of a Housing Agreement Bylaw be authorized according to\nthe terms outlined in Sections 3.2 and 3.8 of the report titled “5166 Halifax Street\n– Brentwood Town Centre Development Plan”, dated October 30, 2023\ncontingent upon the granting by Council of Second Reading of the Rezoning\nBylaw related to the subject site;\nTHAT the introduction of a Highway Closure Bylaw be authorized according to\nthe terms outlined in Section 3.12 of the report titled “5166 Halifax Street –\nBrentwood Town Centre Development Plan”, dated October 30, 2023, contingent\nupon the granting by Council of Second Reading of the subject Rezoning Bylaw;\nTHAT the sale be approved in principle of City-owned property for inclusion\nwithin the subject development site in accordance with the terms outlined in\nSection 3.12 of the report titled “titled “5166 Halifax Street – Brentwood Town\nCentre Development Plan”, dated October 30, 2023, subject to the applicant\npursuing the rezoning proposal to completion;\nTHAT a Rezoning Bylaw for REZ #22-09 be prepared and advanced to First\nReading and to a Public Hearing at a future date, and;\nTHAT the following be established as prerequisites to the completion of the\nrezoning:\na. The submission of a suitable plan of development.\nb. The deposit of sufficient monies including a 4% Engineering\nAdministration Fee to cover the costs of all services necessary to serve\nthe site and the completion of a servicing agreement covering all requisite\nservices. All services are to be designed to City standards and constructed\nin accordance with the Engineering Design. One of the conditions for the\nrelease of occupancy permits will be the completion of all requisite\nservices.\nc. The installation of all electrical, telephone and cable servicing, and all\nother wiring underground throughout the development (as well as\nunderground switching and transformer/service boxes in town centre\nlocations), and to the point of connection to the existing service where\nsufficient facilities are available to serve the development.\nd. The undergrounding of existing overhead wiring abutting the site.\ne. The removal of all existing improvements from the subject site prior to\nFinal Adoption of the Bylaw.\nf. Completion of Rezoning Reference #22-08 concurrent with completion of\nthe subject application.\ng. The completion of the Highway Closure Bylaw and sale of City property as\ndescribed in Section 3.12 of this report.\nh. The dedication of any rights-of-way deemed requisite.\ni. The granting of any necessary statutory rights-of-way, easements and/or\ncovenants in accordance with Section 3.13 of this report.\nj. The registration of a Housing Covenant and Housing Agreement.\nk. The submission of a suitable on-site Stormwater Management System,\nthe deposit of sufficient monies for its provision, and the granting of a\nSection 219 Covenant to guarantee its provision and continuing operation.\nl. Compliance with the City’s Groundwater Management for Multi-Family\nDevelopment guidelines.\nm. The submission of a geotechnical and groundwater study.\nn. The submission of a suitable Solid Waste and Recycling Plan.\no. The review of on-site loading facilities.\np. The provision of enhanced car wash stalls and an adequately sized and\nappropriately located garbage handling and recycling material holding\nspace and a commitment to implement the recycling provisions.\nq. The provision of facilities for cyclists in accordance with this report.\nr. The design and provision of units adaptable to persons with disabilities,\nthe provision of customized hardware and cabinet work being subject to\nthe sale of the unit to a disabled person.\ns. Compliance with Council-adopted sound criteria.\nt. Compliance with the guidelines for underground parking for visitors.\nu. The submission of a Green Building Plan and Energy Benchmarking.\nv. The deposit of the applicable Parkland Acquisition Charge.\nw. The deposit of the applicable School Site Acquisition Charge.\nx. The deposit of the applicable GVS & DD Sewerage Charge.\ny. The deposit of the applicable Regional Water Cost Charge.\nz. The deposit of the applicable Regional Transportation Development Cost\nCharge.\naa. The submission of a written undertaking to distribute area plan notification\nforms, prepared by the City, with disclosure statements; and, to post area\nplan notification signs, also prepared by the City, on the development site\nand in the sales office in prominent and visible locations prior to Third\nReading, or at the time marketing for the subject development\ncommences, whichever is first, and remain posted for a period of one\nyear, or until such time that all units are sold, whichever is greater.\nCHIEF ADMINISTRATIVE OFFICER’S COMMENTS\nI concur with the recommendation of the General Manager Planning and Development.\nEXECUTIVE SUMMARY\nA rezoning application has been received in order to permit the construction of two mid-rise residential buildings with underground parking. The purpose of this report is to provide Council with information on the proposal and to recommend that the Rezoning Bylaw be brought forward for First Reading and the rezoning application be forwarded to a future Public Hearing.\n1.0 POLICY SECTION\nThe proposed rezoning application is consistent with the following policies and plans adopted by Council:\n• Regional Context Statement (2013);\n• Corporate Strategic Plan (2022);\n• Official Community Plan (1998);\n• Brentwood Town Centre Development Plan (1996);\n• Economic Development Strategy (2007);\n• Social Sustainability Strategy (2011);\n• Environmental Sustainability Strategy (2016);\n• Climate Action Framework (2020);\n• Transportation Plan (2021);\n• Home Strategy (2021); and,\n• Rental Use Zoning Policy (2020).\n2.0 BACKGROUND\n2.1 On 2022 June 20, Council authorized staff to work with Amacon Development Corporation Inc., towards preparation of suitable plans of development for two development sites within the Brentwood Town Centre: the subject site, located at 5166 Halifax Street (Halifax Site) (see Attachment 1 – REZ #22-09: Sketch #1 and Sketch #2); and 2211 and 2271 Rosser Avenue (Rosser Site). Both sites are owned by the applicant.\n2.2 On 2022 August 31, Council approved a report seeking endorsement of a density transfer from the Halifax Site to the Rosser Site. A density transfer will facilitate the replacement of ageing rental units at the Halifax Site, as well as provide additional non-market and market rental units, while maintaining a scale of development that is in keeping with the intent of the Plan and adjacent developments. As outlined in that report, the construction of both sites will be phased, with the Rosser Site proceeding to occupancy prior to the redevelopment of the subject site (Halifax Site). This would provide the opportunity for residents of the Halifax Site to relocate to the Rosser Site on an interim basis, until the Halifax Site attains occupancy and their replacement rental units can be occupied.\n2.3 The subject site",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T18:56:28.633Z",
    "updateDate": "2024-02-05T18:56:28.633Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72955",
    "text": "Meeting October 30, 2023\nFile: REZ 22-08\nCOUNCIL REPORT\nTO: MAYOR & COUNCIL\nFROM: GENERAL MANAGER PLANNING AND DEVELOPMENT\nSUBJECT: REZ #22-08 - 2211 AND 2271 ROSSER AVENUE – BRENTWOOD\nTOWN CENTRE DEVELOPMENT PLAN\nPURPOSE: To seek Council authorization to forward REZ #22-08 to a future Public Hearing.\nREFERENCES\nAddress: 2211 and 2271 Rosser Avenue\nLegal: Lot 33 District Lot 119 Group 1 New Westminster District Plan 34764, and Lot 48 District Lot 119 Group 1 New Westminster District Plan 40447\nApplicant: Sean O’Flynn; Amacon Construction Ltd. (Representative)\nCurrent: M2 and M2r General Industrial District\nProposed: CD Comprehensive Development District (based on RM4 Multiple Family Residential District, RM4s Multiple Family Residential District, RM4r Multiple Family Residential District, C9 Urban Village Commercial District, C3 General Commercial District, and the Brentwood Town Centre Development Plan as guidelines and in accordance with the development plan entitled “Proposed Mixed Development 2211 & 2271 Rosser Avenue, Burnaby, BC” prepared by Chris Dikeakos Architects Inc.)\nRECOMMENDATIONS\nTHAT the introduction of a Housing Agreement Bylaw be authorized according to the terms outlined in Sections 3.2 and 3.9 of the report titled “REZ #22-08 – 2211 and 2271 Rosser Avenue – Brentwood Town Centre Development Plan” dated October 30, 2023, contingent upon the granting by Council of Second Reading of the Rezoning Bylaw related to the subject site;\nTHAT the introduction of a Highway Closure Bylaw be authorized according to the terms outlined in Section 3.14 of the report titled “REZ #22-08 – 2211 and 2271 Rosser Avenue – Brentwood Town Centre Development Plan” dated October 30, 2023, contingent upon the granting by Council of Second Reading of the subject Rezoning Bylaw;\nTHAT the sale be approved in principle of City-owned property for inclusion within the subject development site in accordance with the terms outlined in Section 3.14 of the report titled “REZ #22-08 – 2211 and 2271 Rosser Avenue – Brentwood Town Centre Development Plan” dated October 30, 2023, and subject to the applicant pursuing the rezoning proposal to completion;\nTHAT a Rezoning Bylaw be prepared and advanced to First Reading and to a Public Hearing at a future date, and;\nTHAT the following be established as prerequisites to the completion of the rezoning:\na. The submission of a suitable plan of development.\nb. The deposit of sufficient monies including a 4% Engineering Administration Fee to cover the costs of all services necessary to serve the site and the completion of a servicing agreement covering all requisite services. All services are to be designed to City standards and constructed in accordance with the Engineering Design. One of the conditions for the release of occupancy permits will be the completion of all requisite services.\nc. The installation of all electrical, telephone and cable servicing, and all other wiring underground throughout the development (as well as underground switching and transformer/service boxes in town centre locations), and to the point of connection to the existing service where sufficient facilities are available to serve the development.\nd. The undergrounding of existing overhead wiring abutting the site.\ne. The removal of all existing improvements from the subject site prior to Final Adoption of the Bylaw.\nf. Completion of Rezoning Reference #22-09 concurrent with or prior to completion of the subject application.\ng. The utilization of an amenity bonus through the provision of a cash in-lieu contribution in accordance with Section 3.7 of this report.\nh. The completion of the Highway Closure Bylaw and sale of City property as described in Section 3.14 of this report.\ni. The consolidation of the project site into one legal parcel.\nj. The dedication of any rights-of-way deemed requisite.\nk. The granting of any necessary statutory rights-of-way, easements and/or covenants in accordance with Section 3.15 of this report.\nl. The registration of a Housing Covenant and Housing Agreement.\nm. The submission of a suitable on-site Stormwater Management System, the deposit of sufficient monies for its provision, and the granting of a Section 219 Covenant to guarantee its provision and continuing operation.\nn. Compliance with the City’s Groundwater Management for Multi-Family Development guidelines.\no. The submission of a geotechnical and groundwater study.\np. The execution of an indemnity agreement by the developer saving the City harmless from all liability associated with this development in relation to its geotechnical and hydrological (including any potential contaminated groundwater) impacts to surrounding infrastructure and other nearby development.\nq. The submission of a suitable Solid Waste and Recycling Plan.\nr. The review of on-site loading facilities.\ns. The provision of enhanced car wash stalls and an adequately sized and appropriately located garbage handling and recycling material holding space and a commitment to implement the recycling provisions.\nt. The provision of facilities for cyclists in accordance with of this report.\nu. The design and provision of units adaptable to persons with disabilities, the provision of customized hardware and cabinet work being subject to the sale/lease of the unit to a disabled person.\nv. Compliance with Council-adopted sound criteria.\nw. Compliance with the guidelines for underground parking for visitors.\nx. The submission of a detailed Public Art Plan.\ny. The submission of a Green Building Plan and Energy Benchmarking.\nz. The submission of a detailed Comprehensive Sign Plan.\naa. The submission of a Site Disclosure Statement and resolution of any resultant conditions.\nbb. The deposit of the applicable Parkland Acquisition Charge.\ncc. The deposit of the applicable School Site Acquisition Charge.\ndd. The deposit of the applicable GVS & DD Sewerage Charge.\nee. The deposit of the applicable Regional Water Cost Charge.\nff. The deposit of the applicable Regional Transportation Development Cost Charge.\ngg. The submission of a written undertaking to distribute area plan notification forms, prepared by the City, with disclosure statements; and, to post area plan notification signs, also prepared by the City, on the development site and in the sales office in prominent and visible locations prior to Third Reading, or at the time marketing for the subject development commences, whichever is first, and remain posted for a period of one year, or until such time that all units are sold, whichever is greater.\nCHIEF ADMINISTRATIVE OFFICER’S COMMENTS\nI concur with the recommendation of the General Manager Planning and Development.\nEXECUTIVE SUMMARY\nA rezoning application has been received in order to permit the construction of a single high-rise residential building atop a residential and commercial podium with street-fronting commercial space and underground parking. The purpose of this report is to provide Council with information on the proposal and to recommend that the Rezoning Bylaw be brought forward for First Reading and the rezoning application be forwarded to a future Public Hearing.\n1.0 POLICY SECTION\nThe proposed rezoning application is consistent with the following policies and plans adopted by Council:\n• Regional Context Statement (2013);\n• Corporate Strategic Plan (2022);\n• Official Community Plan",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T18:55:48.397Z",
    "updateDate": "2024-02-05T18:55:48.397Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72959",
    "text": "Meeting October 30, 2023\nFile: 49500 02 REZ #22-06\nCOUNCIL REPORT\nTO: MAYOR & COUNCIL\nFROM: GENERAL MANAGER PLANNING AND DEVELOPMENT\nSUBJECT: REZ #22-06 – 4141 LOUGHEED HIGHWAY – BRENTWOOD TOWN\nCENTRE DEVELOPMENT PLAN\nPURPOSE: To seek Council authorization to forward REZ #22-06 to a future\nPublic Hearing.\nREFERENCES\nAddress: 4141 Lougheed Highway\nLegal: Lot 21 District Lot 119 Group 1 New Westminster District Plan\n25896\nApplicant: Adam Nour, Millennium Properties Ltd.\n788 Richards Street, Vancouver, BC V6B 3A4\nCurrent Zoning: M1 Manufacturing District.\nProposed Zoning: CD Comprehensive Development District (based on RM5s Multiple\nFamily Residential District, RM5r Multiple Family Residential\nDistrict, C3 General Commercial District and the Brentwood Town\nCentre Development Plan as guidelines, and in accordance with\nthe development plan entitled “4141 Lougheed Hwy Mixed Use\nDevelopment” prepared by FaulknerBrowns Architects)\nRECOMMENDATIONS\nTHAT a Rezoning Bylaw for REZ #22-06 be prepared and advanced to First\nReading and to a Public Hearing at a future date;\nTHAT the introduction of a Housing Agreement Bylaw be authorized according to\nthe terms outlined in Sections 3.4 and 3.12 of the report titled “REZ #22-06 –\n4141 Lougheed Highway – Brentwood Town Centre Development Plan” dated\nOctober 30, 2023, contingent upon the granting by Council of Second Reading of\nthe Rezoning Bylaw related to the subject site;\nTHAT the introduction of a Highway Closure Bylaw be authorized according to the\nterms outlined in Section 3.9 of the report titled “REZ #22-06 – 4141 Lougheed\nHighway – Brentwood Town Centre Development Plan” dated October 30, 2023,\ncontingent upon the granting by Council of Second Reading of the subject\nRezoning Bylaw;\nTHAT the sale be approved in principle of City-owned property for inclusion within\nthe subject development site in accordance with the terms outlined in Section 3.9\nof the report titled “REZ #22-06 – 4141 Lougheed Highway – Brentwood Town\nCentre Development Plan” dated October 30, 2023, and subject to the applicant\npursuing the rezoning proposal to completion, and;\nTHAT the following be established as prerequisites to the completion of the\nrezoning:\na. The submission of a suitable plan of development.\nb. The deposit of sufficient monies including a 4% Engineering\nAdministration Fee to cover the costs of all services necessary to serve\nthe site and the completion of a servicing agreement covering all requisite\nservices. All services are to be designed to City standards and constructed\nin accordance with the Engineering Design. One of the conditions for the\nrelease of occupancy permits will be the completion of all requisite\nservices.\nc. The installation of all electrical, telephone and cable servicing, and all\nother wiring underground throughout the development (as well as\nunderground switching and transformer/service boxes in town centre\nlocations), and to the point of connection to the existing service where\nsufficient facilities are available to serve the development.\nd. The undergrounding of overhead wiring abutting the site.\ne. The submission of an undertaking to remove all existing improvements\nfrom the subject site within one year of Final Adoption.\nf. The utilization of an amenity bonus through the provision of a cash in-lieu\ncontribution in accordance with Section 3.3 of this report.\ng. The completion of the Highway Closure Bylaw and sale of City property as\ndescribed in Section 3.9 of this report.\nh. The consolidation of the project site into one legal parcel.\ni. The dedication of any rights-of-way deemed requisite.\nj. The granting of any necessary statutory rights-of-way, easements and/or\ncovenants in accordance with Section 3.11 of this report.\nk. The registration of a Housing Covenant and Housing Agreement.\nl. The submission of a suitable on-site Stormwater Management System,\nthe deposit of sufficient monies for its provision, and the granting of a\nSection 219 Covenant to guarantee its provision and continuing operation.\nm. Compliance with the City’s Groundwater Management for Multi-Family\nDevelopment guidelines.\nn. The submission of a geotechnical and groundwater study.\no. The submission of a wind study.\np. The execution of an indemnity agreement by the developer saving the City\nharmless from all liability associated with this development in relation to its\ngeotechnical and hydrological (including any potential contaminated\ngroundwater) impacts to surrounding infrastructure and other nearby\ndevelopment.\nq. The submission of a suitable Solid Waste and Recycling Plan.\nr. The review of on-site loading facilities.\ns. The provision of enhanced car wash facilities and an adequately sized and\nappropriately located garbage handling and recycling material holding\nspace and a commitment to implement the recycling provisions.\nt. The provision of facilities for cyclists in accordance with this report.\nu. The design and provision of units adaptable to persons with disabilities,\nthe provision of customized hardware and cabinet work being subject to\nthe sale or lease of the unit to a disabled person.\nv. Compliance with Council-adopted sound criteria.\nw. Compliance with the guidelines for underground parking for visitors.\nx. The submission of a detailed Public Art Plan.\ny. The submission of a Green Building Plan and Energy Benchmarking.\nz. The submission of a detailed Comprehensive Sign Plan.\naa. The submission of a Site Disclosure Statement and resolution of any\nresultant conditions.\nbb. The deposit of the applicable Parkland Acquisition Charge.\ncc. The deposit of the applicable School Site Acquisition Charge.\ndd. The deposit of the applicable GVS & DD Sewerage Charge.\nee. The deposit of the applicable Regional Water Cost Charge.\nff. The deposit of the applicable Regional Transportation Development Cost\nCharge.\ngg. The submission of a written undertaking to distribute area plan notification\nforms, prepared by the City, with disclosure statements; and, to post area\nplan notification signs, also prepared by the City, on the development site\nand in the sales office in prominent and visible locations prior to Third\nReading, or at the time marketing for the subject development\ncommences, whichever is first, and remain posted for a period of one\nyear, or until such time that all units are sold, whichever is greater.\nCHIEF",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T18:55:01.484Z",
    "updateDate": "2024-02-05T18:55:01.484Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72944",
    "text": "Meeting October 30, 2023\nFile: 49500 20 REZ 21-16\nCOUNCIL REPORT\nTO: MAYOR & COUNCIL\nFROM: GENERAL MANAGER PLANNING AND DEVELOPMENT\nSUBJECT: REZ #21-16 – 5292 AND 5318 KINGSWAY– MIXED USE\nDEVELOPMENT – ROYAL OAK COMMUNITY PLAN\nPURPOSE: To seek Council authorization to forward REZ #21-16 to a future\nPublic Hearing.\nREFERENCES\nAddress: 5292 and 5318 Kingsway\nLegal: WEST 50 FEET BLOCK 4 DISTRICT LOT 94 GROUP 1 NEW\nWESTMINSTER DISTRICT PLAN 720\nLOT 8 EXCEPT: THE WEST 50 FEET; DISTRICT LOT 94 GROUP\n1 NEW WESTMINSTER DISTRICT PLAN 720\nLOT 1 DISTRICT LOT 94 GROUP 1 NEW WESTMINSTER\nDISTRICT PLAN 6178\nApplicant: Porte Communities\n100 – 33 East 8\nAvenue\nVancouver, BC V5T 1R5\nAttention: Tony Zhang\nCurrent Zoning: C4 Service Commercial District\nProposed Zoning: Comprehensive Development District (based on C9 Urban Village\nDistrict and Royal Oak Community Plan as guidelines, and in\naccordance with the development plan entitled “Roi and Reine”\nprepared by RH Architects Inc.)\nRECOMMENDATIONS\nTHAT a Rezoning Bylaw for REZ #21-16 be prepared and advanced to First\nReading and to a Public Hearing at a future date of Council;\nTHAT the introduction of a Housing Agreement Bylaw be authorized according to\nthe terms outlined in Section 3.3 of the report titled “REZ #21-16 – 5292 and\n5318 Kingsway – Mixed Use Development – Royal Oak Community Plan” dated\nOctober 30, 2023, contingent upon the granting by Council of Second Reading of\nthe subject Rezoning Bylaw;\nTHAT the introduction of a Highway Closure Bylaw be authorized, as described\nin Section 3.10 of the report titled “REZ #21-16 – 5292 and 5318 Kingsway –\nMixed Use Development – Royal Oak Community Plan” dated October 30, 2023,\ncontingent upon the granting by Council of Second Reading of the subject\nRezoning Bylaw;\nTHAT the sale be approved in principle of City-owned property for inclusion\nwithin the subject development site in accordance with the terms outlined in\nSection 3.10 of the report titled “REZ #21-16 – 5292 and 5318 Kingsway – Mixed\nUse Development – Royal Oak Community Plan”, and subject to the applicant\npursuing the rezoning proposal to completion, and;\nTHAT the following be established as prerequisites to the completion of the\nrezoning:\na. The submission of a suitable plan of development.\nb. The deposit of sufficient monies, including a 4% Engineering Inspection\nFee, to cover the costs of all services necessary to serve the site and the\ncompletion of a servicing agreement covering all requisite services. All\nservices are to be designed to City standards and constructed in\naccordance with the Engineering Design. One of the conditions for the\nrelease of occupancy permits will be the completion of all requisite services.\nc. The installation of all electrical, telephone and cable servicing, and all other\nwiring underground throughout the development, and to the point of\nconnection to the existing service where sufficient facilities are available to\nserve the development.\nd. The consolidation of the net project site into one legal parcel.\ne. The completion of the Highway Closure Bylaw and sale of City property.\nf. The submission of an undertaking to remove all existing improvements from\nthe site within 12 months of Final Adoption of the rezoning.\ng. The registration of a Housing Agreement and Housing Covenant.\nh. The submission of a suitable on-site stormwater management system to the\napproval of the General Manager Engineering, the submission of sufficient\nmonies for its provision, and the granting of a Section 219 Covenant to\nguarantee its provision and continuing operation.\ni. Compliance with the City’s Groundwater Management for Multiple-Family\nDevelopment guidelines.\nj. The dedication of any rights-of-way deemed requisite.\nk. The granting of any necessary statutory rights-of-way, easements and/or\ncovenants.\nl. The provision of facilities for cyclists in accordance with this report.\nm. The submission of a suitable Solid Waste and Recycling plan.\nn. The review of on-site loading facilities.\no. The provision of one covered car wash stall and an adequately sized and\nappropriately located garbage handling and recycling material holding space\nand a commitment to implement the recycling provisions.\np. The design and provision of units adaptable to persons with disabilities, the\nprovision of customized hardware and cabinet work being subject to the\nlease of the unit to a disabled person and with allocated disabled parking\nspaces.\nq. Compliance with Council-adopted sound criteria.\nr. Compliance with the guidelines for underground parking for visitors.\ns. The undergrounding of existing overhead wiring abutting the site.\nt. The submission of a Green Building Plan and Energy Benchmarking.\nu. The submission of a detailed Comprehensive Sign Plan.\nv. The provision of a statutory right-of-way for a public pathway from Kingsway\nto Grimmer Street, to the approval of the General Manager Engineering.\nw. The deposit of the applicable Parkland Acquisition Charge.\nx. The deposit of the applicable GVS & DD Sewerage Charge.\ny. The deposit of the applicable School Site Acquisition Charge.\nz. The deposit of the applicable Water Development Cost Charge.\naa. The deposit of the applicable Regional Transportation Development Cost\nCharge.\nbb. Submission of a written undertaking to distribute area plan notification\nforms, prepared by the City, with disclosure statements, and post area plan\nnotification signs, also prepared by the City, on the development site and in\nthe sales office in prominent and visible locations prior to Third Reading, or\nat the time marketing for the subject development commences, whichever is\nfirst, and remain posted for a period of one year, or until such time that all\nunits are sold, whichever is greater.\nCHIEF ADMINISTRATIVE OFFICER’S COMMENTS\nI concur with the recommendation of the General Manager Planning and Development.\nEXECUTIVE SUMMARY\nA rezoning application has been received to permit the construction of mixed-use\ndevelopment above underground parking. The development is comprised of two six-\nstorey mixed-use buildings with commercial uses at grade and 85 residential units\nabove (75 strata units and 10 non-market rental units), connected by an exterior\namenity area on Level 2. The purpose of this report is to provide Council with\ninformation on the proposal and to recommend that the Rezoning Bylaw be brought\nforward for First Reading and that it be forwarded to a future Public Hearing.\n1.0 POLICY SECTION\nThe proposed rezoning application is consistent with the following policies and plans\nadopted by Council:\n• Corporate Strategic Plan (2022),\n• Regional Context Statement (2013),\n• Official Community Plan (1998),\n• Royal Oak Community Plan (1999),\n• Economic Development Strategy (2007),\n• Social Sustainability Strategy (2011),\n• Environmental Sustainability Strategy (2016),\n• Transportation Plan (2021),\n• HOME: Housing and Homelessness Strategy (2021) and,\n• Rental Use Zoning Policy (2020).\n2.0 BACKGROUND\n2.1 The subject development site is located along Kingsway and Grimmer Street,\neast of Royal Oak Avenue, and is designated in the Royal Oak Community Plan\nfor medium density mixed-use development (see Attachment 1 – REZ #21-16:\nSketch #1 and Sketch #2). The subject site is comprised of two lots which are\nimproved with a single storey car wash facility.\n2.2 On June 14, 2021, Council received an initial rezoning report which proposed to\nrezone the site from the Service Commercial District to the CD Comprehensive\nDevelopment District, utilizing the C9 Urban Village District and Royal Oak\nCommunity Plan as guidelines.\nIn June 2023, the City began consultation on\nPhase 1 (Preliminary visioning, goals and plan directions) of the Royal Oak\nCommunity Plan update. The applicant has acknowledged that the Plan update\n",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T18:54:23.603Z",
    "updateDate": "2024-02-05T18:54:23.603Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=73390",
    "text": "Meeting December 11, 2023\nFile: 49500 20 REZ #20-09\nCOUNCIL REPORT\nTO: MAYOR & COUNCIL\nFROM: GENERAL MANAGER PLANNING AND DEVELOPMENT\nSUBJECT: REZ #20-09 – 3777 AND 3791 KINGSWAY – HIGH DENSITY\nMIXED-USE DEVELOPMENT\nPURPOSE: To seek Council authorization to forward this application to First\nReading and to a future Public Hearing date, if necessary.\nREFERENCES\nAddress: 3777 and 3791 Kingsway\nLegal: Lot “A” (X75108) District Lots 35 and 151 Group 1 New\nWestminster District Plan 51937\nLot 199 District Lots 35 and 151 Group 1 New Westminster District\nPlan 47944\nApplicant: Matthew Kingston\n3777 and 3791 Kingsway Portfolio Inc., No. A67716 and A011057\n500 – 3625 Dufferin Street, Toronto, Ontario M3K 1N4\nCurrent Zoning: CD Comprehensive Development District (C3 General Commercial\nDistrict) and CD Comprehensive Development District (C6a\nGasoline Service Station District and P8 Parking District), and\nMetrotown Downtown Plan as guidelines\nProposed Zoning: Amended CD Comprehensive Development District (RM4s and\nRM4r Multiple Family Residential District, C3 General Commercial\nDistrict, Metrotown Downtown Plan as guidelines, and in\naccordance with the development plan entitled “Central Park\nCommons” prepared by Arcadis\nRECOMMENDATIONS\nTHAT the introduction of a Housing Agreement Bylaw be authorized according to\nthe terms outlined in Section 3.7 of this report by the General Manager Planning\nand Development, Rezoning Reference #20-09 dated December 11, 2023,\ncontingent upon the granting by Council of Second Reading of the subject\nRezoning Bylaw;\nTHAT a Rezoning Bylaw be prepared and advanced to First Reading and to a\nPublic Hearing (if necessary) at a future date of Council; and\nSubject: REZ #20-09 – 3777 and 3791 Kingsway -\nHigh Density Mixed-Use Development\nOpen Council Meeting December 11, 2023 .................................. Page 2\nTHAT the following be established as prerequisites to the completion of the\nrezoning:\na) The submission of a suitable plan of development.\nb) The deposit of sufficient monies including a 4% Engineering Administration\nFee to cover the costs of all services necessary to serve the site and the\ncompletion of a servicing agreement covering all requisite services. All\nservices are to be designed to City standards and constructed in\naccordance with the Engineering Design. One of the conditions for the\nrelease of occupancy permits will be the completion of all requisite services.\nc) The installation of all electrical, telephone and cable servicing, and all other\nwiring underground throughout the development (as well as underground\nswitching and transformer/service boxes in town centre locations), and to\nthe point of connection to the existing service where sufficient facilities are\navailable to serve the development.\nd) The undergrounding of existing overhead wiring abutting the site.\ne) The subdivision of the net project site into three distinct parcels.\nf) The utilization of an amenity bonus through the provision of a cash in-lieu\ncontribution in accordance with Section’s 3.6 and 3.7 of this report.\ng) The dedication of any rights-of-way deemed requisite.\nh) The granting of any necessary statutory rights-of-way, easements and/or\ncovenants in accordance with Section 3.13 of this report.\ni) The registration of a Housing Agreement and Housing Covenant.\nj) The submission of a suitable on-site stormwater management system, the\ndeposit of sufficient monies for its provision, and the granting of a Section\n219 Covenant to guarantee its provision and continuing operation.\nk) The submission of a Phasing and Construction Management Plan.\nl) The submission of a Site Disclosure Statement.\nm) Compliance with the City’s Groundwater Management for Multi-Family\nDevelopment guidelines.\nSubject: REZ #20-09 – 3777 and 3791 Kingsway -\nHigh Density Mixed-Use Development\nOpen Council Meeting December 11, 2023 .................................. Page 3\nn) The submission of a suitable Solid Waste and Recycling plan.\no) The review of on-site residential loading facilities.\np) The provision of car wash stalls and an adequately sized and appropriately\nlocated garbage handling and recycling material holding space and a\ncommitment to implement the recycling provisions.\nq) The provision of facilities for cyclists in accordance with this report.\nr) The design and provision of units adaptable to persons with disabilities, the\nprovision of customized hardware and cabinet work being subject to the\nsale/lease of the unit to a disabled person and with allocated disabled\nparking spaces.\ns) Compliance with Council-adopted sound criteria.\nt) Compliance with the guidelines for underground parking for visitors.\nu) The submission of a Public Art Plan.\nv) The submission of a Green Building Plan and Energy Benchmarking.\nw) The submission of a detailed Master Sign Plan.\nx) The deposit of the applicable Parkland Acquisition Charge.\ny) The deposit of the applicable School Site Acquisition Charge.\nz) The deposit of the applicable Water Development Cost Charge.\naa) The deposit of the applicable Metrotown Public Open Space Charge.\nbb) The deposit of the proportionate contribution to grade-separated crossings\nof the BC Parkway.\ncc) The deposit of the applicable GVS & DD Sewerage Charge.\ndd) The deposit of the applicable Regional Transportation Development Cost\nCharge.\nSubject: REZ #20-09 – 3777 and 3791 Kingsway -\nHigh Density Mixed-Use Development\nOpen Council Meeting December 11, 2023 .................................. Page 4\nee) The submission of a written undertaking to distribute area plan notification\nforms, prepared by the City, with disclosure statements; and, to post area\nplan notification signs, also prepared by the City, on the development site\nand in the sales or rental office in prominent and visible locations prior to\nThird Reading, or at the time marketing for the subject development\ncommences, whichever is first, and remain posted for a period of one year,\nor until such time that all units are sold, whichever is greater.\nCHIEF ADMINISTRATIVE OFFICER’S COMMENTS\nI concur with the recommendation of the General Manager Planning and Development.\nEXECUTIVE SUMMARY\nA rezoning application has been received to permit the construction of a high-density\nmixed-use development above underground parking. The development will be\ncompleted in two primary phases. Phase 1 (Kingsway South), fronting Kingsway, will be\ncomprised of two high-rise market rental apartment buildings above ground-level\ncommercial retail units, and also includes the retrofit and retention of the existing office\nbuilding at 3777 Kingsway, commonly known as ‘The Boot’. Phase 2 (Boundary North),\nfronting Boundary, will be comprised of three high-rise residential strata buildings, one\nof which will contain the requisite inclusionary non-market rental units, above a four-\nstorey commercial and amenity podium. The purpose of this report is to provide Council\nwith information on the proposal, and to recommend that the rezoning application be\nforwarded to First Reading and a future Public Hearing, if necessary.\n1.0 POLICY SECTION\nThe proposed rezoning application is consistent with the following policies and plans\nadopted by Council:\n• Corporate Strategic Plan (2022),\n• Regional Context Statement (2013),\n• Official Community Plan (1998),\n• Metrotown Downtown Plan (2017),\n• Economic Development Strategy (2007),\n• Social Sustainability Strategy (2016),\n• Transportation Plan (2021),\n• HOME: Housing and Homelessness Strategy (2021), and\n• Rental Use",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T18:30:50.312Z",
    "updateDate": "2024-02-05T18:30:50.312Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr10.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Nick Danford\nContact No.: 604.871.6121\nRTS No.: 15751\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 848 Seymour Street\nRECOMMENDATION TO REFER\nTHAT the rezoning application and plans, described below, be referred to Public Hearing\ntogether with the recommendations set out below and with the recommendation of the General\nManager of Planning, Urban Design and Sustainability to approve the application, subject to the\nconditions set out below;\nFURTHER THAT the Director of Legal Services be instructed to prepare the necessary by-laws,\nin accordance with the recommendations set out below, for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by Perkins & Will, on behalf of Paul Y. Construction (B.C.)\nLTD., Inc.\n, the registered owner of the lands located at 848 Seymour Street [Lots\n7 to 10 and the north ½ of Lot 11 all of Block 64 District Lot 541 Plan 210; PIDs\n005-333-849, 005-333-865, 005-333-873, 005-333-911, 005-334-144,\nrespectively] to rezone the lands from DD (Downtown) District to CD-1\n(Comprehensive Development) District, to increase the maximum floor space\nratio (FSR) from 5.75 to 17.67 and the maximum building height from 91.4 m\n(300 ft.) to 97.7 m (321 ft.), to permit the development of a 30-storey hotel, be\napproved in principle;\nFURTHER THAT the draft CD-1 By-law, prepared for the Public Hearing in\naccordance with Appendix A, be approved in principle;\nFURTHER THAT the proposed form of development also be approved in\nprinciple, generally as prepared by Perkins & Will, received June 24, 2022,\nprovided that the Director of Planning may allow minor alterations to this form of\ndevelopment when approving the detailed scheme of development;\nAND FURTHER THAT the above approvals be subject to the Conditions of\nApproval contained in Appendix B.\nB. That subject to approval of the CD-1 By-law, the application to amend the Sign\nBy-law to establish regulations for the new CD-1, generally as set out in\nAppendix C, be approved;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the\namendment to the Sign By-law at the time of enactment of the CD-1 By-law.\nC. THAT subject to approval of the CD-1 By-law, the Noise Control By-law be\namended to include the CD-1, generally as set out in Appendix C;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the\namendment to the Noise Control By-law at the time of enactment of the CD-1\nBy-law.\nD. THAT Recommendations A and C be adopted on the following conditions:\n(i) T HAT the passage of the above resolutions creates no legal rights for the\napplicant or any other person, or obligation on the part of the City, and\nany expenditure of funds or incurring of costs is at the risk of the person\nmaking the expenditure or incurring the cost;\n(ii) T HAT any approval that may be granted following the Public Hearing shall\nnot obligate the City to enact a by-law rezoning the property, and any\ncosts incurred in fulfilling requirements imposed as a condition of\nrezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not\nin any way be limited or directed in the exercise of their authority or\ndiscretion, regardless of when they are called upon to exercise such\nauthority or discretion.\nREPORT SUMMARY\nThis report evaluates an application to rezone the property at 848 Seymour Street to a CD-1\n(Comprehensive Development) District to permit the development of a hotel.\nStaff have assessed the application and conclude that it meets the intent of the Rezoning Policy\nfor the Central Business District (CBD) and CBD Shoulder and the Metro Core Jobs and\nEconomy Land Use Plan. Staff support the application, subject to design development and other\nconditions. Staff recommend that the application be referred to a public hearing, with the\nrecommendation of the General Manager of Planning, Urban Design and Sustainability to\napprove it in principle, subject to the public hearing, and conditions contained in Appendix B.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n• Vancouver Plan (2022)\n• Rezoning Policy for the Central Business District (CBD) and CBD Shoulder (2009)\n• Metro Core Jobs and Economy Land Use Plan (2007)\n• Interim Hotel Development Policy (2018)\n• Employment Lands and Economy Review: Phase 2 (2020)\n• Granville Street Interim Rezoning Policy (2023)\n• Downtown Official Development Plan (1975, last amended 2022)\n• Downtown (Except Downtown South) Design Guidelines (1975, amended 1993)\n• (DD) Downtown District Schedule (1975, last amended 2022)\n• Green Buildings Policy for Rezonings (2010, last amended 2023)\n• Community Amenity Contributions Policy for Rezonings (1999, last amended 2023)\n• View Protection Guidelines (1989, last amended 2022)\n• Latecomer Policy (2021)\n• Vancouver Development Cost Levy By-law No. 9755\n• Vancouver Utilities Development Cost Levy By-law No. 12183\n• Public Art Policy and Procedures for Rezoned Developments (2014, last amended 2021)\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site is located on Seymour Street, mid-block between Robson and Smithe streets\n(see Figure 1). The site is comprised of four parcels containing a surface parking lot. The site\nsize is 1,253.1 sq. m (13,488 sq. ft.), with a frontage of 34.4 m (113 ft.) along Seymour Street\nand a depth of 36.6 m (120 ft.).\nFigure 1: Location Map – Site and Context\nCD-1 Rezoning: 848 Seymour Street – RTS 15751 4\nThe site is located in the Central Business District (CBD) and surrounding sites contain\nresidential, commercial and arts, culture and entertainment uses. Nearby developments range\nin height from five to 43 storeys, with three residential towers on this block.\nNeighbourhood Amenities – The following amenities are within close proximity:\n• Parks - sθ əqəlxenəm ts'exwts'áxwi7 (Rainbow) Park and Robson Square are\napproximately 300 m away.\n• Cultural/Community Spaces – Orpheum Theatre, Vancouver Library (Central Branch),\nBC Place Stadium/Rogers Arena and Vancouver Art Gallery/Robson Square are within\n500 m of the site.\n• Public and Active Transportation – City Centre and Granville Street skytrain stations\nare located within 350 m of the site. Nearby bicycle routes are located on Richards,\nSmithe and Dunsmuir streets.\n2. Policy Context\nVancouver Plan – The Vancouver Plan was approved by Council on July 22, 2022 and is a\nland use strategy to guide long-term growth of the City over the next 30 years. The approved\nVancouver Plan will serve as a framework with further implementation planning work to follow\nover the next two to four years.\nMetro Core Jobs and Economy Land Use Plan (the ‘Metro Core Plan’) – The Metro Core\nPlan identified a shortfall of job space and put forth zoning amendments and policy changes to\nmeet 30-year economic growth needs. The subject site is located in the CBD of the Metro Core\nPlan which sets out policy directions to increase opportunities for new hotels, office, restaurants,\nretail, cultural venues and other business support services.\nRezoning Policy for the Central Business District (CBD) and CBD Shoulder (the ‘CBD\nRezoning Policy’) – Based on directions set out in the Metro Core Plan, the CBD Rezoning\nPolicy was approved to consider additional height and density for non-residential uses in the\ndowntown area. The policy permits intensification of land uses to meet the demand for job\nspace and improve the economic climate, while limiting new residential uses. The application is\nlocated in the CBD Shoulder Area (C3) of the CBD Rezoning Policy, this area allows for\nconsideration of both residential and non-residential uses.\nDowntown Official Development Plan (the ‘DODP’) – The DODP is the foundational\ndevelopment policy in the downtown core. The CBD Rezoning Policy allows for consideration of\nadditional height and density for qualifying applications, building massing, pedestrian realm\ninterface, public open space, solar access, and other urban development considerations are\ngoverned by the DODP.\nDowntown (Except Downtown South) Design Guidelines (the ‘Guidelines’) – The\nGuidelines are supplemental to the DODP, and provide staff and applicants further guidance",
    "maxPages": 4,
    "type": "text",
    "createDate": "2024-02-05T05:03:35.045Z",
    "updateDate": "2024-02-05T05:03:35.045Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr9.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Nick Danford\nContact No.: 604.871.6121\nRTS No.: 15906\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 4330-4408 Arbutus Street and 2092 Nanton Avenue\nRECOMMENDATION TO REFER\nTHAT the rezoning application and plans, described below, be referred to Public Hearing\ntogether with the recommendations set out below and with the recommendation of the General\nManager of Planning, Urban Design and Sustainability to approve the application, subject to the\nconditions set out below;\nFURTHER THAT the Director of Legal Services be instructed to prepare the necessary by-law,\nin accordance with the recommendations set out below, for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by Marcon Developments Ltd., on behalf of Amica Arbutus\nNanton Seniors Inc., the registered owner of the lands located at 4330-4408\nArbutus Street and 2092 Nanton Avenue [Lots 6 to 11 of Block 88 District Lot 526\nPlan 11644; PIDs 008-999-902, 008-999-929, 008-999-945, 008-999-961,\n007-922-477, 008-999-988, respectively] to rezone the lands from R1-1\n(Residential Inclusive) District to CD-1 (Comprehensive Development) District, to\nincrease the maximum floor space ratio (FSR) from 0.70 to 3.87 and the\nmaximum building height from 11.5 m (37.7 ft.) to 27.5 m (90 ft.) and to 31.5 m\n(103 ft.) for the portion with rooftop amenity, to permit the development of a six-\nstorey, 162-unit Community Care Facility – Class B, be approved in principle;\nFURTHER THAT the draft CD-1 By-law, prepared for the Public Hearing in\naccordance with Appendix A, be approved in principle;\nFURTHER THAT the proposed form of development also be approved in\nprinciple, generally as prepared by Shift Architecture, received August 10, 2022,\nprovided that the Director of Planning may allow minor alterations to this form of\ndevelopment when approving the detailed scheme of development;\nAND FURTHER THAT the above approvals be subject to the Conditions of\nApproval contained in Appendix B.\nB. That subject to approval of the CD-1 By-law, the Subdivision By-law be\namended, generally as set out in Appendix C;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the\namendment to the Subdivision By-law at the time of enactment of the CD-1\nBy-law.\nC. THAT Recommendations A and B be adopted on the following conditions:\n(i) T HAT the passage of the above resolutions creates no legal rights for the\napplicant or any other person, or obligation on the part of the City, and\nany expenditure of funds or incurring of costs is at the risk of the person\nmaking the expenditure or incurring the cost;\n(ii) T HAT any approval that may be granted following the Public Hearing shall\nnot obligate the City to enact a by-law rezoning the property, and any\ncosts incurred in fulfilling requirements imposed as a condition of\nrezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not\nin any way be limited or directed in the exercise of their authority or\ndiscretion, regardless of when they are called upon to exercise such\nauthority or discretion.\nREPORT SUMMARY\nThis report evaluates an application to rezone the properties at 4330-4408 Arbutus Street and\n2092 Nanton Avenue to a CD-1 (Comprehensive Development) District to permit the\ndevelopment of a Community Care Facility, intended for seniors.\nStaff have assessed the application and conclude that it meets the intent of the Vancouver Plan\nand Arbutus Ridge/Kerrisdale/Shaughnessy Community Vision. Staff support the application,\nsubject to design development and other conditions. Staff recommend that the application be\nreferred to a public hearing, with the recommendation of the General Manager of Planning,\nUrban Design and Sustainability to approve it in principle, subject to the public hearing, and\nconditions contained in Appendix B.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n• Vancouver Plan (2022)\n• Arbutus Ridge, Kerrisdale and Shaughnessy Community Vision (2005)\n• Community Care Facility – Class B and Group Residence Guidelines (2008, last\namended 2019)\n• Secured Market Rental Policy (2012, last amended 2023)\n• Green Buildings Policy for Rezonings (2010, last amended 2023)\n• Latecomer Policy (2021)\n• Community Amenity Contributions Policy for Rezonings (1999, last amended 2023)\n• Vancouver Development Cost Levy By-law No. 9755\n• Vancouver Utilities Development Cost Levy By-law No. 12183\n• Urban Forest Strategy (2014, amended 2018)\n• Public Art Policy and Procedures for Rezoned Developments (2014, last amended 2021)\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site is located at the south-east corner of Nanton Avenue and Arbutus Street in the\nArbutus Ridge neighborhood (see Figure 1). The site is comprised of six parcels, each\ndeveloped with a detached house. There are no tenancies on the site eligible under the Tenant\nRelocation and Protection Policy (TRPP), which extends coverage to rental tenants. As such, a\nTenant Relocation Plan is not required. The site size is 3,969.3 sq. m (42,725 sq. ft.), with a\nfrontage of 108.6 m (356 ft.) along Arbutus Street and a depth of 36.5 m (120 ft.) along Nanton\nAvenue.\nFigure 1: Location Map – Site and Context\nThe site is currently regulated by the R1-1 District Schedule, which allows for a maximum\ndensity of 0.70 FSR. The properties to the east are zoned R1-1 and are generally detached\nhouses. The sites to the north and west are zoned CD-1 and are developed with a seven and\neight storey mixed-use development, a townhouse development and the Arbutus Club which is\na private recreation centre. Single detached houses are located to the south and east of the\nsubject site.\nProperties along Arbutus Street are eligible for rezoning consideration under the Secured\nMarket Rental Policy (SRP) for rental residential developments up to six-storeys. Properties to\nthe east on Maple Street are eligible under the SRP for consideration rental developments up to\nfour-storeys.\nNeighbourhood Amenities – The following amenities are within close proximity:\n• Parks – Arbutus Greenway, Prince of Wales Park and Quilchena Park are all within\n500 m of the site.\n• Cultural/Community Spaces – St. George’s Greek Orthodox Church and Arbutus,\nShaughnessy, Kerrisdale (ASK) Friendship Centre (Adult Day Care and Neighbourhood\nHouse) (future) are 200 m from the site.\nArbutus Village, a local shopping area, is located within 100 m, just north of Nanton Avenue. A\nlocal bus stop is located on Arbutus Street on the subject block.\n2. Policy Context\nVancouver Plan – The Vancouver Plan was approved by Council on July 22, 2022 and is a\nland use strategy to guide long-term growth of the City over the next 30 years. The approved\nVancouver Plan will serve as a framework with further implementation planning work to follow\nover the next two to four years.\nThe site is located within the Arbutus Ridge, Kerrisdale and Shaughnessy Vision.\nImplementation of the Vancouver Plan includes a review of all existing land use policies\nincluding the Visions, with the goal of expanding opportunities to address city-wide objectives.\nArbutus Ridge, Kerrisdale and Shaughnessy Community Vision (ARKS Vision) – The\nARKS Vision supports consideration of site-specific rezonings for institutional uses and seniors\nhousing.\nCommunity Care Facility – Class B and Group Residence Guidelines (Guidelines) – The\nZoning and Development By-law defines a “Community Care Facility – Class B” as a use\nproviding residential care to seven or more persons not related by blood or marriage, in an\noperation that is licenced under the Community Care and Assisted Living Act of British\n",
    "maxPages": 4,
    "type": "text",
    "createDate": "2024-02-05T05:02:52.847Z",
    "updateDate": "2024-02-05T05:02:52.847Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr8.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Susanne Rühle\nContact No.: 604.326.4844\nRTS No.: 16003\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: Rezoning: 688 West 29th Avenue\nRECOMMENDATION TO REFER\nTHAT the rezoning application, described below, be referred to Public Hearing together with the recommendations set out below and with the recommendation of the General Manager of Planning, Urban Design and Sustainability to approve the application, subject to the conditions set out below;\nFURTHER THAT the Director of Legal Services be instructed to prepare the necessary by-law(s), in accordance with the recommendations set out below, for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by Paramax Homes, on behalf of Vertical Ventures Inc., the registered owner of the land located at 688 West 29th Avenue [PID: 010-730-702; Lot 2 Block 759 District Lot 526 Plan 7115], to rezone the lands from R1-1 (Residential Inclusive) District to RM-8A (Residential) District, be approved in principle;\nFURTHER THAT the draft zoning amendment by-law, prepared for the Public Hearing in accordance with Appendix A, be approved in principle;\nAND FURTHER THAT the above approvals be subject to the Conditions of Approval contained in Appendix B.\nB. THAT, subject to approval of the zoning amendment by-law, the Subdivision By-law be amended generally as set out in Appendix C;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the amendment to the Subdivision By-law at the time of enactment of the zoning amendment by-law.\nRezoning: 688 West 29th Avenue – RTS 16003 2\nC. THAT Recommendations A and B be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the public hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\nREPORT SUMMARY\nThis report recommends a plan amendment to the Zoning and Development By-law for 688 West 29th Avenue. The proposed amendment would rezone the property from R1-1 (Residential Inclusive) District to RM-8A (Residential) District to allow for a townhouse or rowhouse development. The maximum floor space ratio (FSR) for RM-8A can be up to 1.20. Based on the site area, approximately eight townhouses can be achieved at this location.\nThe application meets the intent of the Cambie Corridor Plan (the “Plan”). Staff recommend that the application be referred to a Public Hearing, with the recommendation of the General Manager of Planning, Urban Design and Sustainability to approve it in principle, subject to the Public Hearing, and conditions contained within Appendix B.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n• Vancouver Plan (2022)\n• Cambie Corridor Plan (2018, amended 2023)\n• RM-8, RM-8A, RM-8N and RM-8AN Districts Schedule (2018, amended 2023)\n• RM-8, RM-8N, RM-8A and RM-8AN Guidelines (2018, amended 2023)\n• Housing Needs Report (2022)\n• Bulletin: Density Bonus Contributions (2014, amended 2023)\n• Vancouver Development Cost Levy By-Law No. 9755\n• Vancouver Utilities Development Cost Levy By-Law No. 12183\n• Latecomer Policy (2021)\n• Urban Forest Strategy (2014)\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site at 688 West 29th Avenue (see Figure 1) is comprised of one legal parcel along West 29th Avenue and east of Heather Street. The site area is approximately 605.2 sq. m (6,515 sq. ft.), with a frontage of 17.1 m (56 ft.) along 29th Avenue and a depth of 35.5 m (117 ft.).\nThe site and area to the east are zoned R1-1 and developed with single-detached houses. Surrounding sites have been rezoned to RM-8A and the BC Women’s and Children’s Hospital to the west is zoned CD-1. The area is eligible for rezoning to RM-8A under the Plan.\nThe house on the subject property was constructed in 1988 and is not listed on the Vancouver Heritage Register. As a single-lot development with secondary rental, the Tenant Relocation and Protection Policy does not apply.\nFigure 1: Location Map – Site and Context\n2. Policy Context\nVancouver Plan – The Vancouver Plan was approved by Council on July 22, 2022 and is a land use strategy to guide long-term growth of the City over the next 30 years. The Vancouver Plan will serve as a framework with further implementation planning work to follow over the next two to four years. The site is located within the Cambie Corridor Plan which is in alignment with the Vancouver Plan.\nCambie Corridor Plan – The Plan guides the transformation of the Corridor into an area where people can live, work, shop, play and learn – all within close proximity to the Canada Line. The Corridor’s population is anticipated to double by 2041, with 30,000 new homes, making it one of the largest growth areas outside of downtown.\nThe Plan identifies over 1,100 detached lots as eligible to be redeveloped as townhouses, creating opportunities for approximately 8,200 units of much-needed, ground-oriented housing. Specifically, Section 4.2.9 of the Plan supports residential townhouses or rowhouses for up to three storeys and a maximum density of 1.20 FSR.\nThe subject site is located within the Queen Elizabeth neighbourhood, characterized by its existing low-density residential character and green park-like setting.\nDesign Guidelines – The RM-8A/AN Districts Schedule is accompanied by clear design guidelines. These guidelines establish form of development expectations which provide predictability and certainty for new buildings. Design criteria sets out expected typologies, requirements for family housing, access to sunlight, privacy, landscape treatment, along with flexible development options for smaller lots (see Figure 2).\nFigure 2: Form of Development per the Design Guidelines – (Courtyard Rowhouses (Left) and Multiple Unit Stacked Townhouses (Right)\nRM-8AN zones are located along arterials and therefore contain more robust acoustic requirements than the RM-8A zones. Since 29th Avenue is classified as a local street and not an arterial, the proposed rezoning is to the RM-8A District Schedule.\nHousing Needs Report (2022) – On April 27, 2022, Council resolved at a public meeting to receive a Housing Needs Report (HNR) prepared by staff. Further to the BC Provincial government’s requirement, Council must consider the most recent HNR when developing a development plan, or when amending a development plan in relation to Council’s housing policies respecting affordable housing, rental housing and special needs housing.\nThis zoning amendment would facilitate the delivery of strata housing and implements Council-approved direction contained in the Plan, which includes direction on housing that is well supported by the data and findings within the HNR.\nStrategic Analysis\n1. Simplified Rezoning Process\nRezoning to an RM-8A/AN follows a simplified rezoning process. Since this rezoning is to an established District Schedule which sets out the allowable uses, maximum heights and densities, architectural drawings are not required at the rezoning stage. The rezoning review is limited to a plan amendment to the Zoning and Development By-law to designate the site from R1-1 to RM-8A (see Appendix A).\nStaff review drawings according to the RM-8A/AN design guidelines at a future development permit process which streamlines the rezoning process.\nAn Urban Design Panel review is not required due to the small scale of the buildings and comprehensive design guidelines that accompany the District Schedule.",
    "maxPages": 4,
    "type": "text",
    "createDate": "2024-02-05T05:02:06.454Z",
    "updateDate": "2024-02-05T05:02:06.454Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr7.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Oskar Eriksson\nContact No.: 604.829.9270\nRTS No.: 16004\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: Rezoning: 692 West 30th Avenue\nRECOMMENDATION TO REFER\nTHAT the rezoning application, described below, be referred to Public Hearing together with the recommendations set out below and with the recommendation of the General Manager of Planning, Urban Design and Sustainability to approve the application, subject to the conditions set out below;\nFURTHER THAT the Director of Legal Services be instructed to prepare the necessary by-law(s), in accordance with the recommendations set out below, for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by Paramax Homes, on behalf of Gurjeet Singh Tiwana, the registered owner of the land located at 692 West 30th Avenue [PID: 010-691-162; Lot 1 Block 779 District Lot 526 Plan 7206], to rezone the land from R1-1 (Residential Inclusive) District to RM-8A (Residential) District, be approved in principle;\nFURTHER THAT the draft zoning amendment by-law, prepared for the Public Hearing in accordance with Appendix A, be approved in principle;\nAND FURTHER THAT the above approvals be subject to the Conditions of Approval contained in Appendix B.\nB. THAT, subject to approval of the zoning amendment by-law, the Subdivision By-law be amended generally as set out in Appendix C;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the amendment to the Subdivision By-law at the time of enactment of the zoning amendment by-law.\nRezoning: 692 West 30th Avenue – RTS 16004 2\nC. THAT Recommendations A and B be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the public hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\nREPORT SUMMARY\nThis report recommends a plan amendment to the Zoning and Development By-law for 692 West 30th Avenue. The proposed amendment would rezone the properties from R1-1 (Residential Inclusive) District to RM-8A (Residential) District to allow for a townhouse or rowhouse development. The maximum floor space ratio (FSR) for RM-8A is 1.20. Based on the site area, approximately ten townhouses can be achieved at this location.\nThe application meets the intent of the Cambie Corridor Plan (the “Plan”). Staff recommend that the application be referred to a Public Hearing, with the recommendation of the General Manager of Planning, Urban Design and Sustainability to approve it in principle, subject to the Public Hearing, and conditions contained within Appendix B.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n• Vancouver Plan (2022)\n• Cambie Corridor Plan (2018, amended 2023)\n• RM-8, RM-8A, RM-8N and RM-8AN Districts Schedule (2018, amended 2023)\n• RM-8, RM-8N, RM-8A and RM-8AN Guidelines (2018, amended 2023)\n• Housing Needs Report (2022)\n• Bulletin: Density Bonus Contributions (2014, amended 2023)\n• Vancouver Development Cost Levy By-Law No. 9755\n• Vancouver Utilities Development Cost Levy By-law No. 12183\n• Latecomer Policy (2021)\n• Urban Forest Strategy (2014)\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site at 692 West 30th Avenue (see Figure 1) is comprised of one legal parcel on the southeast corner of West 30th Avenue and Heather Street. The site area is approximately 746.2 sq. m (8,032 sq. ft.), with a frontage of 17.1 m (56 ft.) along 30th Avenue and a depth of 43.8 m (144 ft.) along the east property line.\nThe site and area to the east are zoned R1-1 and developed with single-detached houses. Surrounding sites have been rezoned to RM-8A and the BC Children’s Hospital to the west is zoned CD-1. The area is eligible for rezoning to RM-8A under the Plan.\nThe house on the subject property was constructed in 1949 and is not listed on the Vancouver Heritage Register. As a single-lot development with secondary rental, the Tenant Relocation and Protection Policy does not apply.\nFigure 1: Location Map – Site and Context\n2. Policy Context\nVancouver Plan – The Vancouver Plan was approved by Council on July 22, 2022 and is a land-use strategy to guide long-term growth of the City over the next 30 years. The Vancouver Plan will serve as a framework with further implementation planning work to follow over the next two to four years. The site is located within the Plan which is in alignment with the Vancouver Plan.\nCambie Corridor Plan – The Plan guides the transformation of the Corridor into an area where people can live, work, shop, play and learn – all within close proximity to the Canada Line. The Corridor’s population is anticipated to double by 2041, with 30,000 new homes, making it one of the largest growth areas outside of downtown.\nThe Plan identifies over 1,100 detached lots as eligible to redevelop for townhouses, creating opportunities for approximately 8,200 units of much-needed ground-oriented housing.\nSpecifically, Section 4.2.9 of the Plan supports residential townhouses or rowhouses for up to three storeys and a maximum density of 1.20 FSR.\nThe subject site is located within the Queen Elizabeth neighbourhood, characterized by its existing low-density residential character and green park-like setting.\nDesign Guidelines – The RM-8A/AN Districts Schedule is accompanied by clear design guidelines. These guidelines establish form of development expectations which provide predictability and certainty for new buildings. Design criteria sets out expected typologies, requirements for family housing, access to sunlight, privacy, landscape treatment, along with flexible development options for smaller lots (see Figure 2).\nFigure 2: Form of Development per the Design Guidelines – (Courtyard Rowhouses (Left) and Multiple Unit Stacked Townhouses (Right)\nRM-8AN zones are located along arterials and therefore contain more robust acoustic requirements than the RM-8A zones. Since 30th Avenue is classified as a local street and not an arterial, the proposed rezoning is to the RM-8A District Schedule.\nHousing Needs Report (2022) - On April 27, 2022, Council resolved at a public meeting to receive a Housing Needs Report (HNR) prepared by staff. Further to the BC Provincial government’s requirement, Council must consider the most recent HNR when developing a development plan, or when amending a development plan in relation to Council’s housing policies respecting affordable housing, rental housing and special needs housing.\nThis zoning amendment would facilitate the delivery of strata housing and implements Council-approved direction contained in the Plan, which includes direction on housing that is well supported by the data and findings within the HNR.\nStrategic Analysis\n1. Simplified Rezoning Process\nRezoning to an RM-8A/AN follows a simplified rezoning process. Since this rezoning is to an established Districts Schedule which sets out the allowable uses, maximum heights and densities, architectural drawings are not required at the rezoning stage. The rezoning review is limited to a plan amendment to the Zoning and Development By-law to designate the site from R1-1 to RM-8A (see Appendix A).\nStaff review drawings according to the RM-8A/AN design guidelines at a future development permit process, which streamlines the rezoning process.\nAn Urban Design Panel review is not required due to the small scale of the buildings and comprehensive design guidelines that accompany the District Schedule.",
    "maxPages": 4,
    "type": "text",
    "createDate": "2024-02-05T05:01:18.217Z",
    "updateDate": "2024-02-05T05:01:18.217Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr6.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Bryan Wong\nContact No.: 604.707.5420\nRTS No.: 16005\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 8120-8168 Lord Street and 540 West 65th Avenue\nRECOMMENDATION TO REFER\nTHAT the rezoning application and plans, described below, be referred to Public Hearing\ntogether with the recommendations set out below and with the recommendation of the General\nManager of Planning, Urban Design and Sustainability to approve the application, subject to the\nconditions set out below;\nFURTHER THAT the Director of Legal Services be instructed to prepare the necessary by-laws,\nin accordance with the recommendations set out below, for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by Francl Architecture Inc. on behalf of Lord Street Holdings Ltd.,\nthe registered owner of the lands located at 8120-8168 Lord Street and 540 West 65th\nAvenue [Lots 13 to 18 of Lot X Blocks 1 and 2 District Lot 311 Plan 8548; PIDs 010-042-\n784, 005-405-181, 010-042-831, 010-042-881, 010-042-911, and 010-042-946], to\nrezone the lands from R1-1 (Residential Inclusive) District to CD-1 (Comprehensive\nDevelopment) District to increase the maximum floor space ratio (FSR) from 0.70 to 2.88\nand the maximum building height from 11.5 m (38 ft.) to 20.7 m (68 ft.), to permit the\ndevelopment of two six-storey residential buildings containing 146 secured-rental units,\nof which five units will be secured as below-market rental units, be approved in principle;\nFURTHER THAT the draft CD-1 By-law, prepared for the Public Hearing in accordance\nwith Appendix A, be approved in principle;\nFURTHER THAT the proposed form of development also be approved in principle,\ngenerally as prepared by Francl Architecture Inc., received October 7, 2022, provided\nthat the Director of Planning may allow minor alterations to this form of development\nwhen approving the detailed scheme of development;\nAND FURTHER THAT the above approvals be subject to the Conditions of Approval\ncontained in Appendix B.\nB. THAT subject to approval in principle of the rezoning and the Housing Agreement\ndescribed in Part 2 of Appendix B, the Director of Legal Services be instructed to\nprepare the necessary Housing Agreement By-law for enactment prior to enactment of\nthe CD-1 By-law, subject to such terms and conditions as may be required at the\ndiscretion of the Director of Legal Services and the General Manager of Planning, Urban\nDesign and Sustainability.\nC. THAT subject to approval of the CD-1 By-law, the Subdivision By-law be amended,\ngenerally as set out in Appendix C;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the\namendment to the Subdivision By-law at the time of enactment of the CD-1 By-law.\nD. THAT Recommendation A to C be adopted on the following conditions:\n(i) T HAT t he passage of the above resolutions creates no legal rights for the\napplicant or any other person, or obligation on the part of the City, and any\nexpenditure of funds or incurring of costs is at the risk of the person making the\nexpenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the Public Hearing shall not\nobligate the City to enact a by-law rezoning the property, and any costs incurred\nin fulfilling requirements imposed as a condition of rezoning are at the risk of the\nproperty owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any\nway be limited or directed in the exercise of their authority or discretion,\nregardless of when they are called upon to exercise such authority or discretion.\nREPORT SUMMARY\nThis report evaluates an application to rezone 8120-8168 Lord Street and 540 West 65th\nAvenue to a CD-1 (Comprehensive Development) District for two six-storey residential buildings\nconsisting of 146 secured-market rental units, of which five units would be below-market rental.\nThe application meets the intent of the Cambie Corridor Plan (“Plan”). Staff recommend that the\napplication be referred to Public Hearing, with the recommendation of the General Manager of\nPlanning, Urban Design and Sustainability to approve it in principle, subject to the Public\nHearing, and conditions contained in Appendix B.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n• Vancouver Plan (2022)\n• Cambie Corridor Plan (2018, last amended 2023)\n• Cambie Corridor Public Realm Plan (2018)\n• Marpole Community Plan – Public Benefits Strategy (2014, last amended 2021)\n• Housing Needs Report (2022)\n• Housing Vancouver Strategy (2017)\n• Family Room: Housing Mix Policy for Rezoning Projects (2016)\n• High-Density Housing for Families with Children Guidelines (1992, last amended 2020)\n• Community Amenity Contributions Policy for Rezonings (1999, last amended 2023)\n• Vancouver Development Cost Levy By-law No. 9755\n• Vancouver Utilities Development Cost Levy By-law No. 12183\n• Tenant Relocation and Protection Policy (2015, last amended 2019)\n• Green Buildings Policy for Rezonings (2010, last amended 2023)\n• Urban Forest Strategy (2014, last amended 2018)\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site is zoned R1-1 and located on the southeast corner of Lord Street and\nWest 65th Avenue (Figure 1). The property consists of a six-lot assembly with a frontage of\n43.9 m (276 ft.) along Lord Street and a depth of 36.0 m (120 ft.) along 65th Avenue. The total\nsite area is 3,080.0 sq. m (33,153 sq. ft.) and is developed with six single-detached houses built\nin 1964 and 2002, all currently rented. As the application involves consolidation of two or more\nlots with secondary rental units, the Tenant Relocation and Protection Policy applies.\nFigure 1: Location Map – Site and Context\nThe surrounding area contains a mix of uses and is undergoing significant change, with new\nbuildings approved or under construction. East of the site is a townhouse development and two\nresidential towers of 31- and 25-storeys fronting Cambie Street. South of the site is a mixed-use\ndevelopment up to 31 storeys, the YMCA 37-space childcare facility and the YMCA Marpole\nFamily Place. On the southeast corner of Cambie Street and Marine Drive is the mixed-use\nMarine Gateway development which comprises of the Canada Line Station, Translink bus loop,\nand two residential towers of 35- and 26-storeys. West of the site is the École des Colibris, Ash\nPark and the Vera Housing Co-operative.\nNeighbourhood Amenities – The following amenities are within close proximity:\n• Parks: Ash Park (80 m) and Winona Park (600 m);\n• Cultural/Community Spaces: Marpole Oakridge Family Place (100 m) and\nMarpole-Oakridge Community Centre (1.4 km); and\n• Childcare: Marpole YMCA Child Care Centre (100 m), Kids at Marine YMCA Child Care\nCentre (400 m), School Age Child Care at Sexsmith Elementary School ( 1.3 k m) and\nMarpole Oakridge Day Care Society (1.4 km).\nLocal School Capacity – The site is within the catchment area of Sir Wilfrid Laurier Elementary\nSchool and Sir Winston Churchill Secondary School. According to the Vancouver School Board\n(VSB)’s 2020 Long Range Facilities Plan, Sir Wilfrid Laurier Elementary will be operating above\ncapacity and Sir Winston Churchill Secondary will be operating below capacity in",
    "maxPages": 4,
    "type": "text",
    "createDate": "2024-02-05T05:00:33.603Z",
    "updateDate": "2024-02-05T05:00:33.603Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr5.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Allison Smith\nContact No.: 604.873.7583\nRTS No.: 16006\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 1710-1730 East Pender Street\nRECOMMENDATION TO REFER\nTHAT the rezoning application and plans, described below, be referred to Public Hearing\ntogether with the recommendations set out below and with the recommendation of the\nGeneral Manager of Planning, Urban Design and Sustainability to approve the application,\nsubject to the conditions set out below;\nFURTHER THAT the Director of Legal Services be instructed to prepare the necessary by-laws,\nin accordance with the recommendations set out below, for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by DIALOG BC Architecture Engineering Interior Design\nPlanning Inc. on behalf of:\n• Lu'ma Native Housing Society, the registered owner of the lands located\nat 1710 East Pender Street [Lot F of Lot 6 Block D District Lot 183 Plan\n20745; PID 003-347-834], and\n• ALT Commercial Housing Society, the registered owner of the lands at\n1730 East Pender Street [Lots 4 and 5 Except the North 7 Feet, Now\nRoad of Lot 6 Block D District 183 Plan 729; PIDs 009-502-068 and\n009-502-165, respectively],\nto rezone the lands (including a portion of a City road) from RM-4 and RM-4N\n(Residential) District to CD-1 (Comprehensive Development) District to increase\nthe maximum floor space ratio (FSR) from 1.45 to 5.58 and the maximum\nbuilding height from 10.7 m (35.1 ft.) to 60.8 m (199.5 ft.), with a maximum of\n64.1 m (210.3 ft.) to accommodate a partial 19th floor rooftop amenity area, to\npermit the development of an 18-storey social housing mixed-use building,\nCD-1 Rezoning: 1710-1730 East Pender Street – RTS 16006 2\ncontaining 191 housing units including six live-work units, with commercial space\non the ground floor, be approved in principle;\nFURTHER THAT the draft CD-1 by-law, prepared for the Public Hearing in\naccordance with Appendix A, be approved in principle;\nFURTHER THAT the proposed form of development also be approved in\nprinciple for the CD-1 By-law, generally as prepared by DIALOG BC Architecture\nEngineering Interior Design Planning Inc., received May 19, 2023, provided that\nthe Director of Planning may allow minor alterations to this form of development\nwhen approving the detailed scheme of development;\nAND FURTHER THAT the above approvals be subject to the Conditions of\nApproval contained in Appendix B.\nB. THAT subject to approval in principle of the rezoning and the Housing Agreement\ndescribed in Part 2 of Appendix B, the Director of Legal Services be instructed to\nprepare the necessary Housing Agreement By-law for enactment prior to\nenactment of the CD-1 By-law, subject to such terms and conditions as may be\nrequired at the discretion of the Director of Legal Services, and the General\nManager of Planning, Urban Design and Sustainability.\nC. THAT subject to approval of the CD-1 By-law, the application to amend the Sign\nBy-law to establish regulations for the new CD-1, generally as set out in\nAppendix C, be approved.\nD. THAT subject to approval of the CD-1 By-law, the Noise Control By-law be\namended to include the CD-1, generally as set out in Appendix C;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the\namendment to the Noise Control By-law at the time of enactment of the CD-1\nBy-law.\nE. THAT Recommendations A to D be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the\napplicant or any other person, or obligation on the part of the City, and\nany expenditure of funds or incurring of costs is at the risk of the person\nmaking the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the Public Hearing shall\nnot obligate the City to enact a by-law rezoning the property, and any\ncosts incurred in fulfilling requirements imposed as a condition of\nrezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not\nin any way be limited or directed in the exercise of their authority or\ndiscretion, regardless of when they are called upon to exercise such\nauthority or discretion.\nCD-1 Rezoning: 1710-1730 East Pender Street – RTS 16006 3\nREPORT SUMMARY\nThis report evaluates an application to rezone 1710-1730 East Pender Street from RM-4 and\nRM-4N (Residential) District to CD-1 (Comprehensive Development) District, under the\nGrandview Woodland Community Plan. The application proposes an 18-storey mixed-use\nbuilding containing 191 social housing units, including six live-work units, and ground floor\ncommercial space.\nStaff assessed the application and concluded that it generally meets the intent of the\nGrandview-Woodland Community Plan and advances the goals of the Vancouver Plan with\nrespect to form of development and the Housing Vancouver Strategy with respect to the delivery\nof social housing, in addition to the City’s commitments around equity and Reconciliation. Staff\nrecommend the application be referred to a Public Hearing, with the recommendation of the\nGeneral Manager of Planning, Urban Design and Sustainability to approve it, subject to a Public\nHearing and the conditions outlined in Appendix B.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n• Vancouver Plan (2022)\n• Grandview-Woodland Community Plan (2016)\n• Housing Needs Report (2022)\n• Housing Vancouver Strategy (2017)\n• City of Reconciliation (2016)\n• Equity Framework (2021)\n• City of Vancouver’s UNDRIP Strategy (2022)\n• Tenant Relocation and Protection Policy (2019)\n• Making Space for Arts and Culture (2019)\n• Community Amenity Contributions Policy for Rezonings (1999, last amended 2023)\n• Green Buildings Policy for Rezonings (2010, last amended 2023)\n• Vancouver Development Cost Levy By-law No. 9755)\n• Vancouver Utilities Development Cost Levy By-law No. 12183\n• Urban Forest Strategy (2018)\n• Latecomer Policy (2021)\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site is comprised of three lots, as well as a segment of City road along Pender\nStreet, on the southeast corner of the Pender Street and Commercial Drive intersection\n(Figure 1) in the Grandview-Woodland neighbourhood. Grandview-Woodland is located on the\nunceded and ancestral territory of the hən\n̓\nq\n̓\nəmin\n̓\nəm\n̓\nand Sḵwx\ṉ\nwú7mesh speaking peoples, the\nxʷməθkʷəy\n̓\nəm (Musqueam), Sḵwx\ṉ\nwú7mesh (Squamish), and səlilwətaɬ (Tsleil-Waututh)\nNations. The area is home to a significant number of urban Indigenous Peoples, including\nmembers of Musqueam, Squamish, Tsleil-Waututh Nations, as well as First Nations, Metis and\nInuit from other parts of British Columbia and Canada. A number of Indigenous housing\nCD-1 Rezoning: 1710-1730 East Pender Street – RTS 16006 4\nproviders and organizations, such as the Aboriginal Friendship Centre and Urban Native Youth\nAssociation, are located throughout the neighbourhood.\nThe closure, stopping-up and conveyance of the portion of Pender Street to the applicant is to\nbe separately decided upon at the sole and unfettered direction of Council, as described in\nSection 4 of the Background/Context section of this report and set out in Part 2 of Appendix B\nas a condition of rezoning enactment.\nThe site area is 2,494 sq. m (26,849 sq. ft.), with a frontage of 67.1 m (220 ft.) along Pender\nStreet and 37.2 m (122 ft.) along Commercial Drive. A lane abuts the rear of the site to the\nsouth. Neighbouring sites are primarily zoned RM-4 and RM-4N (Residential), MC-1\n(Mixed-Use) and CD-1 (Comprehensive Development) Districts. The area is characterized by a\nmix of uses and forms, including low-rise apartment buildings, single detached dwellings,\nindustrial buildings and mixed-use buildings along Hastings Street.\nThe property is currently developed with two existing apartment buildings containing 36 rental\nhousing units, with a total of 36 rental tenancies. The site slopes downwards towards the\nCommercial Drive frontage.\nFigure 1: Location Map",
    "maxPages": 4,
    "type": "text",
    "createDate": "2024-02-05T04:59:44.390Z",
    "updateDate": "2024-02-05T04:59:44.391Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr4.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Casey Peters\nContact No.: 604.871.6356\nRTS No.: 16009\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: Rezoning: 6470 Larch Street\nRECOMMENDATION TO REFER\nTHAT the rezoning application, described below, be referred to Public Hearing together with the recommendations set out below and with the recommendation of the General Manager of Planning, Urban Design and Sustainability to approve the application, subject to the conditions set out below;\nFURTHER THAT the Director of Legal Services be instructed to prepare the necessary by-laws, in accordance with the recommendations set out below, for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by AVRP Architecture Inc. on behalf of Pius Ho, the registered owner of the lands located 6470 Larch Street [PID 011-198-109; Lot 6 of Lot B Block 3 of Block 1 District Lot 526 Plan 5250], to rezone the lands from R1-1 (Residential Inclusive) District to RR-2B (Residential Rental) District, be approved in principle;\nFURTHER T HAT the draft zoning amendment by-law, prepared for the Public Hearing in accordance with Appendix A, be approved in principle;\nAND FURTHER THAT the above approvals be subject to the Conditions of Approval contained in Appendix B.\nB. THAT subject to approval in principle of the rezoning and the Housing Agreement described in Part 2 of Appendix B, the Director of Legal Services be instructed to prepare the necessary Housing Agreement By-law for enactment prior to enactment of the zoning amendment By-law, subject to such terms and conditions as may be required at the discretion of the Director of Legal Services and the General Manager of Planning, Urban Design and Sustainability, and the General Manager of Arts, Culture and Community Services.\nRezoning: 6470 Larch Street – RTS 16009 2\nC. T HAT subject to approval of the zoning amendment by-law, the Subdivision By-law be amended generally as set out in Appendix C;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the amendment to the Subdivision By-law at the time of enactment of the zoning amendment by-law.\nD. T HAT Recommendations A to C be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the public hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\nREPORT SUMMARY\nThis report recommends an amendment to the Zoning and Development By-law from R1-1 (Residential Inclusive) District to RR-2B (Residential Rental) District, for the site located at 6470 Larch Street. The amendment would allow for a five-storey rental building in accordance with the Secured Rental Policy (“SRP”). An estimated total of 33 secured rental units would be delivered through this application.\nA future building design would be submitted through the development permit process and reviewed with the public at that time.\nStaff have assessed the application and conclude that it meets the intent of the SRP. Staff recommend that the application be referred to a Public Hearing, with the recommendation of the General Manager of Planning, Urban Design and Sustainability to approve it in principle, subject to the Public Hearing, and conditions contained within Appendix B.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n• Vancouver Plan (2022)\n• Secured Rental Policy (2012, last amended 2023)\n• RR-2B District Schedule (2023)\n• Residential Rental District Schedules Design Guidelines (2022)\n• Housing Vancouver Strategy (2017)\n• Housing Needs Report (2022)\n• Family Room: Housing Mix Policy for Rezoning Projects (2016)\n• High-Density Housing for Families with Children Guidelines (1992, last amended 2022)\nRezoning: 6470 Larch Street – RTS 16009 3\n• Green Buildings Policy for Rezonings (2010, last amended 2023)\n• Urban Forest Strategy (2014, amended 2018)\n• Latecomer Policy (2021)\n• Vancouver Development Cost Levy By-law No. 9755\n• Vancouver Utilities Development Cost Levy By-law No. 12183\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site (see Figure 1) is comprised of one legal parcel fronting 49th Avenue. The total site area is approximately 1,073 sq. m (11,547 sq. ft.), with a frontage of 20.2 m (66 ft.) along 49th Avenue and a depth of 53.4 m (175 ft.).\nFigure 1: Location Map – Site and Context\nThis property and the surrounding area are zoned for residential uses under the R1-1 District Schedule. The site is currently an empty lot and contains no rental tenancies.\n2. Policy Context\nVancouver Plan – The Vancouver Plan was approved by Council on July 22, 2022 and is a land use strategy to guide long-term growth of the City over the next 30 years. The approved Vancouver Plan will serve as a framework with further implementation planning work to follow over the next two to four years. The proposal addresses priorities within the Housing Vancouver Strategy which aligns with the Vancouver Plan.\nSecured Rental Policy (“SRP”) – The SRP encourages the construction of new purpose-built rental housing in Vancouver. Updates to the SRP were approved by Council in December 2021 to streamline the delivery of new rental housing. These included clarifying opportunities for rezoning in low-density areas close to public transit, shopping and other daily needs, and to streamline and simplify the rezoning process by utilizing new rental zones with standardized regulations.\nThe SRP outlines the following locational eligibility criteria for sites in low-density areas:\n• In an existing R1-1 or RT zone outside of recent community plan areas (excluding certain RT-zoned areas in Kitsilano and Kensington-Cedar Cottage with high proportions of heritage buildings and multiple conversion dwellings);\n• Located within close proximity to public transit and local shopping; and\n• On the first full block on either side of an eligible arterial road.\nSites that meet these criteria and that are part of the typical street grid (including having lane or secondary street access to the rear) and are regular in shape, size and other attributes may be considered for rezoning under the SRP to one of the residential rental zones. The applicable option or options are further informed by the site’s size, orientation and adjacent context.\nThe SRP generally supports up to four-storey mixed-use and five-storey residential apartments on arterials, and up to four-storey townhouses or apartments on sites off arterials. Up to six storeys may be considered for projects on arterials where the residential component includes a minimum 20% permanently secured below-market rental housing or 100% social housing. This application complies with the location criteria under the SRP for five-storey buildings.\nRR Zoning District Schedules and Design Guidelines – Along with updates to the SRP, in December 2021 Council approved the addition of new residential rental (“RR”) zoning district schedules to the Zoning & Development By-law: “RR-1”, “RR-2A, RR-2B and RR-2C”, and “RR-3A and RR-3B”. Like other standard zoning districts, the RR zones set basic regulations such as permitted use, density, and height limits, while allowing for a range of building designs. All residential uses in the RR zones are secured as rental tenure, and no stratification or sale of individual residential units is allowed.\nFurther direction on form of development expectations under each of the RR zones is provided in the Residential Rental Districts Schedules Design Guidelines. Recognizing that the SRP and RR zones are intended to enable incremental change in neighbourhoods that currently consist primarily of detached houses and duplexes, the guidelines support new missing middle buildings that foster neighbourliness and social connection, and contribute to an evolving streetscape which accommodates more architectural variety and diversity of housing options.\nHousing Vancouver Strategy – In November 2017, Council approved the Housing Vancouver Strategy (2018-2027). The strategy seeks to shift the supply of new homes toward the right supply, with targets for new units along a continuum of housing types. The Housing",
    "maxPages": 4,
    "type": "text",
    "createDate": "2024-02-05T04:58:58.392Z",
    "updateDate": "2024-02-05T04:58:58.392Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr3.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Simon Jay\nContact No.: 604.829.2004\nRTS No.: 16012\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: Rezoning: 2231-2247 East 41st Avenue\nRECOMMENDATION TO REFER\nTHAT the rezoning application, described below, be referred to Public Hearing together with the recommendations set out below and with the recommendation of the General Manager of Planning, Urban Design and Sustainability to approve the application, subject to the conditions set out below;\nFURTHER THAT the Director of Legal Services be instructed to prepare the necessary by-law(s), in accordance with the recommendations set out below, for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by Dava Developments Ltd., on behalf of 1314594 B.C. Ltd., the registered owners of the lands located at 2231-2247 East 41st Avenue [Lot 39 to 42 Block 15 District Lot 394 Plan 7098; PIDs 010-729-313, 010-729-330, 010-729-364, and 010-729-399 respectively], to rezone the lands from R1-1 (Residential Inclusive) District to RR-2B (Residential Rental) District, be approved in principle;\nFURTHER THAT the draft zoning amendment by-law, prepared for the Public Hearing in accordance with Appendix A, be approved in principle;\nAND FURTHER THAT the above approvals be subject to the Conditions of Approval contained in Appendix B.\nB. THAT subject to approval in principle of the rezoning and the Housing Agreement described in Part 2 of Appendix B, the Director of Legal Services be instructed to prepare the necessary Housing Agreement By-law for enactment prior to 1 Beneficially owned and controlled by Dava Developments Ltd.\nRezoning: 2231-2247 East 41st Avenue – RTS 16012 2 enactment of the zoning amendment By-law, subject to such terms and conditions as may be required at the discretion of the Director of Legal Services and the General Manager of Planning, Urban Design and Sustainability.\nC. THAT subject to approval of the zoning amendment by-law, the Subdivision By-law be amended generally as set out in Appendix C;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the amendment to the Subdivision By-law at the time of enactment of the zoning amendment by-law.\nD. THAT Recommendations A to C be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the public hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\nREPORT SUMMARY\nThis report recommends a plan amendment to the Zoning and Development By-law from R1-1 (Residential Inclusive) District to RR-2B (Residential Rental) District, for the site located at 2231-2247 East 41st Avenue. The amendment would allow for a five-storey rental building in accordance with the Secured Rental Policy (“SRP”). An estimated total of 61 secured rental units would be delivered through this application.\nA future building design would be submitted through the development permit process and reviewed with the public at that time.\nStaff have assessed the application and conclude that it meets the intent of the SRP. Staff recommend that the application be referred to a Public Hearing, with the recommendation of the General Manager of Planning, Urban Design and Sustainability to approve it in principle, subject to the Public Hearing, and conditions contained within Appendix B.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\nRelevant Council policies for this site include:\n• Vancouver Plan (2022)\n• Secured Rental Policy (2012, last amended 2023)\nRezoning: 2231-2247 East 41st Avenue – RTS 16012 3\n• RR-2B District Schedule (2023)\n• Residential Rental District Schedules Design Guidelines (2022)\n• Housing Vancouver Strategy (2017)\n• Housing Needs Report (2022)\n• Family Room: Housing Mix Policy for Rezoning Projects (2016)\n• High-Density Housing for Families with Children Guidelines (1992, last amended 2022)\n• Tenant Relocation and Protection Policy (2019)\n• Green Buildings Policy for Rezonings (2010, last amended 2023)\n• Urban Forest Strategy (2014, amended 2018)\n• Latecomer Policy (2021)\n• Vancouver Development Cost Levy By-law No. 9755\n• Vancouver Utilities Development Cost Levy By-law No. 12183\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site (see Figure 1) is comprised of four legal parcels fronting West 41st Avenue. The total site area is approximately 1,994.2 sq. m (21,466 sq. ft.), with a frontage of 50.6 m (166 ft.) along 41st Avenue and a depth of 39.2 m (129 ft.).\nFigure 1: Location Map – Site and Context\nThe site is currently zoned R1-1 and developed with four single-detached homes constructed between 1948 and 1961. The properties are not listed on the Vancouver Heritage Register. The property contains four rental tenancies and the tenant protection policy does apply. The surrounding area is zoned for residential (R1-1 and RT-11). CD-1 (3A) (Orchard Park Senior’s Housing) to the south is developed with rental housing up to three storeys.\n2. Policy Context\nVancouver Plan – The Vancouver Plan was approved by Council on July 22, 2022 and is a land use strategy to guide long-term growth of the City over the next 30 years. The approved Vancouver Plan will serve as a framework with further implementation planning work to follow over the next two to four years. The proposal addresses priorities within the Housing Vancouver Strategy which aligns with the Vancouver Plan.\nSecured Rental Policy (“SRP”) – The SRP encourages the construction of new purpose-built rental housing in Vancouver. Updates to the SRP were approved by Council in December 2021 to streamline the delivery of new rental housing. These included clarifying opportunities for rezoning in low-density areas close to public transit, shopping and other daily needs, and to streamline and simplify the rezoning process by utilizing new rental zones with standardized regulations.\nThe SRP outlines the following locational eligibility criteria for sites in low-density areas:\n• In an existing R1-1 or RT zone outside of recent community plan areas (excluding certain RT-zoned areas in Kitsilano and Kensington-Cedar Cottage with high proportions of heritage buildings and multiple conversion dwellings);\n• Located within close proximity to public transit and local shopping; and\n• On the first full block on either side of an eligible arterial road.\nSites that meet these criteria and that are part of the typical street grid (including having lane or secondary street access to the rear) and are regular in shape, size and other attributes may be considered for rezoning under the SRP to one of the new residential rental zones. The applicable option or options are further informed by the site’s size, orientation and adjacent context.\nThe SRP generally supports up to four-storey mixed-use and five-storey residential apartments on arterials, and up to four-storey townhouses or apartments on sites off arterials. Up to six storeys may be considered for projects on arterials where the residential component includes a minimum 20% permanently secured below-market rental housing or 100% social housing. This application complies with the location criteria under SRP for five-storey buildings.\nRR Zoning District Schedules and Design Guidelines – Along with updates to the SRP, in December 2021 Council approved the addition of new residential rental (“RR”) zoning district schedules to the Zoning & Development By-law: “RR-1”, “RR-2A, RR-2B and RR-2C”, and “RR-3A and RR-3B”. Like other standard zoning districts, the RR zones set basic regulations such as permitted use, density, and height limits, while allowing for a range of building designs.\nAll residential uses in the RR zones are secured as rental tenure, and no stratification or sale of individual residential units is allowed.\nFurther direction on form of development expectations under each of the RR zones is provided in the Residential Rental Districts Schedules Design Guidelines. Recognizing that the SRP and RR zones are intended to enable incremental change in neighbourhoods that currently consist primarily of detached houses and duplexes, the guidelines",
    "maxPages": 4,
    "type": "text",
    "createDate": "2024-02-05T04:58:14.957Z",
    "updateDate": "2024-02-05T04:58:14.957Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr2.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Sarah Cranston\nContact No.: 604.873.7733\nRTS No.: 15960\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 4711-4787 Cambie Street\nRECOMMENDATION TO REFER\nTHAT the rezoning application and plans, described below, be referred to Public Hearing\ntogether with the recommendations set out below and with the recommendation of the General\nManager of Planning, Urban Design and Sustainability to approve the application, subject to the\nconditions set out below;\nFURTHER THAT the Director of Legal Services be instructed to prepare the necessary by-laws,\nin accordance with the recommendations set out below, for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by Mosaic Homes, on behalf of Mosaic Flora and Fauna\nHoldings Ltd., the registered owner of the land located at 4711-4787 Cambie\nStreet [Lots 6 to 9 of Block 799 District Lot 526 Plan 7221; PIDs 010-766-197,\n010-766-219, 010-766-235, and 010-766-286, respectively] to rezone from\nR1-1 (Residential Inclusive) District to CD-1 (Comprehensive Development)\nDistrict to increase the permitted floor space ratio (FSR) from 0.70 to 2.65 and\nthe maximum building height from 11.5 m (37.7 ft.) to 23.6 m (77.4 ft.) to permit\nthe development of two six-storey residential buildings with 114 strata-titled\nresidential units, be approved in principle;\nFURTHER THAT the draft CD-1 By-law, prepared for the Public Hearing in\naccordance with Appendix A, be approved in principle;\nFURTHER THAT the proposed form of development also be approved in\nprinciple, generally as prepared by Ciccozzi Architecture, received September\n29, 2022, provided the Director of Planning may allow minor alterations to this\nform of development when approving the detailed scheme of development;\nAND FURTHER THAT the above approvals be subject to the Conditions of\nApproval contained in Appendix B.\nB. THAT subject to the approval of the CD-1 By-law, the Subdivision By-law be\namended, generally as set out in Appendix C;\nFURTHER THAT the Director of Legal Services be instructed to bring forward\nthe amendment to the Subdivision By-law at the time of enactment of the CD-1\nBy-law.\nC. THAT Recommendations A and B be adopted on the following conditions:\n(i) T HAT t he passage of the above resolutions creates no legal rights for\nthe applicant or any other person, or obligation on the part of the City,\nand any expenditure of funds or incurring of costs is at the risk of the\nperson making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the Public Hearing\nshall not obligate the City to enact a by-law rezoning the property, and\nany costs incurred in fulfilling requirements imposed as a condition of\nrezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall\nnot in any way be limited or directed in the exercise of their authority or\ndiscretion, regardless of when they are called upon to exercise such\nauthority or discretion.\nREPORT SUMMARY\nThis report evaluates an application to rezone 4711-4787 Cambie Street from R1-1 (Residential\nInclusive) District to CD-1 (Comprehensive Development) District under the Cambie Corridor\nPlan (“Plan”). The proposal is for two six-storey, strata-titled residential buildings with a building\nheight of 23.6 m (77.4 ft.) and a floor space ratio (FSR) of 2.65.\nThe proposed uses and form of development are consistent with the Plan. Staff recommend that\nthe application be referred to Public Hearing with the recommendation of the General Manager\nof Planning, Urban Design and Sustainability to approve it in principle, subject to Public Hearing,\nand the conditions contained in Appendix B.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n• Vancouver Plan (2022)\n• Cambie Corridor Plan and Cambie Corridor Public Realm Plan (2018)\n• Housing Needs Report (2022)\n• Family Room: Housing Mix Policy for Rezoning Projects (2016)\n• High-Density Housing for Families with Children Guidelines (1992, last amended 2020)\n• Green Buildings Policy for Rezonings (2010, last amended 2023)\n• Tenant Relocation and Protection Policy (2015, last amended 2019)\n• Urban Forest Strategy (2018)\n• Community Amenity Contributions Policy for Rezonings (1999, last amended 2023)\n• Development Cost Levy By-law No. 9755\n• Utilities Development Cost Levy By-law No. 12183\n• Latecomer Policy (2021)\nREPORT\nBackground/Context\n1. Site and Context\nThe site is a full block face along Cambie Street, between West 31st and 32nd Avenues\n(Figure 1). The frontage is approximately 92 m (301 ft.) along Cambie with a site depth of 38 m\n(124 ft.) for a total site area of 3,436 sq. m (36,985 sq. ft.). The site is comprised of four lots\nwhich contain four single-detached houses. At the time of rezoning application, there were five\ntenants for which the Tenant Relocation and Protection Policy (TRPP) applies.\nFigure 1: Location Map – Site and Context\nThe surrounding area is characterized by a mix of uses including Queen Elizabeth Park, as well\nas large institutional sites including BC Women’s and Children’s Hospitals, St. Vincent’s\nCampus of Care site, and the Heather Lands. The area is undergoing significant change, with\nbuildings approved or under construction up to six storeys along Cambie Street and up to\n28 storeys on the Heather Lands redevelopment site.\nNeighbourhood Amenities – The following amenities are within close proximity:\n• Parks: Queen Elizabeth Park (40 m), Hillcrest Park (650 m) and Oak Meadows Park\n(725 m).\n• Cultural/Community Spaces: Hillcrest Community Centre (788 m).\n• Institutional: BC Children’s and Women’s Hospital (600 m)\n• Childcare: Djavad Mowafaghian YMCA Child Care Centre (1 km), Little Oak Montessori\nChildren’s House (1 km), and JCC Shalom Out of School Care (1.5 km).\nLocal School Capacity – The site is within the catchment area of Carr Elementary School and\nHamber Secondary School. Per the Vancouver School Board (VSB)’s 2020 Long Range\nFacilities Plan, Carr Elementary School and Hamber Secondary School will be operating below\ncapacity in the coming years, with a utilization rate at 95% and 79% respectively by 2031.\nThe VSB report notes that overall enrolment trends for the wider area are changing. The VSB\ncontinues to explore options to reduce pressure on schools in this area, monitor development,\nand work with City staff to help plan for future growth.\n2. Policy Context\nVancouver Plan (2022) – The Vancouver Plan was approved by Council on July 22, 2022 and\nis a land use strategy to guide long-term growth of the city over the next 30 years. This plan will\nserve as a framework with further implementation planning work to follow over the next four\nyears. The site is located in the Cambie Corridor Plan, which is in alignment with the Vancouver\nPlan.\nHousing Needs Report – On April 27, 2022, Council resolved at a public meeting to receive\na Housing Needs Report by staff. Council must consider the most recent HNR when developing\na development plan or when amending a plan in relation to Council’s housing policies\nrespecting affordable housing, rental housing and special needs housing.\nThis rezoning application implements Council-approved directions as contained in the Cambie\nCorridor Plan, and is well supported by the data and findings within the HNR.\nCambie Corridor Plan – The site is located within the ‘Queen Elizabeth’ neighbourhood of the\nPlan. Subsection 4.5.4 considers rezoning for residential buildings up to six storeys, with choice\nof use at grade, and a suggested FSR range between 1.75 and 2.25. Density can be above or\nbelow this range, depending on form of development. An additional partial floor above the roof\nfor co-located common indoor and outdoor amenity space is also permitted.\nThere are several existing and planned commercial nodes nearby to provide commercial\nopportunities for residents, including Cambie Village, King Edward Mall, Oak",
    "maxPages": 4,
    "type": "text",
    "createDate": "2024-02-05T04:57:07.785Z",
    "updateDate": "2024-02-05T04:57:07.785Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/phea4SR.PDF",
    "text": "Page 1 of 2\nPUBLIC HEARING November 14, 2023\nSUMMARY AND RECOMMENDATION\n4. CD-1 REZONING: 3231-3245 Fraser Street and 675 East 17th Avenue\nSummary: To rezone 3231-3245 Fraser Street and 675 East 17th Avenue from C-2\n(Commercial) District to CD-1 (Comprehensive Development) District, to permit the\ndevelopment of a 14-storey mixed-use building with a partial 15th floor rooftop amenity area,\nwith commercial at-grade and 110 secured rental housing units, of which 20% of the residential\nfloor area will be secured as moderate income units, over three levels of underground parking.\nA floor space ratio of 6.9 and a maximum building height of 45.5 m (149 ft.) with additional\nheight to 47.5 m (156 ft.) for a partial 15th floor rooftop amenity area are proposed.\nApplicant: Anthem Fraser Developments LP\nReferral: This relates to the report entitled “CD-1 Rezoning: 3231-3245 Fraser Street and 675\nEast 17th Avenue”, dated October 3, 2023, (“Report”), referred to Public Hearing at the Council\nMeeting of October 17, 2023.\nRecommended Approval: By the General Manager of Planning, Urban Design and\nSustainability, subject to the following conditions as proposed for adoption by resolution of\nCouncil:\nA. THAT the application by Anthem Fraser Developments LP, on behalf of:\n• Anthem Fraser Developments Ltd., the registered owner of the lands located\nat 3231-3233 Fraser Street [PID 015-612-805; The North 1/2 of Lot 9\nBlock 92 District Lot 301 Plan 187], and\n• Mercer Properties (Fraser 17) Inc., the registered owner of the lands located\nat:\no 3237 Fraser Street [PID 015-612-813; The South 1/2 of Lot 9 Block 92\nDistrict Lot 301 Plan 187],\no 3245 Fraser Street [PID 015-612-856; The North 1/2 of Lot 10 Block 92\nDistrict Lot 301 Plan 187], and\no 675 East 17th Avenue [PID 015-612-864; The South 1/2 of Lot 10\nBlock 92 District Lot 301 Plan 187],\nto rezone a consolidation of the above properties from C-2 (Commercial) District to CD-1\n(Comprehensive Development) District to increase the maximum floor space ratio (FSR)\nfrom 3.5 to 6.9 and the maximum building height from 22.0 m (72 ft.) to 45.5 m (149.3 ft.)\nto permit the development of a 14-storey mixed-use building, and a maximum of 47.5 m\n(155.8 ft.) to accommodate a partial 15th floor rooftop amenity area, containing 110\nsecured rental housing units, of which 20% of the residential floor area will be secured\nas moderate income units, with commercial space on the ground floor generally as\npresented in the Report, be approved in principle;\nPage 2 of 2\nFURTHER THAT the draft CD-1 by-law, prepared for the Public Hearing in accordance\nwith Appendix A of the report, be approved in principle;\nFURTHER THAT the proposed form of development also be approved in principle,\ngenerally as prepared by BHA Architecture Inc., received January 5, 2023, provided that\nthe Director of Planning may allow minor alterations to this form of development when\napproving the detailed scheme of development;\nFURTHER THAT the above approvals be subject to the Conditions of Approval\ncontained in Appendix B of the report.\nB. THAT subject to approval in principle of the rezoning and the Housing Agreement\ndescribed in Part 2 of Appendix B of the report, the Director of Legal Services be\ninstructed to prepare the necessary Housing Agreement By-law for enactment prior to\nenactment of the CD-1 By-law, subject to such terms and conditions as may be required\nat the discretion of the Director of Legal Services, and the General Manager of Planning,\nUrban Design and Sustainability.\nC. THAT subject to approval of the CD-1 By-law, the application to amend the Sign By-law\nto establish regulations for the new CD-1, generally as set out in Appendix C of the\nreport, be approved\nD. THAT subject to approval of the CD-1 By-law, the Noise Control By-law be amended to\ninclude the CD-1, generally as set out in Appendix C of the report;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the\namendment to the Noise Control By-law at the time of enactment of the CD-1 By law.\nE. THAT Recommendations A through D be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the\napplicant or any other person, or obligation on the part of the City; and any\nexpenditure of funds or incurring of costs is at the risk of the person making the\nexpenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the Public Hearing shall not\nobligate the City to enact a by-law rezoning the property, and any costs incurred\nin fulfilling requirements imposed as a condition of rezoning are at the risk of the\nproperty owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any\nway be limited or directed in the exercise of their authority or discretion,\nregardless of when they are called upon to exercise such authority or discretion.\n[CD-1 Rezoning: 3231-3245 Fraser Street and 675 East 17th Avenue]",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T04:56:20.688Z",
    "updateDate": "2024-02-05T04:56:20.688Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/phea3SR.PDF",
    "text": "Page 1 of 2\nPUBLIC HEARING November 14, 2023\nSUMMARY AND RECOMMENDATION\n3. CD-1 REZONING: 430-440 West Pender Street\nSummary: To rezone 430-440 West Pender Street from DD (Downtown) District to CD-1 (Comprehensive Development) District, to permit the development of a 12-storey mixed-use building with a partial 13th floor rooftop amenity area, with commercial at-grade and 80 secured market rental housing units. A floor space ratio (FSR) of 8.42 and a maximum building height of 32.0 m (105 ft.) with additional height to 35.1 m (115 ft.) for a partial 13th floor rooftop common amenity space are proposed.\nApplicant: Architectural Collective Inc.\nReferral: This relates to the report entitled “CD-1 Rezoning: 430-440 West Pender Street”, dated October 3, 2023, (“Report”), referred to Public Hearing at the Council Meeting of October 17, 2023.\nRecommended Approval: By the General Manager of Planning, Urban Design and Sustainability, subject to the following conditions as proposed for adoption by resolution of Council:\nA. THAT the application by Architectural Collective Inc., on behalf of B West Pender Holdings Ltd., the registered owner of the lands located at 430-440 West Pender Street [Lots 4 and 3 Block 35 Lot 541 Plan 210; PIDs 015-488-161 and 015-488-152], to rezone the lands from DD (Downtown) to CD-1 (Comprehensive Development) District to increase the maximum floor space ratio (FSR) from 6.00 to 8.42 to permit the development of a 12-storey, mixed-use building containing 80 secured market rental units, with at-grade commercial uses generally as presented in the Report, be approved in principle;\nFURTHER THAT the draft CD-1 By-law, prepared for the Public Hearing in accordance with Appendix A of the Report, be approved in principle;\nFURTHER THAT the proposed form of development also be approved in principle, generally as prepared by Architectural Collective Inc., received on August 12, 2022 with revised drawings received on March 28, 2023, provided that the Director of Planning may allow minor alterations to this form of development when approving the detailed scheme of development;\nFURTHER THAT the above approvals be subject to the Conditions of Approval contained in Appendix B of the Report.\nB. THAT subject to approval in principle of the rezoning and the Housing Agreement described in Part 2 of Appendix B of the Report, the Director of Legal Services be instructed to prepare the necessary Housing Agreement By-law for enactment prior to enactment of the CD-1 By-law, subject to such terms and conditions as may be required\nPage 2 of 2\nat the discretion of the Director of Legal Services and the General Manager of Planning, Urban Design and Sustainability.\nC. THAT subject to approval in principle of the rezoning, the existing building known as the “Drier Block”, located at 430-434 West Pender Street [Lot 4 Block 35 District Lot 541 Plan 2010; PID 015-488-161] (the “heritage building”), be added to the Vancouver Heritage Register in the ‘C’ evaluation category.\nD. THAT subject to approval of the CD-1 By-law, the application to amend the Sign By-law to establish regulations for the new CD-1, generally as set out in Appendix C of the Report, be approved.\nE. THAT subject to approval of the CD-1 By-law, the Noise Control By-law be amended to include this CD-1, generally as set out in Appendix C of the Report;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the amendment to the Parking By-law at the time of enactment of the new CD-1 By-law.\nF. THAT Recommendations A through E be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; and any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the Public Hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\n[CD-1 Rezoning: 430-440 West Pender Street]",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T04:55:49.861Z",
    "updateDate": "2024-02-05T04:55:49.861Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/phea2SR.PDF",
    "text": "Page 1 of 2\nPUBLIC HEARING November 14, 2023\nSUMMARY AND RECOMMENDATION\n2. CD-1 REZONING: 1510 West 71st Avenue and 8733 Granville Street\nSummary: To rezone 1510 West 71st Avenue and 8733 Granville Street from C-2 (Commercial) District and RM-3A (Residential) District to CD-1 (Comprehensive Development) District, to permit the development of a six-storey mixed-use building, with commercial space at-grade and 74 secured market rental units. A height of 22.0 m (72 ft.) and a floor space ratio (FSR) of 3.38 are proposed.\nApplicant: Gradual Architecture Inc\nReferral: This relates to the report entitled “CD-1 Rezoning: 1510 West 71st Avenue and 8733 Granville Street”, dated October 3, 2023 (“Report”), referred to Public Hearing at the Council Meeting of October 17, 2023.\nRecommended Approval: By the General Manager of Planning, Urban Design and Sustainability, subject to the following conditions as proposed for adoption by resolution of Council:\nA. THAT the application by Gradual Architecture Inc. on behalf of:\n• 338888 (Granville) Holdings Ltd., the registered owners of 1510 West 71st Avenue [PID 025-626-680; Lot A Block E District Lot 318 Group 1 New Westminster District Plan BCP4778], and\n• 339999 Granville Holdings Ltd., the registered owners of 8733 Granville Street [Lots 4 and 5, Except the East 17 Feet and the West 4 Feet, Now Highways Block E District Lot 318 Plan 3022; PIDs 013-241-494 and 013-241-524 respectively],\nto rezone the lands from RM-3A (Residential) and C-2 (Commercial) Districts to CD-1 (Comprehensive Development) District to increase the floor space ratio (FSR) from 1.00 and 3.50 to 3.38 and the building height from 10.7 m (35.1 ft.) to 22.0 m (72 ft.), to permit the development of a six-storey mixed-use building containing 74 secured rental units, generally as presented in the Report, be approved in principle;\nFURTHER THAT the draft CD-1 By-law, prepared for the Public Hearing in accordance with Appendix A of the Report, be approved in principle;\nFURTHER THAT the proposed form of development also be approved in principle, generally as prepared by Gradual Architecture Inc., received November 10, 2022 with revisions received January 27, 2023, provided the Director of Planning may allow minor alterations to this form of development when approving the detailed scheme of development;\nPage 2 of 2\nFURTHER THAT the above approvals be subject to the Conditions of Approval contained in Appendix B of the Report.\nB. THAT subject to approval in principle of the rezoning and the Housing Agreement described in Part 2 of Appendix B of the Report, the Director of Legal Services be instructed to prepare the necessary Housing Agreement By-law for enactment prior to enactment of the CD-1 By-law, subject to such terms and conditions as may be required at the discretion of the Director of Legal Services and the General Manager of Planning, Urban Design and Sustainability.\nC. THAT subject to approval of the CD-1 By-law, the application to amend the Sign By-law to establish regulations for the CD-1, generally as set out in Appendix C of the Report, be approved.\nD. THAT subject to approval of the CD-1 By-law, the Noise Control By-law be amended to include this CD-1, generally as set out in Appendix C of the Report;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the amendment to the Noise Control By-law at the time of enactment of the CD-1 By-law.\nE. THAT Recommendations A to D be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; and any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the Public Hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\n[CD-1 Rezoning: 1510 West 71st Avenue and 8733 Granville Street]",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T04:55:13.007Z",
    "updateDate": "2024-02-05T04:55:13.007Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/phea1SR.PDF",
    "text": "Represented by Ardor Development Ltd. Page 1 of 2\nPUBLIC HEARING November 14, 2023\nSUMMARY AND RECOMMENDATION\n1. CD-1 REZONING: 5515-5525 Elizabeth Street\nSummary: To rezone 5515-5525 Elizabeth Street from R1-1 (Residential) District to CD-1 (Comprehensive Development) District, to permit the development of a four-storey residential building with a partial 5th floor rooftop amenity area with 27 strata-titled residential units. A floor space ratio of 2.0 and a maximum building height of 13.7 m (45 ft.) with additional height to 18.2 m (60 ft.) for a rooftop amenity and mechanical appurtenances are proposed.\nApplicant: Ardor Development Ltd.\nReferral: This relates to the report entitled “CD-1 Rezoning: 5515-5525 Elizabeth Street”, dated October 3, 2023 (“Report”), referred to Public Hearing at the Council Meeting of October 17, 2023.\nRecommended Approval: By the General Manager of Planning, Urban Design and Sustainability, subject to the following conditions as proposed for adoption by resolution of Council:\nA. THAT the application by Ardor Development Ltd., on behalf of:\n• Ardorhomes 5515 Elizabeth Holdings Ltd., the registered owner of 5515 Elizabeth Street [PID 010-685-715; Lot 24 Block 849 District Lot 526 Plan 7240]; and\n• 1396947 B.C. Ltd., Inc. 1, the registered owner of 5525 Elizabeth Street [PID 004-286-464; Lot 23 Block 849 District Lot 526 Plan 7240];\nto rezone the lands from R1-1 (Residential) District to CD-1 (Comprehensive Development) District, to increase the floor space ratio (FSR) from 0.7 to 2.0 and the building height from 10.7 m (35 ft.) to 13.7 m (45 ft.), to permit a four storey residential building containing 27 strata titled residential units, generally as presented in the Report, be approved in principle;\nFURTHER THAT the draft CD-1 By-law, prepared for the Public Hearing in accordance with Appendix A of the Report, be approved in principle;\nFURTHER THAT the proposed form of development also be approved in principle, generally as prepared by Andrew Cheung Architects Inc., received December 15, 2022, provided that the Director of Planning may allow minor alterations to this form of development when approving the detailed scheme of development;\nFURTHER THAT the above approvals be subject to the Conditions of Approval contained in Appendix B of the Report.\nB. THAT subject to approval of the CD-1 By-law, the Subdivision By-law be amended, generally as set out in Appendix C with reference to R1-1 not RS-1;\nPage 2 of 2\nFURTHER THAT the Director of Legal Services be instructed to bring forward the amendment to the Subdivision By-law at the time of enactment of the new CD-1 By-law.\nC. THAT Recommendations A and B be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; and any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the Public Hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\n[CD-1 Rezoning: 5515-5525 Elizabeth Street]",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T04:54:37.895Z",
    "updateDate": "2024-02-05T04:54:37.895Z"
  },
  {
    "url": "https://council.vancouver.ca/20231116/documents/phea2sr.pdf",
    "text": "Page 1 of 2\nPUBLIC HEARING November 16, 2023\nSUMMARY AND RECOMMENDATION\n2. REZONING: 6065-6075 Collingwood Place\nSummary: To rezone 6065-6075 Collingwood Place from R1-1 (Residential) District to RR-2B (Residential Rental) District, to permit the development of a five-storey rental building. A height of 16.8 m (55 ft.) and a floor space ratio (FSR) of 2.40 are proposed.\nApplicant: Strand Holdings Ltd.\nReferral: This relates to the report entitled “Rezoning: 6065-6075 Collingwood Place”, dated August 29, 2023, (“Report”), referred to Public Hearing at the Council Meeting of October 17, 2023.\nRecommended Approval: By the General Manager of Planning, Urban Design and Sustainability, subject to the following conditions as proposed for adoption by resolution of Council:\nA. THAT the application, by Strand Holdings Ltd., on behalf of:\n• James Stephen Lebedovich and Silse Eileen Lebedovich, the registered owners of 6065 Collingwood Place [PID 009-858-067; Lot 8 Block 4 District Lot 2027 Plan 8976]; and\n• Joanne Wong, the registered owner of 6075 Collingwood Place [PID 009-8 58-075; Lot 9 Block 4 District Lot 2027 Plan 8976];\nto rezone the lands from R1-1 (Residential) District to RR-2B (Residential Rental) District, generally as presented in the Report, be approved in principle;\nFURTHER THAT the draft zoning amendment by-law, prepared for the Public Hearing in accordance with Appendix A of the Report, be approved in principle;\nAND FURTHER THAT the above approvals be subject to the Conditions of Approval contained in Appendix B of the Report.\nB. THAT subject to approval in principle of the rezoning and the Housing Agreement described in Part 2 of Appendix B of the Report, the Director of Legal Services be instructed to prepare the necessary Housing Agreement By-law for enactment prior to enactment of the zoning amendment By-law, subject to such terms and conditions as may be required at the discretion of the Director of Legal Services and the General Manager of Planning, Urban Design and Sustainability.\nPage 2 of 2\nC. THAT subject to approval of the zoning amendment by-law, the Subdivision By-law be amended generally as set out in Appendix C of the Report;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the amendment to the Subdivision By-law at the time of enactment of the zoning amendment by-law.\nD. THAT Recommendations A to C be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the public hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\n[Rezoning: 6065-6075 Collingwood Place]",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T04:54:09.906Z",
    "updateDate": "2024-02-05T04:54:09.906Z"
  },
  {
    "url": "https://council.vancouver.ca/20231116/documents/phea1sr.pdf",
    "text": "Page 1 of 2\nPUBLIC HEARING November 16, 2023\nSUMMARY AND RECOMMENDATION\n1. REZONING: 3529-3589 Arbutus Street and 2106 West 19th Avenue\nSummary: To rezone 3529-3589 Arbutus Street and 2106 West 19th Avenue from R1-1 (Residential) District to RR-2B (Residential Rental) District, to permit the development of a five-storey rental building. A height of 16.8 m (55 ft.) and a floor space ratio (FSR) of 2.40 are proposed.\nApplicant: Andrew Cheung Architects, Inc.\nReferral: This relates to the report entitled “Rezoning: 3529-3589 Arbutus Street and 2106 West 19th Avenue”, dated October 3 , 2023, (“Report”), referred to Public Hearing at the Council Meeting of October 17, 2023.\nRecommended Approval: By the General Manager of Planning, Urban Design and Sustainability, subject to the following conditions as proposed for adoption by resolution of Council:\nA. THAT the application by Andrew Cheung Architects Inc., on behalf of DXX Investments Ltd., the registered owners of the lands located at:\n• 3529-3589 Arbutus Street [Lots 10 to 13 Block 531 District Lot 526 Plan 4998; PIDs 010-724-559, 011-259-671, 007-550-341, 011-259-698 respectively];\n• 2106 West 19th Avenue [Lot 9 Block 531 District Lot 526 Plan 4998; PID 011-259-655];\nto rezone the lands from R1-1 (Residential) District to RR-2B (Residential Rental) District, generally as presented in the Report, be approved in principle;\nFURTHER THAT the draft zoning amendment by-law, prepared for the Public Hearing in accordance with Appendix A of the Report, be approved in principle;\nAND FURTHER THAT the above approvals be subject to the Conditions of Approval contained in Appendix B of the Report.\nB. THAT subject to approval in principle of the rezoning and the Housing Agreement described in Part 2 of Appendix B, the Director of Legal Services be instructed to prepare the necessary Housing Agreement By-law for enactment prior to enactment of the zoning amendment By-law, subject to such terms and conditions as may be required at the discretion of the Director of Legal Services and the General Manager of Planning, Urban Design and Sustainability.\nPage 2 of 2\nC. THAT subject to approval of the zoning amendment by-law, the Subdivision By- law be amended generally as set out in Appendix C of the Report;\nFURTHER THAT the Director of Legal Services be instructed to bring forward the amendment to the Subdivision By-law at the time of enactment of the zoning amendment by-law.\nD. THAT Recommendations A to C be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; and any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost;\n(ii) THAT any approval that may be granted following the Public Hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and\n(iii) THAT the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\n[Rezoning: 3529-3589 Arbutus Street & 2106 West 19th Avenue]",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T04:53:41.768Z",
    "updateDate": "2024-02-05T04:53:41.768Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1048670736.pdf",
    "text": "City of Richmond\nThe Council of the City of Richmond enacts as follows: \n1. Consolidated Fees Bylaw No. 8636, Amendment Bylaw No. 10486\nThe Consolidated Fees Bylaw No. 8636, as amended, is further amended: \na) by deleting the schedules attached to Bylaw No. 8636, as amended, and substituting the schedules attached to and forming part of this Bylaw. \nThis Bylaw comes into force and effect on January 1, 2024. \nThis Bylaw is cited as \"Consolidated Fees Bylaw No. 8636, Amendment Bylaw No. 10486\". \nFIRST READING \nSECOND READING \nTHIRD READING \nADOPTED Bylaw 10486 \nMAYOR \nDocument Number: 7335580 \nCNCL-244 \nOCT 10 2023. \nOCT 10 2023 \nOCT 10 2023 \nCORPORATE OFFICER \nCity of RICHMOND \nAPPROVED foreby originating dept. \nAPPROVED for legality by SolicitorSchedules to Bylaw 10486\nSCHEDULE - ANIMAL CONTROL REGULATION\nAnimal Control Regulation Bylaw No. 7932\nCat Breeding Permit Fee\nSection 2.2 Description\nCat breeding permit for three years\n\nAnimal Control Regulation Bylaw No. 7932\nImpoundment Fees\nSection 8 Description\n1st time in any calendar year\nNeutered male or spayed female dog\nNon-neutered male or unspayed female dog\nDangerous Dog\n\n2nd time in any calendar year\nNeutered male or spayed female dog\nNon-neutered male or unspayed female dog\nDangerous Dog*\n\n3rd time and subsequent times in any calendar year\nNeutered male or spayed female dog\nNon-neutered male or unspayed female dog\nDangerous Dog\nBird\nDomestic farm animal\nOther animal\nImpoundment fee also subject to transportation costs\n\n7335580 Fee $47.25\nCNCL-245 Fee Page 2 $54.00\n$162.00\n$662.00\n$107.00\n$335.00\n$1,314.00\nImpoundment fee also subject to transportation costs\n*Subject always to the power set out in Section 8.3.12 of Animal Control Regulation Bylaw No. 7932 to apply for an order that a dog be destroyed.\n\nNote: In addition to the fees payable above (if applicable), a license fee will be charged where a dog is not currently licensed.\n\n$335.00\n$662.00\n$1,314.00\n$8.25\n$80.25\n$40.50",
    "maxPages": 2,
    "type": "image",
    "createDate": "2024-02-05T01:22:45.030Z",
    "updateDate": "2024-02-05T01:22:45.030Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Application_by_Terra_8120_Number_1_Road_Limited_Partnership_for_Rezoning70635.pdf",
    "text": "7401059\nReport to Committee\nTo: Planning Committee\nDate: October 25, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 21-945869\nRe: Application by Terra 8120 Number 1 Road Limited Partnership for Rezoning at 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” Zone to the “Low Density Townhouses (RTL4)” Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10498, for the rezoning of 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, be introduced and given first reading.\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing\nCONCURRENCE OF GENERAL MANAGER\nCity of Richmond\nPLN - 7\nOctober 25, 2023 - 2 - RZ 21-945869\n7401059\nStaff Report\nOrigin\nTerra 8120 Number 1 Road Limited Partnership (on behalf of Cliff Chun and Kai Shen Hsiung of 1296168 BC Ltd. and Yi Jen Wang and Kai Shen Hsiung of Terra West Properties Ltd.) has applied to the City of Richmond for permission to rezone 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, to permit the development of nine townhouse units, with vehicle access from No. 1 Road. A location map and aerial photo of the subject site are provided in Attachment 1.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is provided in Attachment 2.\nExisting Site Condition and Context\nA survey of the subject site is included in Attachment 3. The subject site consists of two lots located on the east side of No. 1 Road, between Blundell Road and Coldfall Road.\nSubject Site Existing Housing Profile\nThe subject site consists of two lots, each containing a single-family dwelling that is tenant occupied. The existing dwellings are proposed to be demolished. The applicant has indicated that the tenants are aware of the redevelopment proposal and the applicant will ensure compliance with the Residential Tenancy Act.\nSurrounding Development\nExisting development immediately surrounding the subject site is as follows:\nTo the North: Are three lots, two with newer construction zoned “Compact Single Detached (RC1)” and one zoned “Single Detached (RS1/E)”, each containing a single-family dwelling.\nTo the South: Is a lot zoned “Single Detached (RS1/E)”, containing a single-family dwelling. Beyond that is a large lot zoned “Low Density Townhouses (RTL4)”, containing 28 townhouses.\nTo the East: Are lots zoned “Single Detached (RS1/B)”, each containing a single-family dwelling fronting Corless Place.\nTo the West: Across No. 1 Road are compact lots zoned “Single Detached (RS1/K)” and “Compact Single Detached (RC1)”, each containing a single-family dwelling.\nPLN - 8\nOctober 25, 2023 - 3 - RZ 21-945869\n7401059\nRelated Policies & Studies\nOfficial Community Plan\nThe Official Community Plan (OCP) land use designation for the subject properties is “Neighbourhood Residential”. This redevelopment proposal is consistent with this designation.\nArterial Road Land Use Policy\nLand Use Designation\nThe Arterial Road Land Use Policy designation for the subject properties is “Arterial Road Townhouse”, subject to the development criteria in the Policy. This redevelopment proposal is consistent with this designation.\nLot Width and Residual Lots\nThe development criteria for townhouses in the Arterial Road Land Use Policy call for land assembly with a minimum 50 m frontage on a major arterial road and avoiding the creation of residual sites with less than a 50 m frontage. The Policy also recognizes that land assembly with existing narrow lots or on lots containing newer dwellings will be difficult to redevelop. The Policy provides flexibility for the minimum frontage in these circumstances provided the application can meet other guidelines and requirements. This includes the ability to consolidate vehicle access points and securing shared access by means of a Statutory Right-of-Way (SRW) agreement to adjacent properties to enable their potential redevelopment in the future.\nAlthough this redevelopment proposal involves land assembly with a frontage less than 50 m on No. 1 Road (i.e., 40 m), staff support the application for the following reasons:\nx The applicant has provided documentation indicating that efforts have been made in 2021 and 2023 to acquire the property to the south at 8180 No. 1 Road in order to achieve the minimum arterial road frontage width of 50 m, but that the owner is not interested in redeveloping their property at this time.\nx Due to existing newer development and unique lot geometry immediately north of the subject site, the applicant has indicated that it is not financially feasible to pursue land assembly with those properties as part of this redevelopment proposal.\nx The applicant has submitted a preliminary concept plan to show how the neighbouring properties to the north and south could redevelop in the future with shared vehicle access through the subject site (a copy of which is on file).\nx Prior to final adoption of the rezoning bylaw, the applicant must register a SRW agreement on Title for public right-of-passage over the entire drive-aisle and on-site truck turnaround area opposite the site entry to secure future shared access to sites to the south and north. The SRW agreement is to contain language to indicate that the on-site truck turnaround area opposite the site entry can be removed from the SRW area and used as additional outdoor amenity space for the sole use of the subject development when the adjacent property to the south is redeveloped for townhouses and on-site truck turnaround is accommodated by creating a T-intersection of the drive-aisles on the lots.\nPLN - 9",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:22:18.718Z",
    "updateDate": "2024-02-05T01:22:18.718Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Application_by_Navreet_Gill_for_Rezoning_at_11831_11833_Seabrook_Crescent70634.pdf",
    "text": "7409688\nReport to Committee\nTo: Planning Committee\nDate: October 23, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 22-010976\nRe: Application by Navreet Gill for Rezoning at 11831/11833 Seabrook Crescent from the \"Single Detached (RS1/E)\" Zone to the \"Single Detached (RS2/B)\" Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10510, for the rezoning of 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone, be introduced and given first reading.\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing \nCONCURRENCE OF GENERAL MANAGER\nCity of Richmond\nPLN - 39\nOctober 23, 2023 - 2 - RZ 22-010976\n7409688\nStaff Report\nOrigin\nNavreet Gill has applied on behalf of the property owners, 1303287 B.C. Ltd. (Balraj Singh Sanghera and Rajbir Kaur Chatha), to rezone 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone in order to permit the property to be subdivided into two single-family lots, each with vehicle access from Seabrook Crescent. A location map and aerial photo are provided in Attachment 1. The proposed subdivision plan and draft site plan are provided in Attachment 2.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile\nThe subject site contains an existing un-stratified non-conforming duplex (two-unit dwelling), which will be demolished prior to subdivision. Both dwelling units are currently tenant occupied and do not contain any secondary suites. The applicant has indicated that the tenants are aware of the redevelopment proposal and the applicant will ensure compliance with the Residential Tenancy Act.\nSurrounding Development\nDevelopment immediately surrounding the site is as follows:\nTo the North: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the South: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the East: Across the lane, an existing duplex on a lot zoned “Single Detached (RS1/E)” fronting onto No. 5 Road. There is a Rezoning application and Development Permit (RZ 22-019002/DP 23-028942) at 10111/10113 No. 5 Road to permit the development of three front-back duplex lots. The rezoning application received third reading on October 16, 2023.\nTo the West: Across Seabrook Crescent, an existing duplex on a lot zoned “Single Detached (RS1/E)”.\nRelated Policies & Studies\nOfficial Community Plan\nThe subject site is designated as “Neighbourhood Residential” in the Official Community Plan (OCP). This proposal is consistent with this OCP designation.\nPLN - 40\nOctober 23, 2023 - 3 - RZ 22-010976\n7409688\nSingle-Family Lot Size Policy 5434/ Zoning Bylaw 8500\nThe subject property is located within the area covered by Lot Size Policy 5434, adopted by City Council in 1990, amended in 1991 and 2006 (Attachment 4). The Policy permits a majority of lots within the Policy Area (including the subject property) to be rezoned and subdivided in accordance with the provisions of the “Single Detached (RS1/E)” zone.\nThe subject site is currently occupied by a legal duplex. Section 2.3.7 of Richmond Zoning Bylaw 8500 provides that the Lot Size Policy does not apply to a rezoning that a legal duplex and which are intended to be subdivided into no more than two single-family lots. The proposed rezoning and subdivision complies with Section 2.3.7 and would result in the creation of two single-family lots being 444.9 m2 and 450.2 m2 in area. Further, the proposed rezoning and subdivision would comply with the minimum lot dimensions and size applicable to the “Single Detached (RS2B)” zone.\nMinistry of Transportation & Infrastructure Approval\nAs the subject site is located within 800 m of an intersection of a Provincial Limited Access Highway and a City road, this redevelopment proposal was referred to the Ministry of Transportation and Infrastructure (MOTI) for review and comment. Preliminary confirmation has been received from MOTI indicating that they have no objections to the proposed redevelopment. Final approval from MOTI is required prior to final adoption of the rezoning bylaw.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nPLN - 41",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:21:38.891Z",
    "updateDate": "2024-02-05T01:21:38.891Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_4-_Application_-_10840_10860_Bonavista_Gate70723.pdf",
    "text": "7349947\nReport to Committee\nTo: Planning Committee\nDate: October 3, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 22-011063\nRe: Application by Pati Yik of Kennon Construction for Rezoning at 10840/10860 Bonavista Gate from the “Two-Unit Dwellings (RD1)” Zone to the “Single Detached (RS2/C)” Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10497, for the rezoning of 10840/10860 Bonavista Gate from the “Two-Unit Dwellings (RD1)” zone to the “Single Detached (RS2/C)” zone, be introduced and given first reading.\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing\nCONCURRENCE OF GENERAL MANAGER COF G\nPH - 111\nOctober 3, 2023 - 2 - RZ 22-011063\n7349947\nStaff Report\nOrigin: Pati Yik of Kennon Construction has applied on behalf of the property owners, Thomas Mau Shing Ng, Ling Y Ha and Shui Ting Chua to the City of Richmond to rezone 10840 and 10860 Bonavista Gate from the “Two-Unit Dwellings (RD1)” zone to the “Single Detached (RS2/C)” zone in order to subdivide the existing duplex lot into two single-family lots, each with vehicle access from Bonavista Gate (Attachment 1). The proposed subdivision plan and site plan are provided in Attachment 2.\nFindings of Fact: A Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile: This site is currently occupied by an existing duplex (two-family) dwelling, which will be demolished prior to subdivision. The existing two-family dwelling is owner-occupied and does not contain any secondary suites.\nSurrounding Development: Development immediately surrounding the site is as follows: To the North: An existing strata-titled duplex on a lot zoned “Single Detached (RS1/E)”. To the South: Existing single detached houses on a lot zoned “Single Detached (RS1/E)”. To the East: An existing strata-titled duplex on a lot zoned “Two-Unit Dwellings (RD1)”. To the West: Single family dwellings on lots zoned “Single Detached (RS1/E)” across Bonavista Gate.\nRelated Policies & Studies: Official Community Plan/Steveston Area Plan: The property is designated as Neighbourhood Residential in the Official Community Plan (OCP), and as Single Family in the Steveston Area Plan (Attachment 4). This proposal is consistent with both of those land use designations. Floodplain Management Implementation Strategy: The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPH - 112\nOctober 3, 2023 - 3 - RZ 22-011063\n7349947\nPublic Consultation: A rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property. Should the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment. Public notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nAnalysis: Proposed Rezoning and Subdivision: The applicant is proposing to rezone the subject site and subdivide it into two single-family lots, each with a secondary suite, with access from Bonavista Gate. This development proposal is consistent with development in the area. The proposed subdivision plan and site plan are shown in Attachment 2. Staff worked with the applicant to modify the building envelope to enable retention of trees on site at the front and rear of the property. Existing Legal Encumbrances: There is a 3.0 m wide Statutory Right-of-Way (SRW) in the backyard along the eastern property line for sanitary sewer utility purposes. The applicant has been advised that encroachment into the SRW is not permitted. A City Covenant is registered on both 10840 and 10860 Bonavista Gate Titles that restrict the development to a duplex, therefore, the duplex covenants must be discharged from Title prior to the final adoption of the rezoning bylaw. There is a Land Tax Deferment Act Agreement currently registered on the 10840 Bonavista Gate Title (proposed Lot A), which allows the property owner to defer the payment of taxes. All deferred taxes must be paid and the agreement must be discharged from Title prior to the preparation and registration of any legal documents associated with this rezoning application. Transportation and Site Access: Vehicle access is proposed to be from Bonavista Gate for both of the proposed lots. The existing driveways will be removed and new driveways will be constructed as detailed in the Site Servicing and Frontage Improvements sub-section of this report. Two parking spaces will be provided for each dwelling unit in the garage.\nPH - 113",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:21:03.664Z",
    "updateDate": "2024-02-05T01:21:03.664Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_3_-_Application_-_Interface_Architecture_Inc70721.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: September 18, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 21-939470\nRe: Application by Interface Architecture Inc. for Rezoning at 5471, 5491/5493, 5531, 5551, 5571, 5591, 5595, 5611/5613 Steveston Highway from “Single Detached (RS1/B)” Zone, “Single Detached (RS1/E)” Zone and “Two-Unit Dwellings (RD1)” Zone to “Medium Density Townhouses (RTM2)” Zone\nStaff Recommendation\nThat Richmond Zoning Bylaw 8500, Amendment Bylaw 10496, for the rezoning of 5471, 5491/5493, 5531, 5551, 5571, 5591, 5595, 5611/5613 Steveston Highway from “Single Detached (RS1/B)” zone, “Single Detached (RS1/E)” zone and “Two-Unit Dwellings (RD1)” zone to the “Medium Density Townhouses (RTM2)” zone, be introduced and given first reading.\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:el\nAtt. 7\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing \nCONCURRENCE OF GENERAL MANAGER\nPH - 53\nStaff Report\nOrigin\nInterface Architecture Inc., on behalf of Steveston Townhouse Ventures Inc. (Incorporation number: BC1293948; Director: Barry Cavanaugh & Robert Arthur Barker), has applied to the City of Richmond for permission to rezone 5471, 5491/5493, 5531, 5551, 5571, 5591, 5595, 5611/5613 Steveston Highway (Attachment 1) from “Single Detached (RS1/B)” zone, “Single Detached (RS1/E)” zone and “Two-Unit Dwellings (RD1)” zone to the “Medium Density Townhouses (RTM2)” zone in order to permit the development of 30 townhouse units with seven secondary suites and a right-in/right-out vehicle access from Steveston Highway.\nProject Description\nThe eight properties (ten units) under this application have a total combined frontage of approximately 151 m along Steveston Highway and a 22 m frontage along Lassam Road; these properties will be required to be consolidated into one development parcel prior to final adoption of the rezoning bylaw. The proposed density is 0.65 floor area ratio (FAR). The site layout includes 12 two-storey units and 18 three-storey units in ten townhouse clusters. Seven secondary suites and five accessible units are included in this proposal. Vehicle access is provided by a single right-in/right-out driveway access to Steveston Highway. A preliminary site plan, building elevations and landscape plan are contained in Attachment 2.\nA Servicing Agreement will be required for the design and construction of frontage beautification works and service connections.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile\nThe subject site currently contains six single-family homes and four duplex units. The applicant advised that there are no secondary suites in the homes and that all ten homes are currently tenanted. The developer advised that they have made these homes available to tenants at half the market rates with the clear understanding from all tenants that these are short term rentals within a development site and the homes will be demolished and legal notice to end tenancies in keeping with the Residential Tenancy Act will be issued.\nSurrounding Development\nExisting development immediately surrounding the subject site is as follows:\nTo the North: Existing single-family dwellings on lots zoned “Single Detached (RS1/B)”.\nTo the South: Across Steveston Highway, existing single-family dwellings on lots zoned “Single Detached (RS1/D)” and “Single Detached (RS1/E)”.\nPH - 54\nTo the East: Across Lassam Road, existing single-family dwellings on lots zoned “Single Detached (RS1/B)”.\nTo the West: A recently constructed 28-unit townhouse complex on a lot zoned “Medium Density Townhouses (RTM2)”.\nRelated Policies & Studies\nOfficial Community Plan/Steveston Area Plan\nThe 2041 Official Community Plan (OCP) Land Use Map designation for the subject site is “Neighbourhood Residential”. The Steveston Area Land Use Map designation for the subject site is “Multiple-Family”. This redevelopment proposal for 30 townhouses is consistent with these designations.\nArterial Road Land Use Policy\nThe Arterial Road Land Use Policy in the City’s 2041 OCP (Bylaw 9000), directs appropriate townhouse development onto certain arterial roads outside the City Centre. The subject site is identified for “Arterial Road Townhouse” on the Arterial Road Housing Development Map and the proposal is in compliance with the Townhouse Development Requirements under the Arterial Road Policy.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nAnalysis\nBuilt Form and Architectural Character\nThe applicant proposes to consolidate the eight properties into one development parcel, with a total net site area of 6,214 m2. The proposal consists of 30 townhouses, in a mix of two-storey and three-storey townhouse units in 10 clusters.\nPH - 55",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:20:21.581Z",
    "updateDate": "2024-02-05T01:20:21.581Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_2_-_Application_-_Hari_Singh_Gill_for_Rezoning_at_3300_Granville_Ave70720.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: September 18, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 22-026766\nRe: Application by Hari Singh Gill for Rezoning at 3300 Granville Avenue from \"Single Detached (RS1/E)\" Zone to \"Single Detached (RS2/B)\" Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10495, for the rezoning of 3300 Granville Avenue from “Single Detached (RS1/E)” zone to “Single Detached (RS2/B)” zone, be introduced and given first reading.\nREPORT CONCURRENCE ROUTED TO: CONCURRENCE\nAffordable Housing \nCONCURRENCE OF GENERAL MANAGER PH - 32\nStaff Report\nOrigin: Hari Singh Gill has applied to rezone the property at 3300 Granville Avenue from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone to allow the property to be subdivided into two single-family lots (Attachment 1). Vehicle access is proposed to be from Granville Avenue. The proposed subdivision plan is shown in Attachment 2.\nFindings of Fact: A Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile: This site is currently occupied by an existing single-family dwelling, which will be demolished prior to subdivision. The existing single-family dwelling is unoccupied and does not contain a secondary suite.\nSurrounding Development: Development immediately surrounding the site is as follows:\nTo the North: Across Granville Avenue, single detached houses zoned “Single Detached – Terra Nova (ZS2)”; and townhouses zoned “Town Housing – Granville Avenue (Terra Nova) and Dixon Avenue (Ash Street Sub Area) (ZT20)”.\nTo the South: Fronting onto Lockhart Road, single detached houses zoned “Single Detached (RS2/B)”.\nTo the East: Along Granville Avenue, single detached houses zoned “Single Detached (RS1/B)” and “Single Detached (RS1/E)”.\nTo the West: Along Granville Avenue, single detached houses zoned “Single Detached (RS1/B)” and “Single Detached (RS1/E)”; and zoned “Single Detached (RS1/K)” along Marrington Road.\nRelated Policies & Studies\nOfficial Community Plan (OCP Designation): The Official Community Plan (OCP) land use designation for the subject property is “Neighbourhood Residential” (NRES). The proposed rezoning and subdivision application is consistent with this designation.\nLot Size Policy 5447: The subject property falls within Single-Family Lot Size Policy 5447, which allows for the subdivision of the subject property consistent with the R1/B zone (Attachment 4). The rezoning and subdivision proposed in this application is consistent with this Lot Size Policy.\nFloodplain Management Implementation Strategy: The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation: A rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property. Should the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment. Public notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nAnalysis\nProposed Rezoning and Subdivision: The applicant is proposing to rezone the subject site and subdivide into two single-family lots, each with a one bedroom secondary suite. This development proposal is consistent with the redevelopment along this block of Granville Avenue, including the adjacent properties. The proposed subdivision plan is shown in Attachment 2.\nExisting Legal Encumbrances: There is an existing Statutory Right-of-Way (SRW) for the City in the rear yard for sanitary sewer services. The applicant has been advised that encroachment into the SRW is not permitted.\nTransportation and Site Access: Vehicle access is proposed to be from Granville Avenue. The existing driveway will be removed and new driveways will be constructed through a Servicing Agreement as detailed in the Site Servicing and Frontage Improvements sub-section of this report. PH - 34",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:19:38.001Z",
    "updateDate": "2024-02-05T01:19:38.001Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_1_-_Application_-_Matthew_Cheng_-_7300_St70719.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: September 18, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 21-943417\nRe: Application by Matthew Cheng for Rezoning at 7300 St. Albans Road from \"Single Detached (RS1/E)\" Zone to \"High Density Townhouses (RTH1)\" Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10494, for the rezoning of 7300 St. Albans Road from \"Single Detached (RS1/E)\" zone to \"High Density Townhouses (RTH1)\" zone, be introduced and given first reading.\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:ak\nAtt. 6\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing \nC\nONCURRENCE OF GENERAL MANAGER\nPH - 5\nStaff Report\nOrigin\nMatthew Cheng, on behalf of 1124053 B.C. LTD (Director: Pavendeep Kooner), has applied to the City of Richmond for permission to rezone 7300 St. Albans Road from the \"Single Detached (RS1/E)\" zone to the \"High Density Townhouses (RTH1)\" zone to permit the development of four townhouse units with one secondary suite (Attachment 1).\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 2).\nSubject Site Existing Housing Profile\nThe subject site contains an unoccupied single-family dwelling.\nSurrounding Development\nThe subject site fronts St. Albans Road. Existing development immediately surrounding the subject site is as follows:\nTo the North: The St. Albans' Anglican Church zoned \"Assembly (ASY)\".\nTo the South: A seven-unit townhouse complex zoned \"Medium Density Low Rise Apartments (RAM1)\".\nTo the East: A 36-unit townhouse complex zoned \"Medium Density Low Rise Apartments (RAM1)\".\nTo the West: Across St. Albans Road, a three-storey apartment (over a single-storey parking structure) zoned \"Medium Density Low Rise Apartments (RAM1)\".\nExisting Legal Encumbrances\nThere is a City Statutory Right-of-Way (SRW) registered on Title of the subject property for the sanitary sewer located along the east property line. The applicant has been advised that encroachment into the SRW is not permitted.\nRelated Policies & Studies\nOfficial Community Plan/City Centre Area Plan\nThe subject property is designated as \"Neighbourhood Residential\" in the Official Community Plan (OCP). The subject property is also located within the City Centre Area, Schedule 2.10 of the OCP and is designated \"Sub-Area B.1: Mixed Used - Low Rise Residential & Limited Commercial\" which is intended for grade-oriented housing in the form of townhouses with a common parking structure of conventional and stacked townhouses.\nPH - 6\nThe proposed development provides for a similar form to the adjacent development to the south and the preliminary design complies with the Sub-Area B.1 guidelines in terms of land use, density and overall neighbourhood character. At the Development Permit (DP) stage, the townhouses' design, form and character will be further reviewed.\nAs set out in the City Centre Area Plan, the applicant is required to provide a contribution at a rate of $0.34 per buildable square foot for future City Community Planning studies.\nRegistration of a legal agreement on Title is required, ensuring that future owners are aware that the development is subject to potential impacts due to other developments that may be approved within the City Centre.\nSt. Albans Sub-Area Plan\nThe proposed development is consistent with the Multi-Family Low Rise land use designation in the St. Albans Sub-Area Plan, which envisions three-storey apartments, townhouses, two-family or single-family dwellings (Attachment 3). The proposal for four three-storey townhouse units and one secondary suite is also generally consistent with the surrounding developments.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not yet received any comments from the public about the rezoning application in response to the rezoning sign on site.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the public will have an opportunity to further comment on all of the proposed amendments at a Public Hearing.\nPublic notification of the Public Hearing will be provided as per the Local Government Act and the City's Zoning Bylaw 8500.\nAnalysis\nBuilt Form and Architectural Character\nThe applicant proposes to construct a total of four townhouse units and one secondary suite with access from St. Albans Road. The layout of the townhouse units is oriented around a single driveway providing access to the site from St. Albans Road and a north-south internal maneuvering aisle providing access to the unit garages. A total of two three-storey duplex clusters are proposed.\nPH - 7",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:19:13.400Z",
    "updateDate": "2024-02-05T01:19:13.400Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1048770862.pdf",
    "text": "City of Richmond 7335387 The Council of the City of Richmond enacts as follows: I. Alexandra District Energy Utility Bylaw No. 8641, as amended, is further amended by deleting section 6.1 and replacing it with the following: Bylaw 10487 Alexandra District Energy Utility Bylaw No. 8641 Amendment Bylaw No. 10487 \"6.1 Service Connection and Energy Transfer Station (a) In order to provide the Services and bill a Customer for Energy delivered, the Service Provider will, subject to Section 6.3 (Supply and Installation of Service Connection and Energy Transfer Station by Customer) and Section 6.6 (Additional Service Connections, Energy Transfer Stations) below, serve each Designated Property with one Service Connection and one Energy Transfer Station. (b) If a Designated Property has more than one building, then each building on the Designated Property must have its own Energy Transfer Station, and the Customer must apply for such additional Energy Transfer Station(s) pursuant to Section 6.6 (Additional Service Connections, Energy Transfer Station) below. (c) The technical specifications of all Service Connections and Energy Transfer Stations and the components thereof will be determined by the Service Provider.\" Alexandra District Energy Utility Bylaw No. 8641, as amended, is further amended by deleting section 6.6 and replacing it with the following: \"6.6 Additional Service Connections, Energy Transfer Stations (a) A Customer may apply to the Service Provider for one or more additional Service Connections at a Designated Property, which additional Service Connection(s) together with the related Energy Transfer Station(s) may be provided at the sole discretion of the Service Provider. (b) A Customer may apply to the Service Provider for one or more additional Energy Transfer Stations at a Designated Property, which additional Energy Transfer Station(s) may be provided at the sole discretion of the Service Provider. (c) If the Service Provider agrees to install an additional Service Connection and/or Energy Transfer Station, the Service Provider may charge the Customer CNCL - 151Bylaw 10487 (d) Page 2 additional ETS and Service Connection Installation Fees for the provision, supply, delivery and installation of the additional Service Connection and/or Energy Transfer Station. The Service Provider may bill each additional Service Connection and/or Energy Transfer Station from a separate meter and account. The Alexandra District Energy Utility Bylaw No. 8641, as amended, is further amended by deleting Schedule C (Rates and Charges) in its entirety and replacing it with a new Schedule C attached as Schedule A to this Bylaw. This Bylaw is cited as \"Alexandra District Energy Utility Bylaw No. 8641, Amendment Bylaw No. 10487\" FIRST READING SECOND READING THIRD READING ADOPTED MAYOR CNCL - 152 NOV 14 2023 NOV 14 2023 NOV 14 2023 CORPORATE OFFICER CITY OF RICHMOND APPROVED for content by originating dept CR APPROVED for legally by So BRB Bylaw 10487 (d) Page 2 additional ETS and Service Connection Installation Fees for the provision, supply, delivery and installation of the additional Service Connection and/or Energy Transfer Station. The Service Provider may bill each additional Service Connection and/or Energy Transfer Station from a separate meter and account. The Alexandra District Energy Utility Bylaw No. 8641, as amended, is further amended by deleting Schedule C (Rates and Charges) in its entirety and replacing it with a new Schedule C attached as Schedule A to this Bylaw. This Bylaw is cited as \"Alexandra District Energy Utility Bylaw No. 8641, Amendment Bylaw No. 10487\" FIRST READING SECOND READING THIRD READING ADOPTED MAYOR CNCL - 152 NOV 14 2023 NOV 14 2023 NOV 14 2023 CORPORATE OFFICER CITY OF RICHMOND APPROVED for content by originating dept CR APPROVED for legally by So BRB",
    "maxPages": 2,
    "type": "image",
    "createDate": "2024-02-05T01:18:54.613Z",
    "updateDate": "2024-02-05T01:18:54.613Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Application_by_Gurjit_Pooni_for_Rezoning_at_10511_Lassam_Road70760.pdf",
    "text": "7404492\nReport to Committee\nTo: Planning Committee\nDate: November 6, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 22-011080\nRe: Application by Gurjit Pooni for Rezoning at 10511 Lassam Road from the “Single Detached RS1/E” Zone to the “Single Detached (RS2/B)” Zone\nStaff Recommendation\nThat Richmond Zoning Bylaw 8500, Amendment Bylaw 10513, for the rezoning of 10511 Lassam Road from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone, be introduced and given first reading.\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:ac\nAtt.6\nREPORT CONCURRENCE\nROUTED TO:CONCURRENCE\nAffordable Housing ;\nCONCURRENCE OF GENERAL MANAGER RRENCEOF GENER\nPLN - 7\nNovember 6, 2023 - 2 -RZ 22-011080\n7404492\nStaff Report\nOrigin\nOnyx Premier Homes Ltd. (Directors: Amar Gill and Jasdeep Uppal) have applied to the City of Richmond for permission to rezone 10511 Lassam Road from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone, to permit the property to be subdivided to create two single-family lots with access from Lassam Road. A map and aerial photograph showing the location of the subject site is included in Attachment 1. The proposed subdivision is provided in Attachment 2.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile\nThere is an existing single-family dwelling on the subject property which is currently vacant and proposed to be demolished. There are no existing secondary suites in the dwelling.\nSurrounding Development\nDevelopment immediately surrounding the subject site is as follows:\nTo the North: A school (James McKinney Elementary School) on a lot zoned “School & Institutional Use (SI)”, accessed from Lassam Road.\nTo the South: A single-family dwelling on a property zoned “Single Detached (RS1/B)”, accessed from Lassam Road.\nTo the East: Across Lassam Road, single-family dwellings on lots zoned “Single Detached (RS1/E)”, accessed from Lassam Road.\nTo the West: The parking area for a school (James McKinney Elementary School on a lot zoned “School & Institutional Use (SI)”, accessed from Lassam Road.\nRelated Policies & Studies\nOfficial Community Plan/Steveston Planning Area\nThe subject property is located in the Steveston planning area and is designated as “Neighbourhood Residential” in the Official Community Plan (OCP). The property is designated for “Single Family” use in the Steveston Area Plan. The proposed rezoning and subdivision are consistent with these designations.\nPLN - 8\nNovember 6, 2023 - 3 - RZ 22-011080\n7404492\nSingle Family Lot Size Policy 5420/Zoning Bylaw 8500\nThe subject property is located within the area covered by Lot Size Policy 5420, adopted by City Council in 1989, and subsequently amended by Council on August 7, 1992, and on August 21, 1995 (Attachment 4). The Policy permits properties along Lassam Road to be rezoned and subdivided in accordance with the provisions of the “Single Detached (RS2/B)” zone (minimum 12 m wide lots). Each proposed lot at the subject site will be approximately 12.6 m (41 ft.) wide and approximately 575 m² (6,189.25 ft²) in area which conforms to the RS2/B zone. The proposed rezoning complies with the Lot Size Policy.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nIn accordance with the City’s Early Public Notification Policy No. 1316, a notice of the development proposal was provided to residents within 100 metres of the subject site. In addition, a rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the early public notification or placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nAnalysis\nThis redevelopment proposes to rezone and subdivide an existing single-family lot into two new single-family lots with vehicular access for both new lots off Lassam Road. This rezoning and subdivision is consistent with the emerging lot fabric and vehicular access along Lassam Road.\nExisting Legal Encumbrances\nThere is an existing 3 m wide Statutory Right-of-Way (SRW) for City sanitary service that covers a small portion of the property in the southwest corner which will be expanded and widened northward with utility upgrades. The applicant has been advised that no building encroachment into the SRW is permitted.\nTransportation and Site Access\nThe subject site currently has vehicular access from a driveway letdown along Lassam Road. In accordance with the Residential Lot (Vehicular) Access Regulation Bylaw 7222, vehicle access to proposed Lot 1 and proposed Lot 2 will be from Lassam Road.\nPLN - 9",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-05T01:18:26.346Z",
    "updateDate": "2024-02-05T01:18:26.346Z"
  }
]