[
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1029470974.pdf",
    "text": "City of Richmond Richmond Zoning Bylaw 8500 Amendment Bylaw 10294 (ZT 21-930124) 13340 Smallwood Place Bylaw 10294 The Council of the City of Richmond, in open meeting assembled, enacts as follows: 1. Richmond Zoning Bylaw 8500, as amended, is further amended at Section 10.7 [Vehicle Sales (CV)] by: a) Adding Additional Uses (Section 10.7.3.B), renumbering the previous sections accordingly, and adding the following text into the Additional Uses (Section 10.7.3.B): \"Veterinary service\" b) Inserting the following as new Section 10.7.11.3, and renumbering the remaining sections accordingly: \"3. a) A veterinary service shall be permitted on the following listed site and is limited to one per site: 13340 Smallwood Place P.I.D. 000-955-558 Lot 5 Section 5 Block 4 North Range 5 West New Westminster District Plan 68775 b) Notwithstanding the definition of veterinary service, a veterinary service may include animal adoption services limited to the adoption of \"cats\" and \"kittens\" as defined in the Richmond Business Regulation Bylaw 7538 and no other animal. c) The total floor area of a veterinary service shall not exceed the total floor area of all other permitted uses on the site.\" 2. This Bylaw may be cited as \"Richmond Zoning Bylaw 8500, Amendment Bylaw 10294\". FIRST READING A PUBLIC HEARING WAS HELD ON SECOND READING 6735154 OCT 12 2021 CITY OF RICHMOND APPROVED \\ bJ \\-·· -- '-.) APPROVED by Director or Solicitor LB CNCL - 333 Bylaw 10294 THIRD READING MINISTRY OF TRANSPORTATION AND INFRASTRUCTURE APPROVAL OTHER CONDITIONS SATISFIED ADOPTED MAYOR Page 2 CORPORATE OFFICER CNCL - 334",
    "maxPages": 2,
    "type": "text",
    "createDate": "2024-02-05T00:52:28.755Z",
    "updateDate": "2024-02-05T00:52:28.755Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/3_-_Application_by_Gurjit_Pooni_for_Rezoning_at_10511_Lassam_Road70932.pdf",
    "text": "7404492\nReport to Committee\nTo: Planning Committee\nDate: November 6, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 22-011080\nRe: Application by Gurjit Pooni for Rezoning at 10511 Lassam Road from the \"Single Detached RS1/E\" Zone to the \"Single Detached (RS2/B)\" Zone\nStaff Recommendation\nThat Richmond Zoning Bylaw 8500, Amendment Bylaw 10513, for the rezoning of 10511 Lassam Road from the \"Single Detached (RS1/E)\" zone to the \"Single Detached (RS2/B)\" zone, be introduced and given first reading.\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:ac\nAtt.6\nREPORT CONCURRENCE\nROUTED TO:CONCURRENCE\nAffordable Housing ;\nCONCURRENCE OF GENERAL MANAGER RRENCEOF GENER\nPH - 56\nNovember 6, 2023 - 2 -RZ 22-011080\n7404492\nStaff Report\nOrigin\nOnyx Premier Homes Ltd. (Directors: Amar Gill and Jasdeep Uppal) have applied to the City of Richmond for permission to rezone 10511 Lassam Road from the \"Single Detached (RS1/E)\" zone to the \"Single Detached (RS2/B)\" zone, to permit the property to be subdivided to create two single-family lots with access from Lassam Road. A map and aerial photograph showing the location of the subject site is included in Attachment 1. The proposed subdivision is provided in Attachment 2.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile\nThere is an existing single-family dwelling on the subject property which is currently vacant and proposed to be demolished. There are no existing secondary suites in the dwelling.\nSurrounding Development\nDevelopment immediately surrounding the subject site is as follows:\nTo the North: A school (James McKinney Elementary School) on a lot zoned \"School & Institutional Use (SI)\", accessed from Lassam Road.\nTo the South: A single-family dwelling on a property zoned \"Single Detached (RS1/B)\", accessed from Lassam Road.\nTo the East: Across Lassam Road, single-family dwellings on lots zoned \"Single Detached (RS1/E)\", accessed from Lassam Road.\nTo the West: The parking area for a school (James McKinney Elementary School on a lot zoned \"School & Institutional Use (SI)\", accessed from Lassam Road.\nRelated Policies & Studies\nOfficial Community Plan/Steveston Planning Area\nThe subject property is located in the Steveston planning area and is designated as \"Neighbourhood Residential\" in the Official Community Plan (OCP). The property is designated for \"Single Family\" use in the Steveston Area Plan. The proposed rezoning and subdivision are consistent with these designations.\nPH - 57\nNovember 6, 2023 - 3 - RZ 22-011080\n7404492\nSingle Family Lot Size Policy 5420/Zoning Bylaw 8500\nThe subject property is located within the area covered by Lot Size Policy 5420, adopted by City Council in 1989, and subsequently amended by Council on August 7, 1992, and on August 21, 1995 (Attachment 4). The Policy permits properties along Lassam Road to be rezoned and subdivided in accordance with the provisions of the \"Single Detached (RS2/B)\" zone (minimum 12 m wide lots). Each proposed lot at the subject site will be approximately 12.6 m (41 ft.) wide and approximately 575 m² (6,189.25 ft²) in area which conforms to the RS2/B zone. The proposed rezoning complies with the Lot Size Policy.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nIn accordance with the City's Early Public Notification Policy No. 1316, a notice of the development proposal was provided to residents within 100 metres of the subject site. In addition, a rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the early public notification or placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City's Zoning Bylaw 8500.\nAnalysis\nThis redevelopment proposes to rezone and subdivide an existing single-family lot into two new single-family lots with vehicular access for both new lots off Lassam Road. This rezoning and subdivision is consistent with the emerging lot fabric and vehicular access along Lassam Road.\nExisting Legal Encumbrances\nThere is an existing 3 m wide Statutory Right-of-Way (SRW) for City sanitary service that covers a small portion of the property in the southwest corner which will be expanded and widened northward with utility upgrades. The applicant has been advised that no building encroachment into the SRW is permitted.\nTransportation and Site Access\nThe subject site currently has vehicular access from a driveway letdown along Lassam Road. In accordance with the Residential Lot (Vehicular) Access Regulation Bylaw 7222, vehicle access to proposed Lot 1 and proposed Lot 2 will be from Lassam Road.\nPH - 58\nNovember 6, 2023 - 4 - RZ 22-011080\n7404492\nTwo new driveway crossings are to be constructed to meet the requirements of the City of Richmond's Engineering Design Specifications Driveway and to ensure retention of a City tree in the frontage (tag # CT-2). This work is to be designed and constructed as part of the required Servicing Agreement to be entered into prior to subdivision.\nTree Retention and Replacement\nThe applicant has submitted a Certified Arborist's Report; which identifies on-site and off-site tree species, assesses tree structure and condition and provides recommendations on tree retention and removal relative to the proposed development. The Report assesses nine bylaw-sized trees on the subject property, no trees on neighbouring properties, and two trees on City property (Attachment 5).\nThe City's Tree Preservation Coordinator and City Parks Department have reviewed the Arborist's Report and supports the Arborist's findings, with the following comments:\nx Two trees",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T00:52:10.239Z",
    "updateDate": "2024-02-05T00:52:10.240Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/2_-_Application_by_Navreet_Gill_for_Rezoning_at_11831_11833_Seabrook70931.pdf",
    "text": "7409688\nReport to Committee\nTo: Planning Committee\nDate: October 23, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 22-010976\nRe: Application by Navreet Gill for Rezoning at 11831/11833 Seabrook Crescent from the \"Single Detached (RS1/E)\" Zone to the \"Single Detached (RS2/B)\" Zone\nStaff Recommendation\nThat Richmond Zoning Bylaw 8500, Amendment Bylaw 10510, for the rezoning of 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone, be introduced and given first reading.\nfor Wayne Craig\nDirector, Development\n(604-247-4625)\nWC:le\nAtt. 6\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing \nCONCURRENCE OF GENERAL MANAGER\nCity of Richmond\nPH - 37\nOctober 23, 2023 - 2 - RZ 22-010976\n7409688\nStaff Report\nOrigin\nNavreet Gill has applied on behalf of the property owners, 1303287 B.C. Ltd. (Balraj Singh Sanghera and Rajbir Kaur Chatha), to rezone 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone in order to permit the property to be subdivided into two single-family lots, each with vehicle access from Seabrook Crescent. A location map and aerial photo are provided in Attachment 1. The proposed subdivision plan and draft site plan are provided in Attachment 2.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile\nThe subject site contains an existing un-stratified non-conforming duplex (two-unit dwelling), which will be demolished prior to subdivision. Both dwelling units are currently tenant occupied and do not contain any secondary suites. The applicant has indicated that the tenants are aware of the redevelopment proposal and the applicant will ensure compliance with the Residential Tenancy Act.\nSurrounding Development\nDevelopment immediately surrounding the site is as follows:\nTo the North: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the South: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the East: Across the lane, an existing duplex on a lot zoned “Single Detached (RS1/E)” fronting onto No. 5 Road. There is a Rezoning application and Development Permit (RZ 22-019002/DP 23-028942) at 10111/10113 No. 5 Road to permit the development of three front-back duplex lots. The rezoning application received third reading on October 16, 2023.\nTo the West: Across Seabrook Crescent, an existing duplex on a lot zoned “Single Detached (RS1/E)”.\nRelated Policies & Studies\nOfficial Community Plan\nThe subject site is designated as “Neighbourhood Residential” in the Official Community Plan (OCP). This proposal is consistent with this OCP designation.\nPH - 38\nOctober 23, 2023 - 3 - RZ 22-010976\n7409688\nSingle-Family Lot Size Policy 5434/ Zoning Bylaw 8500\nThe subject property is located within the area covered by Lot Size Policy 5434, adopted by City Council in 1990, amended in 1991 and 2006 (Attachment 4). The Policy permits a majority of lots within the Policy Area (including the subject property) to be rezoned and subdivided in accordance with the provisions of the “Single Detached (RS1/E)” zone.\nThe subject site is currently occupied by a legal duplex. Section 2.3.7 of Richmond Zoning Bylaw 8500 provides that the Lot Size Policy does not apply to a rezoning that a legal duplex and which are intended to be subdivided into no more than two single-family lots. The proposed rezoning and subdivision complies with Section 2.3.7 and would result in the creation of two single-family lots being 444.9 m2 and 450.2 m2 in area. Further, the proposed rezoning and subdivision would comply with the minimum lot dimensions and size applicable to the “Single Detached (RS2B)” zone.\nMinistry of Transportation & Infrastructure Approval\nAs the subject site is located within 800 m of an intersection of a Provincial Limited Access Highway and a City road, this redevelopment proposal was referred to the Ministry of Transportation and Infrastructure (MOTI) for review and comment. Preliminary confirmation has been received from MOTI indicating that they have no objections to the proposed redevelopment. Final approval from MOTI is required prior to final adoption of the rezoning bylaw.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nPH - 39\nOctober 23, 2023 - 4 - RZ 22-010976\n7409688\nAnalysis\nProposed Rezoning and Subdivision\nThe applicant is proposing to rezone the subject site and subdivide it into two single-family lots, each with a secondary suite, with access from Seabrook Crescent. The proposed subdivision plan and site plan are shown in Attachment 2.\nExisting Legal Encumbrances\nThere is an existing Statutory Right-of-Way (SRW) for City sanitary service services, BC Hydro and the BC Telephone Company that extends 3.0 m from the southern property line of the subject site. The applicant has been advised that no encroachment of buildings, trees or obstructions into the SRW is permitted. The applicant has been provided an opinion that the proposed development does not conflict with the legal encumbrances on Title.\nTransportation and Site Access\nVehicle access is proposed to be from Seabrook Crescent for both of the proposed lots. The existing driveways will be removed and new driveways will be constructed as detailed in the Site Servicing and Frontage Improvements sub-section of this report.\nTree Retention and Replacement\nThe applicant has submitted a Certified Arborist’s Report; which identifies on-site and off-site tree species, assesses tree structure and condition, and provides recommendations on tree retention and removal relative to the proposed development (Attachment 5). The Report assesses two bylaw-sized trees on the subject property and two trees on neighbouring properties. There are no street trees on City property adjacent to the subject",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T00:48:28.033Z",
    "updateDate": "2024-02-05T00:48:28.033Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1-_Application_by_Terra_8120_Number_1_Road70930.pdf",
    "text": "7401059\nReport to Committee\nTo: Planning Committee\nDate: October 25, 2023\nFrom: Wayne Craig\nDirector, Development\nFile: RZ 21-945869\nRe: Application by Terra 8120 Number 1 Road Limited Partnership for Rezoning at 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” Zone to the “Low Density Townhouses (RTL4)” Zone\nStaff Recommendation\nThat Richmond Zoning Bylaw 8500, Amendment Bylaw 10498, for the rezoning of 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, be introduced and given first reading.\nfor Wayne Craig\nDirector, Development\n(604-247-4625)\nWC:cl\nAtt. 6\nREPORT CONCURRENCE\nROUTED TO: CONCURRENCE\nAffordable Housing ;\nCONCURRENCE OF GENERAL MANAGER\nCity of Richmond\nrkfy\nPH - 4\nOctober 25, 2023 - 2 - RZ 21-945869\n7401059\nStaff Report\nOrigin\nTerra 8120 Number 1 Road Limited Partnership (on behalf of Cliff Chun and Kai Shen Hsiung of 1296168 BC Ltd. and Yi Jen Wang and Kai Shen Hsiung of Terra West Properties Ltd.) has applied to the City of Richmond for permission to rezone 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, to permit the development of nine townhouse units, with vehicle access from No. 1 Road. A location map and aerial photo of the subject site are provided in Attachment 1.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is provided in Attachment 2.\nExisting Site Condition and Context\nA survey of the subject site is included in Attachment 3. The subject site consists of two lots located on the east side of No. 1 Road, between Blundell Road and Coldfall Road.\nSubject Site Existing Housing Profile\nThe subject site consists of two lots, each containing a single-family dwelling that is tenant occupied. The existing dwellings are proposed to be demolished. The applicant has indicated that the tenants are aware of the redevelopment proposal and the applicant will ensure compliance with the Residential Tenancy Act.\nSurrounding Development\nExisting development immediately surrounding the subject site is as follows:\nTo the North: Are three lots, two with newer construction zoned “Compact Single Detached (RC1)” and one zoned “Single Detached (RS1/E)”, each containing a single-family dwelling.\nTo the South: Is a lot zoned “Single Detached (RS1/E)”, containing a single-family dwelling. Beyond that is a large lot zoned “Low Density Townhouses (RTL4)”, containing 28 townhouses.\nTo the East: Are lots zoned “Single Detached (RS1/B)”, each containing a single-family dwelling fronting Corless Place.\nTo the West: Across No. 1 Road are compact lots zoned “Single Detached (RS1/K)” and “Compact Single Detached (RC1)”, each containing a single-family dwelling.\nPH - 5\nOctober 25, 2023 - 3 - RZ 21-945869\n7401059\nRelated Policies & Studies\nOfficial Community Plan\nThe Official Community Plan (OCP) land use designation for the subject properties is “Neighbourhood Residential”. This redevelopment proposal is consistent with this designation.\nArterial Road Land Use Policy\nLand Use Designation\nThe Arterial Road Land Use Policy designation for the subject properties is “Arterial Road Townhouse”, subject to the development criteria in the Policy. This redevelopment proposal is consistent with this designation.\nLot Width and Residual Lots\nThe development criteria for townhouses in the Arterial Road Land Use Policy call for land assembly with a minimum 50 m frontage on a major arterial road and avoiding the creation of residual sites with less than a 50 m frontage. The Policy also recognizes that land assembly with existing narrow lots or on lots containing newer dwellings will be difficult to redevelop. The Policy provides flexibility for the minimum frontage in these circumstances provided the application can meet other guidelines and requirements. This includes the ability to consolidate vehicle access points and securing shared access by means of a Statutory Right-of-Way (SRW) agreement to adjacent properties to enable their potential redevelopment in the future.\nAlthough this redevelopment proposal involves land assembly with a frontage less than 50 m on No. 1 Road (i.e., 40 m), staff support the application for the following reasons:\nx The applicant has provided documentation indicating that efforts have been made in 2021 and 2023 to acquire the property to the south at 8180 No. 1 Road in order to achieve the minimum arterial road frontage width of 50 m, but that the owner is not interested in redeveloping their property at this time.\nx Due to existing newer development and unique lot geometry immediately north of the subject site, the applicant has indicated that it is not financially feasible to pursue land assembly with those properties as part of this redevelopment proposal.\nx The applicant has submitted a preliminary concept plan to show how the neighbouring properties to the north and south could redevelop in the future with shared vehicle access through the subject site (a copy of which is on file).\nx Prior to final adoption of the rezoning bylaw, the applicant must register a SRW agreement on Title for public right-of-passage over the entire drive-aisle and on-site truck turnaround area opposite the site entry to secure future shared access to sites to the south and north. The SRW agreement is to contain language to indicate that the on-site truck turnaround area opposite the site entry can be removed from the SRW area and used as additional outdoor amenity space for the sole use of the subject development when the adjacent property to the south is redeveloped for townhouses and on-site truck turnaround is accommodated by creating a T-intersection of the drive-aisles on the lots.\nPH - 6\nOctober 25, 2023 - 4 - RZ 21-945869\n7401059\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act",
    "maxPages": 5,
    "type": "text",
    "createDate": "2024-02-05T00:47:37.682Z",
    "updateDate": "2024-02-05T00:47:37.682Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1052070970.pdf",
    "text": "City of Richmond Bylaw City City's Website Public Notice Bylaw No. 10520\n\nPREAMBLE\nWHEREAS the Council of the City of Richmond has considered the principles prescribed by regulation before adopting the Public Notice Bylaw No. 10520 in accordance with subsection 94.2(6)(a) of the Community Charter, SBC 2003, Chapter 26, as amended,\nNOW THEREFORE, the Council of the City of Richmond enacts as follows:\n\nPART ONE: CITATION\n1.1 This Bylaw is cited as \"Public Notice Bylaw No. 10520\".\n\nPART TWO: INTERPRETATION\n2.1 In this bylaw, unless the context otherwise requires:\n- City's Facebook Page 7470151 Bylaw 10520 means this bylaw.\n- City of Richmond means the City of Richmond.\n- City's Website means the official website of the City of Richmond, www.richmond.ca.\n\nPART THREE: INTERPRETATION\n- City's Facebook Page means the official Facebook page of the City of Richmond, www.facebook.com/cityofrichmondbe\n\n3.1 Any notice required to be given or published in accordance with section 94 of the Community Charter must be published by the following methods:\na. Electronically by publishing the notice on the City's Website; and\nb. Electronically by publishing the notice on the City's Facebook Page.\n\nCNCL - 39 (Special)Bylaw 10520 PART FOUR: SEVERABILITY 4.1 If any part, section, sub-section, clause or sub-clause of this Bylaw is, for any reason, held to be invalid by the decision of a Court of competent jurisdiction, such decision does not affect the validity of the remaining portions of this bylaw. FIRST READING SECOND READING THIRD READING ADOPTED MAYOR CNCL-40 (Special) Page 2 DEC 11 2023 DEC 11 2023 DEC 11 2023 CORPORATE OFFICER CITY OF RICHMOND APPROVED for by originating dept APPROVED for legality by Solicitor АСI Bylaw 10520 PART FOUR : SEVERABILITY 4.1 If any part , section , sub - section , clause or sub - clause of this Bylaw is , for any reason , held to be invalid by the decision of a Court of competent jurisdiction , such decision does not affect the validity of the remaining portions of this bylaw . FIRST READING SECOND READING THIRD READING ADOPTED MAYOR CNCL - 40 ( Special ) Page 2 DEC 11 2023 DEC 11 2023 DEC 11 2023 CORPORATE OFFICER CITY OF RICHMOND APPROVED for by originating dept APPROVED for legality by Solicitor АСI",
    "maxPages": 2,
    "type": "image",
    "createDate": "2024-02-05T00:47:15.395Z",
    "updateDate": "2024-02-05T00:47:15.395Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_3_6571___6591__No72097.pdf",
    "text": "City of Richmond\nReport to Development Permit Panel\nTo: Development Permit Panel\nDate: December 18, 2023\nFrom: Wayne Craig\nFile: DP 22-021165\nDirector, Development\nRe: Application by 0853803 BC Ltd. and 1121648 BC Ltd. for a Development Permit at 6571 and 6591 No. 1 Road\nStaff Recommendation\nThat a Development Permit be issued which would:\n1. Permit the construction of eight townhouse units at 6571 and 6591 No. 1 Road on a site zoned \"Low Density Townhouses (RTL4)\"; and\n2. Vary the provisions of Richmond Zoning Bylaw 8500 to reduce the minimum required lot width on major arterial roads from 50.0 m to 40.2 m.\nWayne Craig\nDirector, Development (604-247-4625)\nWC:ak\nAtt. 3\n7501936\nDecember 18, 2023 - 2 -\nStaff Report\nOrigin DP 22-021165\n0853803 BC Ltd. (Director: Simerjit and Gurjit Malhi) and 1121648 BC Ltd. (Director: Ajit Thaliwal) has applied to the City of Richmond for permission to develop eight townhouse units at 6571 and 6591 No. 1 Road on a site zoned \"Low Density Townhouses (RTL4)\".\nThe site currently contains one single-family dwelling (on 6591 No 1 Road). The site is being rezoned from \"Single Detached (RS 1/F)\" to \"Low Density Townhouses (RTL4)\" for this project under Bylaw 10288 (RZ 16-731275).\nA Servicing Agreement is required as a condition of rezoning and includes, but is not limited to, the following improvements:\n• Permanent closure of the existing southerly driveway (at 6591 No. 1 Road); and\n• Installation of new water, storm and sanitary service connections.\nDevelopment Information\nPlease refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\nBackground\nDevelopment surrounding the subject site is as follows:\nTo the north: A single detached dwelling on property designated for arterial road townhouse development in the Official Community Plan (OCP) and zoned \"Single Detached (RS 1/F)\".\nTo the east: Across from No. 1 Road, single detached dwellings, designated for single detached development in the OCP and zoned \"Single Detached (RS2/C)\".\nTo the south: A three-storey townhouse complex zoned \"Town Housing (ZT27)-Robson Drive/Court (Terra Nova)\".\nTo the west: A three-storey townhouse complex zoned \"Town Housing (ZT27)-Robson Drive/Court (Terra Nova)\".\nRezoning and Public Hearing Results\nDuring the rezoning process, staff identified the following design issues to be resolved at the Development Permit stage:\n• Compliance with Development Permit Guidelines for the form and character of multiple-family projects provided in the OCP.\n• Refinement of landscape design, fencing and interface with abutting lots.\n• Review of retaining wall heights and requirements for guardrails.\n• Further assessment of the potential relocation of the front yard hedge.\n• Refinement of the outdoor amenity area design, including the choice of play equipment.\n7501936\nDecember 18, 2023 - 3 -\nDP 22-021165\n• Review of relevant accessibility features for the proposed convertible unit and aging-in-place design features in all units.\n• Review of a sustainability strategy for the development proposal and ensuring that the development meets or exceeds the City's required Energy Step Code for Part 9 construction applicable at time of construction.\nThe Public Hearing for the rezoning of this site was held on March 21, 2022. No public correspondence was received at the Public Hearing.\nStaff worked with the applicant to address the above issues in the following ways:\n• Detailed architectural and landscape plans have been provided to demonstrate that the proposed development is generally consistent with the Development Permit guidelines for multi-family projects and Arterial Road Guidelines for Townhouses in the OCP.\n• Detailed landscape plans have been submitted and provides a mix of coniferous and deciduous replacement trees, which meet the bylaw size requirements.\n• The applicant has refined the design of the retaining wall and has provided handrails for the proposed steps by the southwest corner of the site as per BC Building Code requirements.\n• The hedge on-site is proposed to be relocated to the rear of the site and integrated as part of the landscaping.\n• The design of the outdoor amenity area for this townhouse development includes a children's play structure and a bench for parental interaction and to promote social interaction surrounded by landscaping.\n• The proposed accessibility features include aging-in-place features in all units and one convertible unit.\n• The applicant has provided a sustainability strategy and a letter from a Certified Energy Advisor indicating that the project will achieve Step 3 of the BC Energy Step Code with Low Carbon Emission Systems, consistent with current City regulations.\nStaff Comments\nThe proposed scheme attached to this report has satisfactorily addressed the significant urban design issues and other staff comments identified as part of the review of the subject Development Permit application (Plans #1 to #20). In addition, it complies with the intent of the applicable sections of the Official Community Plan and is generally in compliance with the \"Low Density Townhouses (RTL4)\" zone, except for the zoning variance noted below.\nZoning Compliance/Variance (staff comments in bold)\nThe applicant requests to vary the provisions of Richmond Zoning Bylaw 8500 to reduce the minimum lot width from 50.0 m to 40.2 m.\nStaff supports the proposed variance as the proposal is generally consistent with the guiding principles of the Arterial Road Land Use Policy and guidelines. The need for this variance was identified in the rezoning staff report and no concerns were raised during the Public Hearing at rezoning stage. The applicant was unable to acquire the adjacent site to the north to increase the lot width as the owner advised they were not interested in selling.",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-03T19:03:13.705Z",
    "updateDate": "2024-02-03T19:03:13.705Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_2_13888_Wireless_Way72096.pdf",
    "text": "To: City of Richmond Development Permit Panel\nReport to Development Permit Panel\nDate: December 18, 2023\nFrom: Wayne Craig\nFile: DP 21-943418\nDirector, Development\nRe: Application by Karla Castellanos Architect for a Development Permit at 13888 Wireless Way\nStaff Recommendation\nThat a Development Permit be issued which would:\n1. Permit the construction of a three-storey light industrial and ancillary office building on a new lot created through subdivision of the west portion (proposed Lot 1) of the subject site at 13888 Wireless Way, on a site zoned \"Industrial Business Park (ZI3) Crestwood Area (East Cambie)\"; and,\n2. To vary the provisions of Richmond Zoning Bylaw 8500 to:\na) Reduce the required number of parking spaces from 2.8 spaces to 0.75 spaces for each 100 m2 of gross leasable floor area of building on Lot 1;\nb) Reduce the minimum required number of large-sized on-site designated loading spaces on Lot 1 from 1 space to 0 spaces;\nc) Reduce the minimum percentage of standard parking spaces on Lot 2 from 50 per cent to 30 per cent.\nd Wa~aig WC:cl Att. 4\nDecember 18, 2023 - 2 -\nStaff Report Origin DP 21-943418\nKarla Castellanos Architect has applied to the City of Richmond (on behalf of Alan Yong, S-506 Holdings Ltd.) for permission to develop a three-storey light industrial and ancillary office building of approximately 3,748 m2 (40,353 ft2) containing 11 strata-titled units on a new lot (Lot 1) created through subdivision on the west portion of the subject site at 13888 Wireless Way, zoned \"Industrial Business Park (ZI3) - Crestwood Area (East Cambie)\".\nThe existing office building is to remain on a new lot on the east portion of the subject site (Lot 2).\nThis proposal aligns with the City's objectives of intensifying existing industrial lands.\nA location map of the subject site is provided in Attachment 1.\nA survey of the subject site showing the proposed subdivision plan is provided in Attachment 2.\nThis proposal also involves landscaped restoration within the existing Riparian Management Area (RMA) along the south side of the existing site, as well as improvements to pedestrian circulation and landscaping within the surface parking area on Lot 2.\nConcurrent with this DP application, there is an application to subdivide the subject site into two lots under the existing Zl3 zone, which must be approved prior to DP issuance (SD 22-025862).\nA Servicing Agreement (SA) to design and construct the following improvements is required prior to Building Permit issuance, including (but not limited to):\n• Upgrading the existing watermain along the Sparwood Place frontage to meet the minimum required fire flow and fulfill the distance requirement between hydrant and the proposed building.\n• Upgrading approximately 85 m (278 ft.) of the storm sewer along the Wireless Way frontage.\n• The water, storm and sanitary service connections.\nDevelopment Information\nPlease refer to attached Development Application Data Sheet for a comparison of the proposed development data with the relevant Bylaw requirements (Attachment 3 ).\nExisting Site and Surrounding Context\nThe subject site is located on the south side of Wireless Way between No. 6 Road and Knight Street.\nThe site is approximately 20,090 m2 (216,246 ft2) in area and currently contains an existing office building as well as a large surface parking area, with vehicle access from both Wireless Way and Sparwood Place.\nThe subject site is proposed to be subdivided into two new lots of approximately 3,861 m2 (41,548 ft2) in area (Lot 1) and 16,227 m2 (174,698 ft2) in area (Lot 2).\n7451673\nDecember 18, 2023 - 3 -\nDP 21-943418\nExisting development immediately surrounding the subject site is as follows:\n• To the North:\nImmediately across Wireless Way: light industrial and office buildings on lots zoned \"Industrial Business Park (IB I)\" and \"Industrial Business Park (ZI3)- Crestwood Area (East Cambie)\" at 13351 and 13353 Commerce Parkway and 13811 and 13911 Wireless Way, respectively.\n• To the East:\nFronting No. 6 Road: Light industrial and office buildings on lots zoned \"Industrial Business Park (IBl)\" at 13931 Sparwood Place and 5871 No. 6 Road; Richmond Fire-Rescue's No. 7 Fireball on a lot zoned \"School & Institutional Use (SI)\" at 5731 No. 6 Road; and a surface parking lot on a lot zoned \"Industrial Business Park (ZI3)- Crestwood Area (East Cambie)\" at 5611 No. 6 Road.\n• To the South:\nSingle-family dwellings and agricultural uses on lots zoned \"Agriculture (AGl)\" on the south side of Westminster Highway at 13560 to 13720 Westminster Highway.\n• To the West:\nLight industrial and office buildings on a lot zoned \"Industrial Business Park (IBl)\" at 13880 Wireless Way.\nPublic input during the DP Application Review Process\nStaff has not received any comments from the public in response to the placement of the DP Application Notification Sign on the subject site.\nStaff Comments\nThe proposed scheme attached to this report (Plans #1 to #4.C and Reference Plans) has satisfactorily addressed the significant urban design issues and other staff comments identified as part of the review of the subject DP application.\nIn addition, it complies with the intent of the applicable sections of the Official Community Plan and is generally in compliance with the ZI3 zone, with the exception of the zoning variances noted below.\nZoning ComplianceNariances (staff comments in bold italics)\nThe Applicant requests to vary the provisions of Richmond Zoning Bylaw 8500 to:\n1) Reduce the required number of parking spaces from 2.8 spaces to 0.75 spaces for each 100.0 m2 of gross leasable floor area of building on Lot 1.\nThe site-specific parking rate of 2. 8 spaces per 100. 0 m1 of gross leasable floor area of building was established with the rewning of the site to the Z/3 wne in 2004.\nIn 2021, the City's Zoning Bylaw was amended to include reduced parking requirements for industrial uses of 0. 75 spaces per 100 m1 of gross leasable floor area.\nThe requested variance to provide 0. 75 spaces for each 100. 0 m1 of gross leasable floor area of building on Lot 1 reflects the intended use of Lot 1 and is consistent with current standard parking requirements for the \"Industrial, general\" use that specified in the current Zoning Bylaw.\nThe Applicant has proposed Transportation Demand Management (TDM) measures to support the requested variance, including an employee shuttle service between the subject site and the Bridgeport Canada Line station during peak hours, and a subsidized monthly transit pass program to Lot 1 employees, which will run for three years.\n7451673",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-03T19:02:38.833Z",
    "updateDate": "2024-02-03T19:02:38.833Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_1_4571_4591___4611__Steveston_Hway72095.pdf",
    "text": "City of Richmond Report to Development Permit Panel\nTo: Development Permit Panel\nDate: December 18, 2023\nFrom: Wayne Craig\nFile: DP 20-919145\nDirector, Development\nRe: Application by Jonathan King for a Development Permit at 4571, 4591 and 4611/4631 Steveston Highway\nStaff Recommendation\nThat a Development Permit be issued which would:\n1. Permit the construction of 16 townhouse units at 4571, 4591 and 4611/4631 Steveston Highway on a site zoned \"Low Density Townhouses (RTL4)\"; and\n2. Vary the provisions of Richmond Zoning Bylaw 8500 to reduce the front yard setback along Steveston Highway from 6.0 m to 4.50 m.\nWayne Craig\nDirector, Development (604-247-4625)\nWC:el\nAtt. 3\n7317348\nDecember 18, 2023\n-2-\nStaff Report\nOrigin DP 20-919145\nJonathan King (on behalf of Gurpreet Mann, director of 0780012 BC Ltd., Jonathan King and Sandra Rotholc-King, directors of 2517294 Ontario Inc., Azim Bhimani, director of Luxor Homes & Developments Ltd., Gurpreet Mann and Narinder Mann) has applied to the City of Richmond for permission to develop 16 townhouse units at 4571, 4591 and 4611/4631 Steveston Highway. One of the townhouse units is proposed to contain a ground-level secondary suite. The site is being rezoned from \"Single Detached (RS1/E)\" and \"Two-Unit Dwellings (RD1)\" zones to the \"Low Density Townhouses (RTL4)\" zone for this project under Bylaw 10081 (RZ 18-839945), which is currently at third reading. A Servicing Agreement is required as a condition of Building Permit issuance and includes, but is not limited to, the following improvements:\n• Removal of existing sidewalk and replacement with a new 1.5 m concrete sidewalk at the property line and minimum 1.5 m wide landscaped boulevard with street trees behind the existing curb;\n• Removal of the existing driveway crossings and replacement with the frontage works described above; and\n• Construction of a new driveway crossing designed to provide \"right in, right out\" access to the site.\nDevelopment Information\nPlease refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\nBackground\nDevelopment surrounding the subject site is as follows:\nTo the north: Single-family dwellings fronting Bonavista Drive on lots zoned \"Single-Detached (RS 1/B).\"\nTo the south: Across Steveston Highway, single-family dwellings on lots zoned \"Single-Detached (RS 1/B)\", which are identified for compact lot coach house development under the Arterial Road Land Use Policy.\nTo the east and west: Single-family dwellings on a lot zoned \"Single Detached (RS 1/E)\", which are identified for townhouse development under the Arterial Road Land Use Policy.\nRezoning and Public Hearing Results\nThe Public Hearing for the rezoning of this site was held on October 21, 2019. No concerns regarding the rezoning application was expressed at the Public Hearing.\n7317348\nDecember 18, 2023\n- 3 -\nDP 20-919145\nStaff Comments\nThe proposed scheme attached to this report has satisfactorily addressed the significant urban design issues and other staff comments identified as part of the review of the subject Development Permit application. In addition, it complies with the intent of the applicable sections of the Official Community Plan (OCP) and is generally in compliance with the \"Low Density Townhouse (RTL4)\", except for the zoning variance noted below.\nZoning Compliance/Variance (staff comments in bold)\nThe applicant requests to vary the provisions of Richmond Zoning Bylaw 8500 to reduce the front yard setback along Steveston Highway from 6.0 m to 4.50 m. Staff supports the proposed variance as it is consistent with the Development Permit Guidelines for Townhouses on arterial roads in the OCP, which support front yard setbacks at 4.5 m (14.8 ft.) where a 6 m (19.7 ft.) rear yard setback to both the ground and second floors of the rear units is provided. The result will provide a wider space between the rear units of the subject development and the single-family dwellings that back onto the subject site. It will also provide a larger buffer to accommodate tree retention along the rear property line. The resulting distance from the back of the curb to the building face would be approximately 8.47 m. The reduced front yard setback does not compromise tree preservation or tree planting opportunities along the site frontage. The proposed architectural design provides appropriate building articulation and interface with neighboring properties. To address the road traffic noise from Steveston Highway, the project acoustical engineer confirmed that the proposed development is designed to meet the interior noise limits as per the CMHC standards. This variance was identified at the rezoning stage, and no concerns were identified at that time.\nAdvisory Design Panel Comments\nThe Advisory Design Panel (ADP) has reviewed the project and supports it. A copy of the relevant excerpt from the Advisory Design Panel Minutes from Thursday, July 20, 2023 is attached for reference (Attachment 2). The design response from the applicant has been included immediately following the specific Design Panel comments and is identified in 'bold italics'.\nAnalysis\nConditions of Adjacency\n• The proposed form, massing and orientation of the buildings are compatible with the existing adjacent developments on the block.\n• While three-storey units are proposed along Steveston Highway, the building height is stepped down to two-storeys along the east property line to provide appropriate transition to the adjacent single-family home. Along the west property line, an entry driveway is being proposed and the three-storey building will be set back 9.42 m from the west property line.\n• Two-storey units in duplex form, as well as the outdoor amenity area, are proposed along the rear (north) property line to minimize privacy and overlook concerns.",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-03T18:58:51.951Z",
    "updateDate": "2024-02-03T18:58:51.951Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_1_4831_Steveston_Highway70894.pdf",
    "text": "City of Richmond\nTo: Development Permit Panel\nFrom: Wayne Craig, Director, Development\nReport to Development Permit Panel\nDate: November 22, 2023\nFile: DP 23-025993\nRe: Application by Anthony Boni (Boni Maddison Architects) for a Development Permit at 4831 Steveston Highway\nStaff Recommendation\nThat a Development Permit be issued which would:\n1. Permit the construction of a three-storey 25-unit affordable rental housing building at 4831 Steveston Highway on a site zoned \"Low Rise Rental Apartment (ZLR48) - Steveston Highway (Steveston)\"; and\n2. Vary the provisions of Richmond Zoning Bylaw No 8500 to allow 37 per cent of the required vehicle parking spaces to be small car spaces.\nWayne Craig, Director, Development (604-247-4625)\nStaff Report\nOrigin DP 23-025993\nAnthony Boni (Boni Maddison Architects) has applied to the City of Richmond for permission to develop a three-storey 25-unit affordable rental housing building at 4831 Steveston Highway on a site zoned \"Single Detached (RS 1/E)\". The site is currently vacant. The proposed project is on land owned by the City of Richmond with funding support from the Canada Mortgage and Housing Corporation (CMHC) and BC Housing in partnership with Turning Point Housing Society. The site is being rezoned from the \"Single Detached (RS 1/E)\" zone to a new site-specific zone, \"Low Rise Rental Apartments (ZLR48) - Steveston Highway (Steveston)\" for this project under Bylaw 10478 (RZ 23-018081). The Bylaw was given third reading at the Public Hearing held on September 5, 2023. A Servicing Agreement is required as a condition of building permit issuance and includes, but is not limited to, the following improvements:\n- Road widening and frontage improvement work on the site's Steveston Highway frontage.\n- Assessing and monitoring the integrity of the sanitary sewer infrastructure in the existing Statutory-Right-of-Way (SRW).\n- Related water and storm sewer connections to the subject site, along with public and private utility improvements.\nDevelopment Information\nPlease refer to the attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\nBackground\nDevelopment surrounding the subject site is as follows:\nTo the North: Railway Community Gardens on a City road allowance owned by the City of Richmond zoned \"Single Detached (RS 1/E)\" and single detached dwellings on lots zoned \"Single Detached (RS 1/E)\" fronting onto Bonavista Drive and Argentia Drive.\nTo the South: Across Steveston Highway, is the Branscombe House, a heritage-designated single detached dwelling on a lot owned by the City of Richmond zoned \"School & Institutional Use (SI)\", and a single detached dwelling on a lot zoned \"Compact Single Detached (RC1)\".\nTo the East: The Railway Greenway on a lot owned by the City of Richmond, zoned \"Single Detached (RS1/E)\". Across Railway Avenue is a pub and liquor store on a lot zoned \"Pub & Sales (CP2)\" and single detached dwellings on lots zoned \"Single Detached (RS1/E)\".\nTo the West: A townhouse development with 12 units on a lot zoned \"Town Housing (ZT54)\".\nRezoning and Public Hearing Results\nDuring the rezoning process, staff identified the following design issues to be resolved at the Development Permit stage:\n- Design guidelines: compliance with Development Permit Guidelines for multiple family projects in the 2041 Official Community Plan (OCP).\n- Residential streetscape: opportunities to enhance articulation and visual interest through design development to improve the interface fronting the pedestrian sidewalks. In addition, refinement of the site plan to ensure all the aboveground private utility infrastructure improvements required as part of this development will be located on-site and screened from street view.\n- Landscaping and Tree management: Refinement of the landscape design and tree management plan to ensure the protection and long-term health of retained trees.\n- Common amenity space: more information is required with respect to the programming, design, and landscaping of these spaces to ensure consistency with City guidelines. The conceptual design includes shared use of all indoor amenity areas by all residents and common outdoor amenity areas.\n- Accessibility: opportunities for additional Basic Universal Housing (BUH) units.\n- Pedestrian Circulation: opportunities to enhance pedestrian circulation and accessibility throughout the site.\n- Sustainability: the proposed enhanced BC Energy Step Code compliance and opportunities to better understand and enhance the building's performance in coordination with its architectural expression.\n- Crime Prevention through Environmental Design (CPTED): opportunities to incorporate CPTED measures including surveillance and territoriality to promote a sense of security.\n- Parking, Loading and Waste Management: further design of vehicle parking and circulation, truck maneuvering, waste management activities and related features and spaces.\n- Servicing Agreement: detailed design of the off-site frontage elements to be constructed as part of the Servicing Agreement.\nThe Public Hearing for the rezoning of this site was held on September 5, 2023. Through input received up to and including the Public Hearing, the following design-related concerns about rezoning the property were expressed:\n- Direct connection of the site to the Railway Greenway.\n- Redesign the bicycle parking to provide more bicycle parking opportunities for the residents.\nThrough the review of this Development Permit application, staff have worked with the applicant to ensure that the proposed architectural form and character is of good quality and efficient, consistent with the design guidelines contained within the Official Community Plan (OCP) and that it provides an appropriate interface to adjacent properties.",
    "maxPages": 3,
    "type": "text",
    "createDate": "2024-02-03T18:56:36.213Z",
    "updateDate": "2024-02-03T18:56:36.213Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_Application_11230_WilliamsRd_PH_02222261140.pdf",
    "text": "To: City of Richmond Planning Committee\nReport to Committee\nDate: December 14, 2021\nFrom: Wayne Craig\nFile: RZ 21-930446\nDirector, Development\nRe: Application by Habib Samari for Rezoning at 11320 Williams Road from the \"Single Detached (RS1/E)\" Zone to the \"Compact Single Detached (RC2)\" Zone\nStaff Recommendation\nThat Richmond Zoning Bylaw 8500, Amendment Bylaw 10303, for the rezoning of 11320 Williams Road from the \"Single Detached (RSl/E)\" zone to the \"Compact Single Detached (RC2)\" zone, be introduced and given first reading.\nWayne Craig\nDirector, Development\n(604-247-4625)\nStaff Report\nOrigin\nHabib Samari has applied to the City of Richmond for permission to rezone RZ 21-930446 11320 Williams Road from the \"Single Detached (RS 1/E)\" zone to the \"Compact Single Detached (RC2)\" zone, to permit the property to be subdivided to create two single-family lots, both with vehicle access from the rear lane. A location map and aerial photo are provided in Attachment 1.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is provided in Attachment 2. The proposed subdivision plan is provided in Attachment 3.\nSubject Site Existing Housing Profile\nThere is an existing single detached dwelling on the property, which is proposed to be demolished. The dwelling is currently rented and does not contain a secondary suite.\nSurrounding Development\nDevelopment immediately surrounding the subject site is as follows:\nTo the North: Single detached dwellings on lots zoned \"Compact Single Detached (RC1)\" and a single-storey childcare building on a lot zoned \"Assembly (ASY),\" fronting Williams Road with and vehicle access from the rear lane.\nTo the South: Across the lane, single detached dwellings on lots zoned \"Single Detached (RS 1/E),\" fronting Seafield Crescent.\nTo the East: A single detached dwellings on a lot zoned \"Compact Single Detached (RC2),\" fronting Williams Road and with vehicle access from the rear lane.\nTo the West: A single detached dwelling on a lot zoned \"Single Detached (RS 1/E),\" fronting Williams Road and with vehicle access from the rear lane. This lot has similar redevelopment potential and is designated Compact Single Detached in the Arterial Road Land Use Policy.\nRelated Policies & Studies\nOfficial Community Plan\nThe subject property is located in the Shellmont planning area, and is designated \"Neighbourhood Residential\" in the Official Community Plan (OCP) land use map (Attachment 4). The proposed rezoning and subdivision are consistent with this designation.",
    "maxPages": 2,
    "type": "text",
    "createDate": "2024-02-03T18:39:22.645Z",
    "updateDate": "2024-02-03T18:39:22.645Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_dpp_ketcheson_road69357.pdf",
    "text": "To: From: Re: City of Richmond\nWC:sb Att. 3 Development Permit Panel\nWayne Craig Director, Development\n727618 Wayne Craig Director, Development (604-247-4625)\nReport to Development Permit Panel\nStaff Recommendation\nThat a Development Permit be issued which would permit the construction of 178 residential units in a 14-storey high-rise multi-family apartment building at 3588 Ketcheson Road on a site zoned \"Residential / Limited Commercial (ZMU47)-Capstan Village (City Centre)\".\nDate: August 2, 2023\nFile: DP 22-017484\nApplication by Polygon Talisman Park Ltd. for a Development Permit at 3588 Ketcheson RoadAugust 2, 2023 -2- Staff Report Origin Polygon Talisman Park Ltd. has applied to the City of Richmond for permission to develop 178 housing units in a 14-storey apartment building at 3588 Ketcheson Road, a recently subdivided development site comprising a portion of the property formerly located at 8791 Cambie Road/3600 Sexsmith Road and zoned \"Residential / Limited Commercial (ZMU47)-Capstan Village (City Centre)\". The site is currently vacant. Highlights of the proposed development include: \n• The subject application is the second phase of a four-phase development. The first phase of the development will provide all of the required affordable housing and the majority of the required market rental housing. The associated Development Permit (DP 22-015851) was issued by Council on July 10, 2023. Additional market rental housing is required in the second, third and fourth phases (17 market rental units in each phase). DP 22-017484 \n• The subject development includes 178 apartment units, consisting of 17 market rental units and 161 strata residential units. \n• The subject development provides a range of unit types from one-bedroom to three-bedroom. \no Unit areas are proposed to range from 57 m² to 104 m² (613 ft² to 1,120 ft²). \no All the units will be connected to a City-owned Low Carbon Energy System (as secured through the associated rezoning application). \n• Approximately 1,876.8 m² (20,202 ft) of indoor amenity space. \n• Approximately 1,611 m² (17,341 ft) of outdoor amenity space. \n• Approximately 900 m² (9,692 ft) of publicly accessible open space. A Servicing Agreement is required to accommodate the development and was secured through the associated rezoning application, providing for the design and construction of new roads, road widening, frontage improvements off-site, and on-site public pathway and central green along the north and south edges of the subject site. Development Information Please refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements. 7276188 Background The subject site is located in the centre of the four-phase development, fronting onto new roads provided by the development. The subject site is in the Capstan Village area of the City Centre Planning Area and has a net site area of 4,510.4 m² (48,549.5 ft) in area. Development surrounding the subject site is as follows: To the Northwest: Site for the fourth phase of the subject four-phase development, which will include high-density high-rise residential development.",
    "maxPages": 2,
    "type": "text",
    "createDate": "2024-02-03T18:37:45.878Z",
    "updateDate": "2024-02-03T18:37:45.878Z"
  }
]