[
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72014",
    "text": "Meeting: November 20, 2023\nFile: 49500 20 REZ #20-17\nCouncil Report\nTo: Mayor & Council\nFrom: General Manager Planning and Development\nSubject: Revised REZ #20-17 - A Portion of 6229 Marine Drive - Non-Market Housing Development - Edmonds Town Centre Plan\nPurpose: Provide project funding update and seek Council authorization to forward REZ #20-17 to a future Public Hearing, repeal previous in-stream bylaw, and advance new proposed bylaw to second reading and future public hearing.\nReferences:\n- Address: A portion of 6229 Marine Drive\n- Legal: Portion of Lot A, DLs 155A and 171, Group 1 NWD Plan EPP122272\n- Applicant: Mania Hormozi, CLT 0012 Community Society, 220-1651 Commercial Drive, Vancouver, BC, V5L 3Y3\n- Current Zoning: CD Comprehensive Development District (based on the RM3r Multiple Family Residential District, and in accordance with the development guidelines prepared by the City under Rezoning Reference #19-59)\n- Proposed Zoning: Amended CD Comprehensive Development District (based on the RM2 Multiple Family Residential District and RM2r Multiple Family Residential District, the Edmonds Town Centre Plan as guidelines, and in accordance with the revised development guidelines provided in Appendix A of the Rezoning Bylaw)\nRecommendations:\n1. Repeal and abandon Burnaby Zoning Bylaw 1965, Amendment Bylaw No. 50, 2020 (Bylaw No. 14250) contingent upon granting of Second Reading of new Rezoning Bylaw for REZ #20-17.\n2. Amend Burnaby Zoning Bylaw 1965, Amendment Bylaw No. 35, 2023 (Bylaw No. 14613) in accordance with Section 3.0 and Attachment 2 of the report and advance to Second Reading and future Public Hearing.\n3. Authorize necessary Statutory Rights of Way over the subject site for third-party utility providers.\n4. Send a copy of the report to BC Housing.\n5. Establish prerequisites to completion of rezoning: submission of a suitable plan of development, completion of a Subdivision Plan, and granting of necessary Section 219 Covenants and Statutory Rights of Way.\nChief Administrative Officer's Comments: Concurs with the recommendation of the General Manager Planning and Development.\nExecutive Summary: Proposed rezoning bylaw amendment aims to establish development guidelines for non-market housing on the subject site.\nPolicy Section: Proposed rezoning application is consistent with various policies and plans adopted by Council.\nBackground:\n- Subject site measures approximately 0.81 hectares and is located within Sub-Area 3 of the Edmonds Town Centre Plan.\n- Subject site, together with a larger site to the southwest, forms the \"Bevan Lands\" development site.\n- Council advanced a program in 2019 for non-market housing development on City-owned sites, including the subject site (REZ# 19-59).\n- Public Hearing report for the subject site (REZ# 20-17) submitted in 2020 outlined detailed development for non-market co-operative buildings.\n- CLT was not successful in obtaining BC Housing's Community Housing Fund at that time.\n- BC Housing announced funding for the subject site in 2023.\n- Council referred a report back to staff to explore opportunities for additional density and non-market housing units on the subject site.\n- Revised report provides updated CD Guidelines to facilitate potential for additional units on the subject site.\n- City staff are exploring the option of adding additional units to the proposed development in coordination with BC Housing and CLT.\n- Finalized density and request for City housing grant will be subject of future Council report.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      2
    ],
    "type": "text",
    "createDate": "2024-02-06T18:01:20.712Z",
    "updateDate": "2024-02-06T18:01:20.712Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72972",
    "text": "Meeting: October 30, 2023\nFile: 49500 02 REZ 23-06\nCouncil Report to: Mayor & Council\nFrom: General Manager Planning and Development\nSubject: REZ #23-06 - Burnaby Lake Village Conceptual Master Plan Phase 1A - Bainbridge Urban Village Community Plan\nPurpose: Seek Council authorization to forward REZ #23-06 to a future Public Hearing.\nRecommendations:\n1. Prepare a Rezoning Bylaw for REZ #23-06 and advance it to First Reading and a Public Hearing.\n2. Authorize the introduction of a Housing Agreement Bylaw according to the terms outlined in Section 3.11 of the report.\n3. Establish prerequisites for the completion of the rezoning, including the submission of a suitable plan of development, advancement of the Burnaby Lake Village Conceptual Master Plan (REZ #22-28) to Final Adoption, deposit of sufficient monies for necessary services, installation of underground wiring, completion of subdivision, dedication of rights-of-way, registration of a Housing Covenant and Housing Agreement, submission of a Stormwater Management System, compliance with groundwater management guidelines, submission of geotechnical and groundwater study, execution of an indemnity agreement, submission of a Solid Waste and Recycling Plan, review of on-site loading facilities, provision of car wash stalls and garbage handling/recycling space, provision of facilities for cyclists, design of units adaptable to persons with disabilities, compliance with sound criteria and parking guidelines, submission of a Green Building Plan and Energy Benchmarking, submission of a Comprehensive Sign Plan, submission of a Site Disclosure Statement, and deposit of applicable charges.\nChief Administrative Officer's Comments: Concurs with the recommendation.\nExecutive Summary: Recommends bringing forward the Rezoning Bylaw for First Reading and forwarding it to a future Public Hearing. Provides information on the proposal for the construction of two mid-rise strata apartment buildings, a commercial podium, and a mid-rise market and rental building in accordance with Phase 1A of the Burnaby Lake Village Conceptual Master Plan.\nPolicy Section: The proposed rezoning application is consistent with various policies and plans adopted by Council.\nBackground: On June 5, 2023, Council granted Second Reading to REZ #22-28 for the Burnaby Lake Village Conceptual Master Plan. The subject site comprises Phase 1A of the Master Plan, including two mid-rise strata apartment buildings, a commercial podium, a mid-rise market and rental building, the Esplanade, and the Forest Walk.\n- Two new north-south streets will be created, one south from Lougheed Highway and one north from Winston Street, connected by a new east-west street called Esplanade.\n- The Phase 1A site is located on the south side of Lougheed Highway between Bainbridge Avenue and Sperling Avenue.\n- The site is designated for high-density mixed-use development, utilizing the RM5uv-a Multiple Family Residential District, RM5r Multiple Family Residential District, and the C2 Community Commercial District as guidelines.\n- The net Phase 1A site is approximately 9,564 m2 (102,946 sq. ft.) in size and is part of 6800 Lougheed Highway.\n- The current improvement on the site is an industrial building with surface parking.\n- On October 3, 2022, Council received an initial rezoning report proposing to rezone the subject development site in line with the Bainbridge Urban Village.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      2,
      3
    ],
    "type": "text",
    "createDate": "2024-02-06T18:00:49.533Z",
    "updateDate": "2024-02-06T18:00:49.533Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72966",
    "text": "Meeting: October 30, 2023\nFile: 49500 02 REZ #22-36\nCouncil Report from General Manager Planning and Development\nSubject: Rezoning Reference #22-36 - Commercial Rental Tower VII Brentwood Town Centre Development Plan\nPurpose: Seek Council authorization to forward REZ #22-36 to a future Public Hearing.\nReferences:\n- Address: Portion of 4567 Lougheed Highway\n- Legal: Portion of Lot 1 District Lots 123 and 124 Group 1 New Westminster District Plan EPP31990 Except Plans EPP40171, EPP59173 and EPP108674\n- Applicant: Shape Properties Corp.\n- Current Zoning: CD Comprehensive Development District (based on C3, C3a General Commercial District, P2 Administration and Assembly District, RM4s, RM5s Multiple Family Residential District, and Brentwood Town Centre Plan as guidelines)\n- Proposed Zoning: Amended CD Comprehensive Development District (based on C3 General Commercial District and Brentwood Town Centre Plan as guidelines and in accordance with the development plan entitled \"The Amazing Brentwood Phase 2C-Tower 7\" prepared by Arcadis Architects (Canada) Inc.)\nRecommendations:\n1. Prepare a Rezoning Bylaw for REZ #22-36 and advance it to First Reading and a Public Hearing at a future date.\n2. Establish prerequisites for the completion of the rezoning, including the submission of a suitable plan of development, deposit of sufficient monies for services, installation of underground electrical, telephone, and cable servicing, removal of existing improvements, dedication of necessary rights-of-way, and compliance with various guidelines and criteria.\nChief Administrative Officer's Comments: Concurs with the recommendation of the General Manager Planning and Development.\nExecutive Summary: A rezoning application has been received to construct a high-rise commercial rental residential apartment building in accordance with the Brentwood Site Conceptual Master Plan and associated Development Guidelines. Recommends bringing the Rezoning Bylaw forward for First Reading and forwarding the application to a future Public Hearing.\nPolicy Section: The proposed rezoning application is consistent with various policies and plans adopted by Council, including the Regional Context Statement, Corporate Strategic Plan, Official Community Plan, Brentwood Town Centre Development Plan, and others.\nBackground: On September 23, 2013, Council granted Final Adoption to REZ #11-22, establishing the Brentwood Site Conceptual Master Plan and associated Development Guidelines. The subject site is located within the Brentwood Town Centre Development Plan and is designated for C3 General Commercial District.\nThe CD Comprehensive Development District is being amended to the CD Comprehensive Development District. The proposed rezoning is based on the C3 General Commercial District and Brentwood Town Centre Plan as guidelines. The applicant has submitted a development plan for a Public Hearing.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      2,
      3
    ],
    "type": "text",
    "createDate": "2024-02-06T18:00:12.696Z",
    "updateDate": "2024-02-06T18:00:12.697Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72948",
    "text": "Meeting: October 30, 2023\nFile: REZ 22-09\nCouncil Report to: Mayor & Council\nFrom: General Manager Planning and Development\nSubject: REZ #22-09 – 5166 Halifax Street – Brentwood Town Centre Development Plan\nPurpose: Seek Council authorization to forward REZ #22-09 to a future Public Hearing.\nRecommendations:\n1. Authorize the introduction of a Housing Agreement Bylaw according to the terms outlined in Sections 3.2 and 3.8 of the report.\n2. Authorize the introduction of a Highway Closure Bylaw according to the terms outlined in Section 3.12 of the report.\n3. Approve the sale of City-owned property for inclusion within the development site.\n4. Prepare and advance a Rezoning Bylaw for REZ #22-09 to First Reading and a Public Hearing.\n5. Establish prerequisites for the completion of the rezoning.\nExecutive Summary: Rezoning application received for the construction of two mid-rise residential buildings with underground parking. Recommend bringing the Rezoning Bylaw forward for First Reading and forwarding the application to a future Public Hearing.\nPolicy Section: Proposed rezoning application consistent with various policies and plans adopted by Council.\nBackground: Council authorized staff to work with Amacon Development Corporation Inc. for the development of two sites within Brentwood Town Centre. Density transfer approved from Halifax Site to Rosser Site. Subject site currently improved with an older residential rental apartment building.\nGeneral Information: Proposed development plan includes two six-storey midrise, mixed-tenure rental residential buildings with an internal courtyard, amenity spaces, and underground parking. Demolition of existing site improvements and replacement with two buildings totaling 257 rental residential dwelling units.\n- Proposed development offers modern aesthetic, inclusive design, street-level unit access, shared amenity spaces, and communal courtyard.\n- Development provides range of housing types including studios, one-bedroom units, and family-oriented units such as three-bedroom and den units and three-bedroom townhouses.\n- Subject proposal exemplifies high quality urban design and architectural expression related to building's siting, massing, pedestrian orientation, and materiality.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      3,
      4
    ],
    "type": "text",
    "createDate": "2024-02-06T17:59:49.312Z",
    "updateDate": "2024-02-06T17:59:49.312Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72955",
    "text": "Meeting: October 30, 2023\nFile: REZ 22-08\nCouncil Report to: Mayor & Council\nFrom: General Manager Planning and Development\nSubject: REZ #22-08-2211 and 2271 Rosser Avenue-Brentwood Town Centre Development Plan\nPurpose: Seek Council authorization to forward REZ #22-08 to a future Public Hearing.\nRecommendations:\n1. Authorize the introduction of a Housing Agreement Bylaw according to the terms outlined in Sections 3.2 and 3.9 of the report.\n2. Authorize the introduction of a Highway Closure Bylaw according to the terms outlined in Section 3.14 of the report.\n3. Approve the sale of City-owned property for inclusion within the development site.\n4. Prepare and advance a Rezoning Bylaw to First Reading and a Public Hearing.\n5. Establish prerequisites to the completion of the rezoning.\nChief Administrative Officer's Comments: Concur with the recommendation.\nExecutive Summary: Rezoning application received for the construction of a high-rise residential building with commercial space and underground parking. Recommend bringing the Rezoning Bylaw forward for First Reading and forwarding the application to a future Public Hearing.\nPolicy Section: Proposed rezoning application consistent with various policies and plans adopted by Council.\nBackground: Council authorized staff to work with the applicant for the development of the subject site and another site. Density transfer approved for the subject site. Site is approximately 4,333 m2 in size and currently improved with industrial units and a residential sales centre. Designated for medium to high-density development under the Brentwood Town Centre Development Plan.\nHigh-density mixed-use development will be implemented using the RM4, RM4s, RM4r, and C9 Districts as guidelines. The C9 District designation is limited to commercial uses and applies only to 2211 Rosser Avenue. The addition of the C3 District designation is supported by staff to allow for the development of a hotel on the site. The hotel will complement the existing and potential future commercial and residential development in the area. The C3 District designation is limited to hotel use and does not allow for additional density beyond what is necessary for the hotel. The hotel and commercial uses will be located at 2211 Rosser Avenue.\n\nUnder the 's' zoning category, new developments are expected to provide community benefits, a sustainable redevelopment approach, public realm improvements including public art, high-quality urban design, and superior architectural expression. The applicant has submitted a suitable plan of development that meets these standards and can be presented at a Public Hearing.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      3,
      4
    ],
    "type": "text",
    "createDate": "2024-02-06T17:59:21.627Z",
    "updateDate": "2024-02-06T17:59:21.627Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72959",
    "text": "Meeting: October 30, 2023\nFile: 49500 02 REZ #22-06\nCouncil Report: To seek Council authorization to forward REZ #22-06 to a future Public Hearing.\nAddress: 4141 Lougheed Highway\nLegal: Lot 21 District Lot 119 Group 1 New Westminster District Plan 25896\nApplicant: Adam Nour, Millennium Properties Ltd.\nCurrent Zoning: M1 Manufacturing District\nProposed Zoning: CD Comprehensive Development District based on RM5s Multiple Family Residential District, RM5r Multiple Family Residential District, C3 General Commercial District, and the Brentwood Town Centre Development Plan as guidelines, and in accordance with the development plan entitled \"4141 Lougheed Hwy Mixed Use Development\" prepared by FaulknerBrowns Architects.\nRecommendations:\n1. Prepare a Rezoning Bylaw for REZ #22-06 and advance it to First Reading and a Public Hearing at a future date.\n2. Authorize the introduction of a Housing Agreement Bylaw according to the terms outlined in Sections 3.4 and 3.12 of the report, contingent upon the granting of Second Reading of the Rezoning Bylaw.\n3. Authorize the introduction of a Highway Closure Bylaw according to the terms outlined in Section 3.9 of the report, contingent upon the granting of Second Reading of the Rezoning Bylaw.\n4. Approve the sale in principle of City-owned property for inclusion within the subject development site according to the terms outlined in Section 3.9 of the report, and subject to the applicant pursuing the rezoning proposal to completion.\n5. Establish prerequisites to the completion of the rezoning, including the submission of a suitable plan of development, deposit of sufficient monies for all necessary services, installation of underground wiring, removal of existing improvements, utilization of an amenity bonus, completion of the Highway Closure Bylaw and sale of City property, consolidation of the project site into one legal parcel, dedication of requisite rights-of-way, granting of necessary statutory rights-of-way, easements, and/or covenants, registration of a Housing Covenant and Housing Agreement, submission of a suitable on-site Stormwater Management System, compliance with the City's Groundwater Management for Multi-Family Development guidelines.\n6. Require the posting of a sign on the subject site indicating the rezoning application and public hearing, or until all units are sold, whichever is greater.\nChief Administrative Officer's Comments: The Chief Administrative Officer concurs with the recommendation of the General Manager Planning and Development.\nExecutive Summary: A rezoning application has been received to permit the construction of a high-density mixed-tenure residential development atop a commercial/retail podium and underground parking. The purpose of this report is to provide Council with information on the proposal and recommend forwarding the rezoning application to a future Public Hearing.\nPolicy Section: The proposed rezoning application is consistent with various policies and plans adopted by Council.\nBackground: The subject site is part of the Buchanan West Master Plan and is designated for high-density mixed-use development. The site is currently improved with an older industrial warehouse building and surface parking. The initial rezoning report was received on June 20, 2022.\n\nDevelopment District will use RM5s Multiple Family Residential District, RM5r Multiple Family Residential District, C3 General Commercial District, and Brentwood Town Centre Development Plan as guidelines. Applicant submitted a development plan for two high-rise residential apartment buildings on top of a commercial/retail podium and underground parking. Vehicle access is currently through 1934 Gilmore Avenue and will also be provided from and to the east once 4199 Lougheed Highway is redeveloped. Pedestrian access is available from Lougheed Highway and the future east-west street on the site's northern portion. The development will be constructed in a single phase. It involves demolishing the existing warehouse and surface parking and constructing a 62-storey residential strata building (Building A) in the northeast corner and a 54-storey residential market and non-market rental building (Building B) in the southwest corner. Both buildings sit on a 10-storey commercial podium that includes a hotel(s) with amenities and retail units. The commercial podium can be used for offices or other employment generating uses if the hotel market softens in the future.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      3,
      4
    ],
    "type": "text",
    "createDate": "2024-02-06T17:58:39.672Z",
    "updateDate": "2024-02-06T17:58:39.672Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72944",
    "text": "Meeting: October 30, 2023\nFile: 49500 20 REZ 21-16\nCouncil Report: REZ #21-16 - 5292 and 5318 Kingsway - Mixed Use Development - Royal Oak Community Plan\nPurpose: Seek Council authorization to forward REZ #21-16 to a future Public Hearing.\nRecommendations:\n1. Prepare a Rezoning Bylaw for REZ #21-16 and advance it to First Reading and a Public Hearing.\n2. Authorize the introduction of a Housing Agreement Bylaw, contingent upon Second Reading of the Rezoning Bylaw.\n3. Authorize the introduction of a Highway Closure Bylaw, contingent upon Second Reading of the Rezoning Bylaw.\n4. Approve the sale of City-owned property for inclusion in the development site, subject to the completion of the rezoning proposal.\n5. Establish prerequisites for the completion of the rezoning, including the submission of a development plan, deposit of sufficient funds, installation of necessary services, consolidation of the project site, removal of existing improvements, registration of a Housing Agreement and Housing Covenant, submission of a stormwater management system, compliance with groundwater management guidelines, dedication of rights-of-way, and granting of necessary rights-of-way, easements, and covenants.\nChief Administrative Officer's Comments: Agrees with the recommendations.\nExecutive Summary: Rezoning application received for mixed-use development with two six-storey buildings and 85 residential units. Recommend bringing the Rezoning Bylaw forward for First Reading and a future Public Hearing.\nPolicy Section: Proposed rezoning application consistent with various policies and plans adopted by Council.\nBackground: Subject development site located along Kingsway and Grimmer Street. Initial rezoning report received in June 2021. Applicant proceeding with rezoning proposal despite potential future updates to the Royal Oak Community Plan. Proposal aligns with existing plan and medium density mixed-use designation.\nGeneral Information: Development proposal includes two six-storey buildings with commercial uses at grade and 85 residential units. Maximum potential density is 3.025 FAR.\n1. Retain original information, do not summarize.\n2. Shorten sentences without losing information.\n3. Only provide the results, do not explain anything.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      3,
      4
    ],
    "type": "text",
    "createDate": "2024-02-06T17:58:13.472Z",
    "updateDate": "2024-02-06T17:58:13.472Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1-_Application_by_Terra_8120_Number_1_Road70930.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: October 25, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 21-945869\nRe: Application by Terra 8120 Number 1 Road Limited Partnership for Rezoning at 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” Zone to the “Low Density Townhouses (RTL4)” Zone\n\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10498, for the rezoning of 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, be introduced and given first reading.\n\nREPORT CONCURRENCE\nAffordable Housing\nCONCURRENCE OF GENERAL MANAGER\nCity of Richmond\n\nStaff Report\nOrigin: Terra 8120 Number 1 Road Limited Partnership (on behalf of Cliff Chun and Kai Shen Hsiung of 1296168 BC Ltd. and Yi Jen Wang and Kai Shen Hsiung of Terra West Properties Ltd.) has applied to the City of Richmond for permission to rezone 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, to permit the development of nine townhouse units, with vehicle access from No. 1 Road.\n\nFindings of Fact\n- The subject site consists of two lots located on the east side of No. 1 Road, between Blundell Road and Coldfall Road.\n- The subject site consists of two lots, each containing a single-family dwelling that is tenant occupied. The existing dwellings are proposed to be demolished.\n- Existing development surrounding the subject site includes three lots to the north, two with newer construction zoned “Compact Single Detached (RC1)” and one zoned “Single Detached (RS1/E)”, each containing a single-family dwelling.\n- Existing development to the south is a lot zoned “Single Detached (RS1/E)”, containing a single-family dwelling, and a large lot zoned “Low Density Townhouses (RTL4)”, containing 28 townhouses.\n- Existing development to the east consists of lots zoned “Single Detached (RS1/B)”, each containing a single-family dwelling fronting Corless Place.\n- Existing development to the west across No. 1 Road are compact lots zoned “Single Detached (RS1/K)” and “Compact Single Detached (RC1)”, each containing a single-family dwelling.\n\nRelated Policies & Studies\n- The Official Community Plan (OCP) land use designation for the subject properties is “Neighbourhood Residential”.\n- The Arterial Road Land Use Policy designation for the subject properties is “Arterial Road Townhouse”.\n- The development criteria for townhouses in the Arterial Road Land Use Policy call for land assembly with a minimum 50 m frontage on a major arterial road and avoiding the creation of residual sites with less than a 50 m frontage.\n- The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204.\n\nPublic Consultation\n- A rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\n\nAnalysis\n- The proposed development consists of nine townhouse units on a site that would be approximately 1,801.3 m2 (19,389 ft2) in area after the required 0.91 m wide road dedication along No. 1 Road.\n- The proposed site layout consists of one three-storey building along the west side of the site facing No. 1 Road, two two-storey duplex buildings along the east side of the site along the interface with existing single-family housing fronting Corless Place, and an internal drive-aisle that runs north-south between the front and rear buildings.\n- All units have an east-west orientation, with the main unit entries facing either No. 1 Road or the internal drive-aisle.\n- Private outdoor space for the units fronting No. 1 Road is proposed primarily in the form of front yards at ground level with secondary decks on the upper levels facing either No. 1 Road or the internal drive-aisle. Private outdoor space for the two-storey units is proposed primarily in the form of rear yards.\n- The location of the secondary upper decks will be refined during the Development Permit application review process.\n- Common outdoor amenity space is proposed in the southeast corner of the site and meets the minimum guidelines in the OCP.\n- The design of the common outdoor amenity space can be further examined during the DP application review process.\n- The common outdoor amenity space can be expanded when the adjacent property to the south is redeveloped for townhouses.\n- The applicant proposes to submit a contribution to the City's Leisure Facilities Reserve Fund instead of providing common indoor amenity space on-site.\n- The contribution for the nine-unit townhouse proposal is $18,594.00.\n- A City Statutory Right-of-Way (SRW) is registered on Title for the sanitary sewer and encroachment is not permitted.\n- The proposal is for nine strata-titled townhouse units.\n- A restrictive covenant will be registered on Title to prohibit rental restrictions and age-based restrictions on occupants.\n- Vehicle access to the site is proposed off No. 1 Road.\n- Pedestrian access to the street-fronting units will be provided via individual pathways.\n- On-site parking will be provided within each unit's garage.\n- Two visitor surface parking spaces will be provided off the internal drive-aisle.\n- Resident and visitor bike parking will be provided.\n- A Certified Arborist's Report has been submitted, identifying trees on-site and off-site.\n- Some trees on-site are in poor condition and should be removed and replaced.\n- Trees on neighboring properties will be retained and protected.\n- Tree protection measures will be implemented during the development stage.\n- A tree survival security of $5,000.00 will be required for one tree.\n- A total of 13 trees on-site are proposed to be removed.\n- 26 replacement trees are required to be planted on-site.\n- The applicant proposes to contribute $6,750.00 to the City's Tree Compensation Fund instead of planting the remaining nine replacement trees.\n- The applicant is required to submit a Landscaping Security prior to DP issuance.\n- Variance requests are being sought to reduce the minimum required lot width and allow six small vehicle parking spaces.\n- Staff is supportive of the variance requests.\n",
    "maxPages": 8,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-06T04:49:42.022Z",
    "updateDate": "2024-02-06T04:49:42.023Z"
  }
]