[
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_3_6571___6591__No72097.pdf",
    "text": "City of Richmond Report to Development Permit Panel\n\nTo: Development Permit Panel\nDate: December 18, 2023\nFrom: Wayne Craig\nFile: DP 22-021165\nDirector, Development\n\nRe: Application by 0853803 BC Ltd. and 1121648 BC Ltd. for a Development Permit at 6571 and 6591 No. 1 Road\n\nStaff Recommendation:\n1. Permit the construction of eight townhouse units at 6571 and 6591 No. 1 Road on a site zoned \"Low Density Townhouses (RTL4)\".\n2. Vary the provisions of Richmond Zoning Bylaw 8500 to reduce the minimum required lot width on major arterial roads from 50.0 m to 40.2 m.\n\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:ak\nAtt. 3\n7501936\nDecember 18, 2023\n\nStaff Report\nOrigin: DP 22-021165\n\n0853803 BC Ltd. (Director: Simerjit and Gurjit Malhi) and 1121648 BC Ltd. (Director: Ajit Thaliwal) has applied to the City of Richmond for permission to develop eight townhouse units at 6571 and 6591 No. 1 Road on a site zoned \"Low Density Townhouses (RTL4)\". The site currently contains one single-family dwelling (on 6591 No 1 Road).\n\nThe site is being rezoned from \"Single Detached (RS 1/F)\" to \"Low Density Townhouses (RTL4)\" for this project under Bylaw 10288 (RZ 16-731275).\n\nA Servicing Agreement is required as a condition of rezoning and includes, but is not limited to, the following improvements:\n- Permanent closure of the existing southerly driveway (at 6591 No. 1 Road)\n- Installation of new water, storm and sanitary service connections.\n\nDevelopment Information:\nPlease refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nBackground:\nDevelopment surrounding the subject site is as follows:\n- To the north: A single detached dwelling on property designated for arterial road townhouse development in the Official Community Plan (OCP) and zoned \"Single Detached (RS 1/F)\".\n- To the east: Across from No. 1 Road, single detached dwellings, designated for single detached development in the OCP and zoned \"Single Detached (RS2/C)\".\n- To the south: A three-storey townhouse complex zoned \"Town Housing (ZT27)-Robson Drive/Court (Terra Nova)\".\n- To the west: A three-storey townhouse complex zoned \"Town Housing (ZT27)-Robson Drive/Court (Terra Nova)\".\n\nRezoning and Public Hearing Results:\nDuring the rezoning process, staff identified the following design issues to be resolved at the Development Permit stage:\n- Compliance with Development Permit Guidelines for the form and character of multiple-family projects provided in the OCP.\n- Refinement of landscape design, fencing and interface with abutting lots.\n- Review of retaining wall heights and requirements for guardrails.\n- Further assessment of the potential relocation of the front yard hedge.\n- Refinement of the outdoor amenity area design, including the choice of play equipment.\n- Review of relevant accessibility features for the proposed convertible unit and aging-in-place design features in all units.\n- Review of a sustainability strategy for the development proposal and ensuring that the development meets or exceeds the City's required Energy Step Code for Part 9 construction applicable at time of construction.\n\nThe Public Hearing for the rezoning of this site was held on March 21, 2022. No public correspondence was received at the Public Hearing.\n\nStaff worked with the applicant to address the above issues in the following ways:\n- Detailed architectural and landscape plans have been provided to demonstrate that the proposed development is generally consistent with the Development Permit guidelines for multi-family projects and Arterial Road Guidelines for Townhouses in the OCP.\n- Detailed landscape plans have been submitted and provide a mix of coniferous and deciduous replacement trees, which meet the bylaw size requirements.\n- The applicant has refined the design of the retaining wall and has provided handrails for the proposed steps by the southwest corner of the site as per BC Building Code requirements.\n- The hedge on-site is proposed to be relocated to the rear of the site and integrated as part of the landscaping.\n- The design of the outdoor amenity area for this townhouse development includes a children's play structure and a bench for parental interaction and to promote social interaction surrounded by landscaping.\n- The proposed accessibility features include aging-in-place features in all units and one convertible unit.\n- The applicant has provided a sustainability strategy and a letter from a Certified Energy Advisor indicating that the project will achieve Step 3 of the BC Energy Step Code with Low Carbon Emission Systems, consistent with current City regulations.\n\nStaff Comments:\nThe proposed scheme attached to this report has satisfactorily addressed the significant urban design issues and other staff comments identified as part of the review of the subject Development Permit application (Plans #1 to #20). In addition, it complies with the intent of the applicable sections of the Official Community Plan and is generally in compliance with the \"Low Density Townhouses (RTL4)\" zone, except for the zoning variance noted below.\n\nZoning Compliance Variance (staff comments in bold):\nThe applicant requests to vary the provisions of Richmond Zoning Bylaw 8500 to reduce the minimum lot width from 50.0 m to 40.2 m. Staff supports the proposed variance as the proposal is generally consistent with the guiding principles of the Arterial Road Land Use Policy and guidelines. The need for this variance was identified in the rezoning staff report and no concerns were raised during the Public Hearing at rezoning stage. The applicant was unable to acquire the adjacent site to the north to increase the lot width as the owner advised they were not interested in selling.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T17:01:32.508Z",
    "updateDate": "2024-02-07T17:01:32.508Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_2_13888_Wireless_Way72096.pdf",
    "text": "To: City of Richmond Development Permit Panel\nReport to Development Permit Panel\nDate: December 18, 2023\nFrom: Wayne Craig\nFile: DP 21-943418\nDirector, Development\nRe: Application by Karla Castellanos Architect for a Development Permit at 13888 Wireless Way\nStaff Recommendation\nThat a Development Permit be issued which would permit the construction of a three-storey light industrial and ancillary office building on a new lot created through subdivision of the west portion (proposed Lot 1) of the subject site at 13888 Wireless Way, on a site zoned \"Industrial Business Park (ZI3) Crestwood Area (East Cambie)\"; and, to vary the provisions of Richmond Zoning Bylaw 8500 to:\na) Reduce the required number of parking spaces from 2.8 spaces to 0.75 spaces for each 100 m2 of gross leasable floor area of building on Lot 1;\nb) Reduce the minimum required number of large-sized on-site designated loading spaces on Lot 1 from 1 space to 0 spaces; and,\nc) Reduce the minimum percentage of standard parking spaces on Lot 2 from 50 per cent to 30 per cent.\nd Wa~aig WC:cl Att. 4 December 18, 2023 - 2 -\nStaff Report\nOrigin DP 21-943418\nKarla Castellanos Architect has applied to the City of Richmond (on behalf of Alan Yong, S-506 Holdings Ltd.) for permission to develop a three-storey light industrial and ancillary office building of approximately 3,748 m2 (40,353 ft2) containing 11 strata-titled units on a new lot (Lot 1) created through subdivision on the west portion of the subject site at 13888 Wireless Way, zoned \"Industrial Business Park (ZI3) - Crestwood Area (East Cambie)\". The existing office building is to remain on a new lot on the east portion of the subject site (Lot 2). This proposal aligns with the City's objectives of intensifying existing industrial lands. A location map of the subject site is provided in Attachment 1. A survey of the subject site showing the proposed subdivision plan is provided in Attachment 2. This proposal also involves landscaped restoration within the existing Riparian Management Area (RMA) along the south side of the existing site, as well as improvements to pedestrian circulation and landscaping within the surface parking area on Lot 2. Concurrent with this DP application, there is an application to subdivide the subject site into two lots under the existing Zl3 zone, which must be approved prior to DP issuance (SD 22-025862). A Servicing Agreement (SA) to design and construct the following improvements is required prior to Building Permit issuance, including (but not limited to):\n• Upgrading the existing watermain along the Sparwood Place frontage to meet the minimum required fire flow and fulfill the distance requirement between hydrant and the proposed building.\n• Upgrading approximately 85 m (278 ft.) of the storm sewer along the Wireless Way frontage.\n• The water, storm and sanitary service connections.\nDevelopment Information\nPlease refer to attached Development Application Data Sheet for a comparison of the proposed development data with the relevant Bylaw requirements (Attachment 3).\nExisting Site and Surrounding Context\nThe subject site is located on the south side of Wireless Way between No. 6 Road and Knight Street. The site is approximately 20,090 m2 (216,246 ft2) in area and currently contains an existing office building as well as a large surface parking area, with vehicle access from both Wireless Way and Sparwood Place. The subject site is proposed to be subdivided into two new lots of approximately 3,861 m2 (41,548 ft2) in area (Lot 1) and 16,227 m2 (174,698 ft2) in area (Lot 2).\n7451673 December 18, 2023 - 3 -\nDP 21-943418\nExisting development immediately surrounding the subject site is as follows:\n• To the North: Immediately across Wireless Way: light industrial and office buildings on lots zoned \"Industrial Business Park (IB1)\" and \"Industrial Business Park (ZI3) - Crestwood Area (East Cambie)\" at 13351 and 13353 Commerce Parkway and 13811 and 13911 Wireless Way, respectively.\n• To the East: Fronting No. 6 Road: Light industrial and office buildings on lots zoned \"Industrial Business Park (IB1)\" at 13931 Sparwood Place and 5871 No. 6 Road; Richmond Fire-Rescue's No. 7 Fireball on a lot zoned \"School & Institutional Use (SI)\" at 5731 No. 6 Road; and a surface parking lot on a lot zoned \"Industrial Business Park (ZI3) - Crestwood Area (East Cambie)\" at 5611 No. 6 Road.\n• To the South: Single-family dwellings and agricultural uses on lots zoned \"Agriculture (AG1)\" on the south side of Westminster Highway at 13560 to 13720 Westminster Highway.\n• To the West: Light industrial and office buildings on a lot zoned \"Industrial Business Park (IB1)\" at 13880 Wireless Way.\nPublic input during the DP Application Review Process\nStaff has not received any comments from the public in response to the placement of the DP Application Notification Sign on the subject site.\nStaff Comments\nThe proposed scheme attached to this report (Plans #1 to #4.C and Reference Plans) has satisfactorily addressed the significant urban design issues and other staff comments identified as part of the review of the subject DP application. In addition, it complies with the intent of the applicable sections of the Official Community Plan and is generally in compliance with the ZI3 zone, with the exception of the zoning variances noted below.\nZoning Compliance/Variances (staff comments in bold italics)\nThe Applicant requests to vary the provisions of Richmond Zoning Bylaw 8500 to:\n1) Reduce the required number of parking spaces from 2.8 spaces to 0.75 spaces for each 100.0 m2 of gross leasable floor area of building on Lot 1.\nThe site-specific parking rate of 2.8 spaces per 100.0 m2 of gross leasable floor area of building was established with the rezoning of the site to the ZI3 zone in 2004. In 2021, the City's Zoning Bylaw was amended to include reduced parking requirements for industrial uses of 0.75 spaces per 100 m2 of gross leasable floor area. The requested variance to provide 0.75 spaces for each 100.0 m2 of gross leasable floor area of building on Lot 1 reflects the intended use of Lot 1 and is consistent with current standard parking requirements for the \"Industrial, general\" use that specified in the current Zoning Bylaw. The Applicant has proposed Transportation Demand Management (TDM) measures to support the requested variance, including an employee shuttle service between the subject site and the Bridgeport Canada Line station during peak hours, and a subsidized monthly transit pass program to Lot 1 employees, which will run for three years. 7451673\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T17:00:44.925Z",
    "updateDate": "2024-02-07T17:00:44.925Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_1_4571_4591___4611__Steveston_Hway72095.pdf",
    "text": "City of Richmond Report to Development Permit Panel\n\nTo: Development Permit Panel\nDate: December 18, 2023\nFrom: Wayne Craig\nFile: DP 20-919145\nDirector, Development\n\nRe: Application by Jonathan King for a Development Permit at 4571, 4591, and 4611/4631 Steveston Highway\n\nStaff Recommendation:\n1. Permit the construction of 16 townhouse units at 4571, 4591, and 4611/4631 Steveston Highway on a site zoned \"Low Density Townhouses (RTL4)\".\n2. Vary the provisions of Richmond Zoning Bylaw 8500 to reduce the front yard setback along Steveston Highway from 6.0 m to 4.50 m.\n\nWayne Craig\nDirector, Development\n(604-247-4625)\n\nStaff Report\n\nOrigin: DP 20-919145\n\nJonathan King (on behalf of Gurpreet Mann, director of 0780012 BC Ltd., Jonathan King and Sandra Rotholc-King, directors of 2517294 Ontario Inc., Azim Bhimani, director of Luxor Homes & Developments Ltd., Gurpreet Mann and Narinder Mann) has applied to the City of Richmond for permission to develop 16 townhouse units at 4571, 4591, and 4611/4631 Steveston Highway. One of the townhouse units is proposed to contain a ground-level secondary suite.\n\nThe site is being rezoned from \"Single Detached (RSl/E)\" and \"Two-Unit Dwellings (RDl)\" zones to the \"Low Density Townhouses (RTL4)\" zone for this project under Bylaw 10081 (RZ 18-839945), which is currently at third reading.\n\nA Servicing Agreement is required as a condition of Building Permit issuance and includes, but is not limited to, the following improvements:\n- Removal of existing sidewalk and replacement with a new 1.5 m concrete sidewalk at the property line and minimum 1.5 m wide landscaped boulevard with street trees behind the existing curb.\n- Removal of the existing driveway crossings and replacement with the frontage works described above.\n- Construction of a new driveway crossing designed to provide \"right in, right out\" access to the site.\n\nDevelopment Information\n\nPlease refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nBackground\n\nDevelopment surrounding the subject site is as follows:\n- To the north: Single-family dwellings fronting Bonavista Drive on lots zoned \"Single-Detached (RS 1/B).\"\n- To the south: Across Steveston Highway, single-family dwellings on lots zoned \"Single-Detached (RS 1/B)\", which are identified for compact lot coach house development under the Arterial Road Land Use Policy.\n- To the east and west: Single-family dwellings on a lot zoned \"Single Detached (RS 1/E)\", which are identified for townhouse development under the Arterial Road Land Use Policy.\n\nRezoning and Public Hearing Results\n\nThe Public Hearing for the rezoning of this site was held on October 21, 2019. No concerns regarding the rezoning application were expressed at the Public Hearing.\n\nStaff Comments\n\nThe proposed scheme attached to this report has satisfactorily addressed the significant urban design issues and other staff comments identified as part of the review of the subject Development Permit application. In addition, it complies with the intent of the applicable sections of the Official Community Plan (OCP) and is generally in compliance with the \"Low Density Townhouse (RTL4)\", except for the zoning variance noted below.\n\nZoning Compliance/Variance (staff comments in bold)\n\nThe applicant requests to vary the provisions of Richmond Zoning Bylaw 8500 to reduce the front yard setback along Steveston Highway from 6.0 m to 4.50 m. Staff supports the proposed variance as it is consistent with the Development Permit Guidelines for Townhouses on arterial roads in the OCP, which support front yard setbacks at 4.5 m (14.8 ft.) where a 6 m (19.7 ft.) rear yard setback to both the ground and second floors of the rear units is provided. The result will provide a wider space between the rear units of the subject development and the single-family dwellings that back onto the subject site. It will also provide a larger buffer to accommodate tree retention along the rear property line. The resulting distance from the back of the curb to the building face would be approximately 8.47 m. The reduced front yard setback does not compromise tree preservation or tree planting opportunities along the site frontage. The proposed architectural design provides appropriate building articulation and interface with neighboring properties. To address the road traffic noise from Steveston Highway, the project acoustical engineer confirmed that the proposed development is designed to meet the interior noise limits as per the CMHC standards. This variance was identified at the rezoning stage, and no concerns were identified at that time.\n\nAdvisory Design Panel Comments\n\nThe Advisory Design Panel (ADP) has reviewed the project and supports it. A copy of the relevant excerpt from the Advisory Design Panel Minutes from Thursday, July 20, 2023 is attached for reference (Attachment 2). The design response from the applicant has been included immediately following the specific Design Panel comments and is identified in 'bold italics'.\n\nAnalysis\n\nConditions of Adjacency\n- The proposed form, massing, and orientation of the buildings are compatible with the existing adjacent developments on the block.\n- While three-storey units are proposed along Steveston Highway, the building height is stepped down to two-storeys along the east property line to provide appropriate transition to the adjacent single-family home.\n- Along the west property line, an entry driveway is being proposed and the three-storey building will be set back 9.42 m from the west property line.\n- Two-storey units in duplex form, as well as the outdoor amenity area, are proposed along the rear (north) property line to minimize privacy and overlook concerns.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:59:53.419Z",
    "updateDate": "2024-02-07T16:59:53.419Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_9300_9320_Cambie_Road66187.pdf",
    "text": "City of Richmond Report to Development Permit Panel\nTo: Development Permit Panel\nDate: January 23, 2023\nFrom: Wayne Craig\nFile: DP 21-933765\nDirector, Development\nRe: Application by Interface Architecture Inc. for a Development Permit at 9300 and 9320 Cambie Road\nStaff Recommendation\nThat a Development Permit be issued which would:\n1. Permit the construction of 126 residential units in a five-storey multi-family apartment building over a common parkade at 9300 and 9320 Cambie Road on a site zoned \"Low Rise Apartment (ZLR43)-Alexandra Neighbourhood (West Cambie)\".\n2. Vary the provisions of Richmond Zoning Bylaw 8500 to:\na) Increase the maximum lot coverage of buildings from 40 to 43 per cent; and\nb) Reduce the minimum width of one manoeuvring aisle in the parkade from 6.7 m to 6.4 m.\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:el\nAtt. 3\n6862789\nJanuary 23, 2023\n\nStaff Report\nOrigin DP 21-933765\nInterface Architecture Inc. has applied to the City of Richmond on the behalf of Westmark Developments (Camosun) Ltd. (Directors: Harmel Singh Bains and Ravjot Singh Bains) for permission to develop 126 residential units in a five-storey multi-family apartment building over a common parkade at 9300 and 9320 Cambie Road on a site zoned \"Low Rise Apartment (ZLR43)-Alexandra Neighbourhood (West Cambie)\". The development proposal provides five affordable housing units distributed throughout the building, consistent with the West Cambie Area Plan. The site is currently vacant. The site is being rezoned from \"Single Detached (RS 1/F)\" to \"Low Rise Apartment (ZLR43) Alexandra Neighbourhood (West Cambie)\" for this project under Bylaw 10219 (RZ 18-835042) which received third reading on January 18, 2021.\n\nHighlights of the proposed development include:\n• The development site is split into two parts due to the required dedication of McKim Way east-west through the lots.\no The northern portion of the site will have a residential building containing 126 apartment units.\no The southern portion of the site will have an outdoor amenity space with garden plots for the exclusive use of the residents in the apartment block.\n• The development provides a range of unit types from one bedroom to three-bedroom plus den; thereby providing homes for a broad range of family sizes.\no Unit areas are proposed to range from 58.9 m2 to 152.3 m2 (634 ft2 to 1,639 ft2).\no All the units will be connected to the Alexandra District Energy Utility.\n• The indoor amenity space encompass approximately 548.5 m2 (5,904 ft2) and will include a fitness centre and a multipurpose room on the first floor, as well as a common amenity room (for study, music, dance, play, movies, etc.) on each resident floor.\n• The outdoor amenity space will be approximately 1,147 m2 (12,347 ft2) in area, including a community garden on the south side of McKim Way and three programmed areas on top of the parking podium.\n\nA Servicing Agreement will be required for this development, and includes the following:\n• New fire hydrants, watermain and storm sewer upgrades.\n• Frontage improvements along Cambie Road.\n• Full road construction of McKim Way.\n• Greenway extension south side of McKim Way.\n\n6862789\nJanuary 23, 2023\n\nDP 21-933765\nDevelopment Information\nPlease refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nBackground\nThe subject site is located on the south side of Cambie Road approximately centred between Dubbert Street to the west and Stolberg Street to the east. The site is in the Alexandra Neighbourhood of the West Cambie Planning Area. After road dedications of approximately 1,281.9 m2 (13,798 ft2), the net site will be approximately 6,735.6 m2 (72,501 ft2) in area.\n\nDevelopment surrounding the subject site is as follows:\nTo the North: Across Cambie Road, lots zoned \"Single Detached (RS 1/B)\" that back onto Cambie Road.\nTo the East: A six-storey residential apartment block with a day care centre on a site specific zone. This development at 4033, 4099, 4133 Stolberg Street and 9388 Cambie Road is referred to as REMY.\nTo the South: Across McKim Way, two low-rise residential apartment complexes (four to six storeys) on site specific zones.\nTo the West: A three-storey townhouse development on a site specific zone.\n\nRezoning and Public Hearing Results\nThe Public Hearing for the rezoning of this site was held on January 18, 2021. At the Public Hearing, the following concerns were expressed; the responses to the concerns are provided in italics.\n1. Impact of the massing and orientation of the proposed building on the adjacent apartment building to the east (REMY).\nThe applicant worked with staff to review the massing (i.e. height, width, and footprint of the building). The proposal is designed to respond to the site context in the following ways:\n6862789\n• Set the building height at a maximum 5-storeys, an intermediate height between the 6-storey REMY building to the east and 3-storey townhouses to the west.\n• Position the central mass away from both the east side (REMY) and west (townhouses) to best balance considerations of shadowing, overlook, privacy and screening.\n• Pull back the north and south 'ends' at the top Level 5 to create 4-storey north & south 'ends'.\n• Taper the building's south-east corner to permit more direct sunlight to REMY's west building face.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:59:02.734Z",
    "updateDate": "2024-02-07T16:59:02.734Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/3_10151_Ainsworth_Crescent_DPP_05102366517.pdf",
    "text": "City of Richmond Report to Development Permit Panel\n\nTo: Development Permit Panel\nDate: April 20, 2023\nFrom: Wayne Craig\nFile: DP 22-019430\nDirector, Development\n\nRe: Application by Talvinder Jagde for a Development Permit at 10151 Ainsworth Crescent\n\nStaff Recommendation:\n1. Permit the construction of a coach house at 10151 Ainsworth Crescent on a site zoned \"Single Detached with Granny Flat or Coach House Edgemere (REI)\".\n2. Vary the provisions of Richmond Zoning Bylaw 8500 to:\n   a) Increase the maximum setback that a coach house is permitted to be located from the south property line from 2.0 m to 5.95 m.\n   b) Decrease the minimum setback that a coach house is permitted to be located from the north property line from 2.0 m to 0.90 m.\n\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:le\nAtt. 5\n7181149\nApril 20, 2023\n\nStaff Report\n\nOrigin: DP 22-019430\n\nTalvinder Jagde, authorized agent for the property owners (Jim Kirk, Prabherjot Saini, and Robyn Kirk), has applied to the City of Richmond for permission to develop a 58.3 m2 (627.5 ft2) coach house at 10151 Ainsworth Crescent on a site zoned \"Single Detached with Granny Flat or Coach House - Edgemere (RE 1)\". A copy of a location map is attached (Attachment 1). The site currently contains one single detached house, which is proposed to be demolished (Attachment 2).\n\nDevelopment Information\n\nPlease refer to the attached Development Application Data Sheet (Attachment 3) for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nBackground\n\nDevelopment surrounding the subject site is as follows:\nTo the north: A single detached house on a lot zoned \"Single Detached with Granny Flat or Coach House - Edgemere (REI)\".\nTo the south: A single detached house on a lot zoned \"Single Detached with Granny Flat or Coach House - Edgemere (REI)\".\nTo the east: Across Ainsworth Crescent, a single detached house on a lot zoned \"Single Detached with Granny Flat or Coach House - Edgemere (REI)\".\nTo the west: Across the rear lane, a single detached house on a lot zoned \"Single Detached with Granny Flat or Coach House - Edgemere (REI)\".\n\nStaff Comments\n\nThe proposed scheme attached to this report has satisfactorily addressed the significant urban design issues and other staff comments identified as part of the review of the subject Development Permit application. In addition, it complies with the intent of the design guidelines for coach houses in the Edgemere neighbourhood contained in the City's Official Community Plan (OCP), and complies with the \"Single Detached with Granny Flat or Coach House - Edgemere (REI)\" zone except the below noted variances.\n\nZoning Compliance/Variances\n\nThe applicant has requested to vary the provisions of Richmond Zoning Bylaw 8500 to:\n1. Increase the maximum setback that a coach house is permitted to be located from the south property line from 2.0 m to 5.95 m.\n2. Decrease the minimum setback that a coach house is permitted to be located from the north property line from 2.0 m to 0.90 m.\n\nThe applicant has requested the above variances in order to locate the coach house safely outside of the tree protection zone of a significant tree (Tree ID# os3 - Douglas Fir, DBH 110 cm) located on the neighbouring property to the south (see Tree Retention and Replacement Plan, Attachment 4). In order to ensure that the entirety of the proposed coach house and garage are located outside of the Tree Protection Zone, while also maintaining consistency with Coach House design guidelines, the applicant proposes to shift the coach house and garage to the north side of the property.\n\nStaff supports the proposed variances as they provide for the retention of a significant tree (a 15 m tall Douglas fir with a diameter of 110 cm) which is in good condition. The City Arborist has reviewed the submitted Arborist Report and supports the efforts taken to shift the proposed coach house and garage as far to the north as possible, such that the development is located entirely outside of the Tree Protection Zone.\n\nThe proposed variances do not interfere with the overall design of the coach house which is generally consistent with the Development Permit guidelines. The applicant has also provided a shadow analysis (Attachment 5) that demonstrates that the variances to the setback requirements in the zone will not result in undue shadowing of the adjacent property to the north.\n\nAnalysis\n\nConditions of Adjacency:\n- The proposed coach house design relates to the proposed single detached housing form, character, and scale of the surrounding neighbourhood.\n- The proposed location of the coach house, which is set back between 1.5 m and 3.0 m from the rear lane, provides an adequate buffer to the adjacent lot to the west.\n- The majority of the floor space in the coach house building is proposed on the ground floor (60 per cent, i.e., entry, powder room, living, kitchen/dining), and the portion of the floor space located in the upper half-storey of the coach house is located in the middle of the overall building.\n- There are no windows proposed on the north or south side elevations to address concerns of overlook into the neighbouring properties. There are windows proposed on the west and east elevations of the coach house to provide passive surveillance of the lane and maximize light penetration.\n\nUrban Design and Site Planning:\n- Consistent with the OCP guidelines for coach houses in the Edgemere neighbourhood, the proposed primary pedestrian entry to the coach house is from the rear lane, and secondary pedestrian access to the coach house is proposed via a pathway from Ainsworth Crescent along the south side of the property.\n- The west elevation of the coach house that faces the lane has been designed as the primary facade, with a main window off the living area at grade, wood posts with stone bases on either side of the covered front porch, as well as exterior wall and landscape lighting to enhance visibility and appearance of the lane as a public space.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:58:18.709Z",
    "updateDate": "2024-02-07T16:58:18.709Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/2_9800_Van_Horne_Way_DPP_05102366516.pdf",
    "text": "City of Richmond\nTo: Development Permit Panel\nFrom: Wayne Craig, Director, Development\nReport to Development Permit Panel\nDate: April 20, 2023\nFile: DP 21-943565\nRe: Application by Orion Construction for a Development Permit at 9800 Van Horne Way\nStaff Recommendation: That a Development Permit be issued which would permit the construction of two multi-tenant light industrial buildings at 9800 Van Horne Way on a site zoned \"Light Industrial (IL)\".\nAir< Wayne Craig, Director, Development (604-247-4625) WC:bb Att. 4 7202148 April 20, 2023 - 2 - DP 21-943565\nStaff Report\nOrigin: Orion Construction, on behalf of the owner of the subject property, has applied to the City of Richmond for permission to develop two industrial buildings on the subject lot at 9800 Van Horne Way. The owner intends to sell the buildings as strata titled units after completion of the project. The development site is currently zoned \"Light Industrial (IL)\" and contains one industrial building as well as accessory storage uses.\nA Servicing Agreement is required prior to Development Permit issuance, and includes, but is not limited to, the following improvements: • decommissioning and replacement of the existing water main located along the Van Horne Way frontage; • decommissioning and replacement of the existing sanitary main along the Van Horne Way frontage; • decommissioning and replacement of the storm sewer main located along the Van Horne Way frontage; and, • frontage improvements to both River Drive and Van Horne Way including the undergrounding of utilities, street lighting as well as widening of the existing boulevard from 1.0m to 1.5m along Van Horne Way.\nDevelopment Information\nPlease refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\nBackground\nThe subject site and the surrounding area are located in a predominantly industrial neighbourhood within the City Centre Area Plan. Development surrounding the subject site is as follows: • To the North: Across River Drive, a \"Light-Industrial (IL)\" zoned property currently operated by South Coast BC Transportation Authority. • To the South: The CP railway right-of-way (which is identified in the CCAP as a future City road), and further south, an industrial building offering mixed-employment uses on a site zoned \"Light-Industrial (IL)\". • To the East: A \"Light-Industrial (IL)\" zoned property containing two warehouse buildings used for storing trailers. The property is subject to an active rezoning application currently at third reading (ZT 16-753545) to allow non-accessory vehicle parking. The property further east is owned and operated by BC Hydro and contains service utility infrastructure. • To the West: Across Van Horne Way, two \"Light-Industrial (IL)\" zoned properties used by South Coast BC Transportation Authority.\n7202148 April 20, 2023 - 3 - DP 21-943565\nRelated Policies and Studies\nAircraft Noise Sensitive Development Policy\nThe subject site is located within Aircraft Noise Areas lA and 2, which would restrict all new noise sensitive uses. The proposed industrial use is not restricted, and noise mitigation is not required. Prior to issuance of the Development Permit, the applicant is required to register an aircraft noise covenant on Title to address public awareness of the potential impact of aircraft noise on the site.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of Richmond Flood Plan Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to issuance of the Development Permit.\nSite Disclosure Statement\nThe applicant must provide confirmation of compliance and approval from the Ministry of Environment with regard to site investigation for any contaminants due to previous activities on the property prior to the issuance of the Development Permit.\nStaff Comments\nThe proposed scheme attached to this report has satisfactorily addressed the significant urban design issues and other staff comments identified as part of the review of the subject Development Permit application. In addition, it complies with the intent of the applicable sections of the Official Community Plan, City Centre Area Plan and is generally in compliance with the \"Light Industrial (IL)\" zoning regulations.\nAdvisory Design Panel Comments\nOn February 8, 2023, the Advisory Design Panel supported the subject Development Permit application moving forward to Development Permit Panel, subject to consideration of the panel's comments. The applicant has incorporated a number of design changes in response to the Panel's comments, including: • Commitment to install five (5) Electric Vehicle (EV) charging stations in the parking areas. The charging stations are distributed throughout the parking areas with two (2) stations west of Building A, one (1) to the south of Building A adjacent to an outdoor amenity area, and two (2) west of Building B along the central drive aisle between the two buildings. • Relocating the garbage enclosure to an area south of Building A and away from the edge of the future road south of the site. • Providing more surface texture and line painting in the parking area to demarcate pedestrian pathways and enhancing pedestrian safety. • Providing a centrally-located outdoor amenity area south of Building A. • Providing an additional outdoor landscaped and amenity area immediately east of Building B. 7202148\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:57:37.131Z",
    "updateDate": "2024-02-07T16:57:37.131Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_8951_8971_Spires_Road_and_8991_Spires_Gate_DPP_05102366515.pdf",
    "text": "City of Richmond Report to Development Permit Panel\nTo: Development Permit Panel\nFrom: Wayne Craig, Director of Development\nDate: April 21, 2023\nFile: DP 21-932383\nRe: Application by Flat Architecture Inc. for a Development Permit at 8951, 8971 Spires Road and 8991 Spires Gate\n\nStaff Recommendation:\n1. Permit the construction of 22 townhouse units and two secondary suites at 8951, 8971 Spires Road and 8991 Spires Gate and the surplus portion of Spires Road on a site zoned \"Parking Structure Townhouses (RTP4)\" zone.\n2. Vary the provisions of Richmond Zoning Bylaw 8500 to:\n   a) Reduce the minimum lot width from 40 m to 33.5 m.\n   b) Reduce the minimum lot area from 2,400 m2 to 2,000 m2.\n\nStaff Report:\nDP 21-932383\nFlat Architecture Inc., on behalf of 0924206 BC Ltd., has applied to the City of Richmond for permission to develop 22 residential units and two secondary suites at 8951, 8971 Spires Road and 8991 Spires Gate and the surplus portion of the Spires Road road allowance. The proposed development includes 20 multi-level townhouse units and two ground-level flats. The unit sizes range between 71.27 m2 and 139.91 m2, providing a mix of two to five-bedroom units. Two of the townhouse units will have a two-bedroom secondary suite. Parking will be provided within the parking structure at grade.\n\nThe site is being rezoned from \"Single Detached (RS 1/E)\" zone to \"Parking Structure Townhouses (RTP4)\" zone under Bylaw 10218 (RZ 18-818420). The site is currently vacant but previously contained three single-family dwellings.\n\nServicing Agreement:\nFrontage improvements and other works will be constructed through a separate Servicing Agreement (SA 21-930503).\n\nDevelopment Information:\nPlease refer to the attached Development Application Data Sheet for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nBackground:\nThe Spires Road Neighbourhood is transitioning from a single-family neighbourhood to a higher-density neighbourhood.\n\nTo the North: Single-family homes on lots zoned \"Single Detached (RSl/E)\".\nTo the South: A recently completed 64-unit high-density townhouse development.\nTo the East: Single-family homes on lots zoned \"Single Detached (RSl/E)\" designated for medium-density housing.\nTo the West: A 19-unit townhouse development.\n\nRezoning and Public Hearing Results:\nThe Public Hearing for the rezoning was held on January 18, 2021. No concerns were expressed.\n\nStaff Comments:\nThe proposed scheme addresses urban design issues and complies with the Official Community Plan and the \"Parking Structure Townhouses (RTP4)\" zone.\n\nZoning Compliance/Variances:\n1) Reduce the minimum lot width from 40 m to 33.5 m.\n2) Reduce the minimum lot area from 2,400 m2 to 2,000 m2.\n\nAdvisory Design Panel Comments:\nThe Advisory Design Panel supports the project.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:57:01.908Z",
    "updateDate": "2024-02-07T16:57:01.908Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/2_6520_Williams_Road68876.pdf",
    "text": "City of Richmond To: Development Permit Panel From: Wayne Craig Director of Development Report to Development Permit Panel Date: May 24, 2023 File: DP 21-936149 Re: Application by Gradual Architecture Inc. for a Development Permit at 6520 Williams Road Staff Recommendation That a Development Permit be issued which would: 1. Permit the construction of eight townhouse units at 6520 Williams Road on a site zoned \"Low Density Townhouses (RTL4)\"; and 2. Vary the provision of Richmond Zoning Bylaw 8500 to reduce the minimum required lot width from 40.0 m to 36.6 m. Wayne Craig Director of Development WC:mp Att. 2 7049603 May 24, 2023 - 2 - DP 21-936149 Staff Report Origin Gradual Architecture Inc. has applied to the City of Richmond on behalf of Londonpark Holdings Ltd. (Director Long Fei Liu) for permission to develop eight (8) townhouse dwellings at 6520 Williams Road on a site zoned \"Low Density Townhouses (RTL4)\". The site currently contains a single detached dwelling which does not contain a secondary suite. The existing dwelling would be demolished. A location map is provided in Attachment 1. The site is being rezoned from the \"Single Detached (RS 1/E)\" zone to the \"Low Density Townhouses (RTL4)\" zone for this project under Bylaw 10224 (RZ 17-792242). A Servicing Agreement is required as a condition of building permit issuance and includes, but is not limited to, the following improvements: • 0.1 m road dedication along the entire Williams Road frontage; and • Removal of the existing sidewalk and replacement with new 1.5 m concrete sidewalk at the property line, 1.5 m landscaped boulevard with street trees and street lighting, and 0.15 m curb and gutter. Development Information Please refer to attached Development Application Data Sheet (Attachment 2) for a comparison of the proposed development data with the relevant Bylaw requirements. Background Development surrounding the subject site is as follows: To the north: Across Williams Rd, a single detached dwelling on a property zoned \"Single Detached (RS 1/C)\" with vehicle access from Sheridan Road. To the south and west: Steveston London Secondary School and Park on properties zoned \"School and Institutional Use (SI)\". A single detached dwelling on a property zoned \"Single Detached (RS 1/E)\" with vehicle access from Williams Road. This property is part of a separate rezoning application including both the properties at 6560 and 6580 Williams Road (RZ 21-945388), which is currently under staff review. The proposed rezoning would permit development of townhouses with shared vehicle access from the subject site. Rezoning and Public Hearing Results During the rezoning process, staff identified the following design issues to be resolved at the Development Permit stage: • Compliance with Development Permit Guidelines for the form and character of multiple-family projects provided in the Official Community Plan (OCP). 7049603 May 24, 2023 - 3 - DP 21-936149 • Articulation of the west elevations adjacent to the park space to enhance the buildings' appearance and maximize sunlight and views. • Review of the size and species of on-site trees to ensure bylaw compliance and to achieve an acceptable mix of coniferous and deciduous species on-site. • Review of the proposed driveway design and requirement for a vehicle turn-around area, and possibility of retaining Tree #7 if the adjacent site to the east proceeds for redevelopment. • Refinement of the shared outdoor amenity area design, including the choice of play equipment, to create a safe and vibrant environment for children's play and social interaction. • Review the long-term design of the temporary turn-around area, such as future conversion to additional outdoor amenity space. • Review of relevant accessibility features for the one proposed convertible unit and aging-in-place design features in all units. • Review of a sustainability strategy for the development proposal. The Public Hearing for the rezoning of this site was held on February 16, 2021. No public correspondence was received at the Public Hearing. Staff worked with the applicant to address the above design issues in the following ways: • Detailed architectural and landscape plans have been provided to demonstrate that the proposed development is generally consistent with the Development Permit guidelines for multi-family projects and Arterial Road Guidelines for Townhouses in the OCP. • The applicant has refined the design while maintaining the general character presented to Council at the rezoning stage. • The west elevations of the buildings have been modified by providing additional glazing and architectural details to add visual interest and take advantage of the natural sunlight and views to better orient end units to the adjacent park. • Detailed landscape plans have been submitted to provide for a mix of coniferous and deciduous replacement trees, which meet the bylaw size requirements. • The proposed driveway design has been reviewed and approved by the Transportation Department. • The on-site vehicle tum-around area is required for the proposed development as the rezoning application for the proposed townhouse development on the adjacent sites at 6250 and 6280 Williams Road is still under staff review. Tree #7 would be removed to enable the construction of the required vehicle turn-around area. • The design of the outdoor amenity area for this proposal includes two children's play structures and a bench to promote social interaction. • A plan showing details of the conversion of the above-noted on-site tum-around area into expanded outdoor amenity, once the adjacent site access has been developed, is attached the DP. • The proposed accessibility features include aging-in-place features in all units and one convertible unit. • The applicant has provided a sustainability strategy and a letter from a Certified Energy Advisor indicating that the project will achieve Step 3 of the BC Energy Step Code consistent with current City regulations. The above issues are discussed further in the \"Analysis\" section of this report. 7049603\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:56:33.616Z",
    "updateDate": "2024-02-07T16:56:33.616Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_12551_No_1_Road68875.pdf",
    "text": "City of Richmond Report to Development Permit Panel\n\nTo: Development Permit Panel\nDate: May 24, 2023\nFrom: Wayne Craig\nFile: DP 21-935984\nDirector, Development\n\nRe: Application by Gordon Chan for a Development Permit at 12551 No. 1 Road\n\nStaff Recommendation:\n1. Permit the replacement of all the existing single-glazed windows with new double-glazed windows, the replacement of two doors on the front (north) elevation, and the removal of the overhead garage door on the rear (south) elevation at 12551 No. 1 Road.\n2. Vary the provision of Richmond Zoning Bylaw 8500 to reduce the minimum front yard setback to the garbage and recycling enclosure from 3.0 m to Om.\n\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:mp\nAtt. 3\n7106166\nMay 24, 2023\n\nStaff Report\nOrigin: DP 21-935984\n\nGordon Chan has applied to the City of Richmond on behalf of Public Services and Procurement Canada for permission to replace all the existing 18 single-glazed windows with double-glazed windows of the existing office building for Fisheries and Oceans Canada at 12551 No. 1 Road. The applicant also proposes to replace two doors on the front (north) elevation and remove the existing overhead garage door on the rear (south) elevation.\n\nThe subject property is split-zoned: most of the site is zoned \"Light Industrial (IL)\", and the small triangular portion along Bayview Street is zoned \"Steveston Commercial (CS2)\". A location map is included in Attachment 1. The subject property is located within the Steveston Village Heritage Conservation Area (SVHCA); it is not one of the identified heritage resources (i.e., protected heritage properties). Both a Heritage Alteration Permit and Development Permit applications were submitted for the proposed exterior changes. However, with recent changes to the Heritage Procedures Bylaw approved by Council on May 15, 2023, only a Development Permit is required for exterior changes to non-heritage properties in the SVHCA. Therefore, the associated Heritage Alteration Permit application is no longer required and the Development Permit application will be used to consider the proposed changes.\n\nDevelopment Information:\nPlease refer to attached Development Application Data Sheet (Attachment 2) for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nBackground:\nDevelopment surrounding the subject site is as follows:\nTo the north: Across Bayview Street is a vacant property at 12451 No. 1 Road on a site zoned \"Steveston Commercial (CS2)\". The property is currently landscaped with trees and lawn. The property contains an identified heritage resource, the curved roadway pattern as a trace in the landscape of the original Canadian Pacific Railway track that extended along the waterfront to the Gulf of Georgia Cannery.\nTo the east: Immediately to the east is the south end of No. 1 Road with a pier and boat dock and the No. 1 Road South Discharge station, which is an identified heritage resource.\nTo the south: South Arm Fraser River.\nTo the west: A one-storey, multi-tenant commercial building at 3900 Bayview Street on a site zoned \"Steveston Commercial (CS2)\".\n\n7106166\nMay 24, 2023\n\nDP 21-935984\n\nStaff Comments:\nThe proposed scheme attached to this report has satisfactorily addressed the urban design issues and other staff comments identified as part of the review of the subject Development Permit application. In addition, it is generally in compliance with the \"IL\" zone, with the exception of the zoning variance noted below.\n\nZoning Compliance/Variance:\nThe applicant requests to vary the provision of Richmond Zoning Bylaw 8500 to reduce the minimum front yard setback of 3.0 m from the IL zone boundary to Om to accommodate an enclosure to better screen the existing garbage and recycling containers adjacent to the public sidewalk. The enclosure must comply with the setbacks in the zone.\n\n- In accordance with section 3.2.4 of Richmond Zoning Bylaw 8500, where a lot is located in more than one zone, siting regulations shall apply as if the zone boundary were a lot line. There is no minimum front yard, side yard, or rear yard setback requirement in the \"Steveston Commercial (CS2)\" zone, but the \"Light Industrial (IL)\" zone requires a minimum of 3.0 m front yard setback.\n- The applicant has noted that the rear yard of the subject site is currently used for a compound by various federal agencies with a security gate to restrict access, so the garbage and recycling containers cannot be located in the rear yard. The proposed location at the northwest corner of the property has been selected to minimize interference with pedestrian traffic and other vehicular access and to ensure compliance with the B.C. Building Code and Richmond Fire Bylaw (e.g. spatial separation requirement).\n- Staff are supportive of this variance request as it allows the enclosure to be constructed to screen the garbage and recycling containers from public view and enhance the overall streetscape along Bayview Street.\n- The front property line is located to the north of the IL zone boundary and is parallel to Bayview Street, so the front yard setback measured from the front property line is greater (2.0 m to the northeast corner of the proposed enclosure).\n- The design of the enclosure has been reviewed as part of the DP application process and will be discussed in detail in the \"Analysis\" section of this report.\n- There are no changes to parking and access to the site as a result of this variance.\n\nRichmond Heritage Commission Comments:\nThe applications were reviewed by the Richmond Heritage Commission (RHC) on April 6, 2022, and the RHC adopted the following resolution:\n\n7106166\nThat the Richmond Heritage Commission support the DP and HAP applications (DP 21-985984 & HA21-985982) for 12551 No. 1 Road subject to a future review of the encroachment issue to ensure the streetscape and urban design is compatible with the Steveston Village Heritage Conservation Area.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:55:31.659Z",
    "updateDate": "2024-02-07T16:55:31.659Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/3_Polygon_Talisman_Park_Ltd_DPP_062823_Cambie_Road_and_Sexsmith_Road69016.pdf",
    "text": "City of Richmond Report to Development Permit Panel\n\nTo: Development Permit Panel\nDate: June 7, 2023\nFrom: Wayne Craig\nFile: DP 22-015851\nDirector, Development\n\nRe: Application by Polygon Talisman Park Ltd. for a Development Permit at Portions of 8731, 8771, 8831/8851 Cambie Road and 8791 Cambie Road/3600 Sexsmith Road\n\nStaff Recommendation:\n1. Permit the construction of 276 rental housing units in two six-storey multi-family apartment buildings on portions of the properties located at 8731, 8771, 8831/8851 Cambie Road and 8791 Cambie Road/3600 Sexsmith Road on a site zoned \"Residential/Limited Commercial (ZMU47)-Capstan Village (City Centre)\".\n2. Vary the provisions of Richmond Zoning Bylaw 8500 to increase maximum permitted building height for the affordable housing building located on the eastern portion of the site from 25.0 m to 27.6 m to accommodate elevator access to a rooftop garden.\n\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:sb\nAtt. 3\nJune 7, 2023\n\nStaff Report\nOrigin: DP 22-015851\n\nPolygon Talisman Park Ltd. has applied to the City of Richmond for permission to develop 276 rental housing units in two six-storey apartment buildings over a common parking structure on a development site comprising portions of the properties located at 8731, 8771, 8831/8851 Cambie Road and 8791 Cambie Road/3600 Sexsmith Road and zoned \"Residential/Limited Commercial (ZMU47)-Capstan Village (City Centre)\".\n\nHighlights of the proposed development include:\n- The subject application is the first phase of a four-phase development.\n- The subject development provides a range of unit types from studio to three-bedroom.\n- Unit areas are proposed to range from 40 m2 to 94 m2 (431 ft2 to 1,012 ft2).\n- All the units will be connected to a City-owned Low Carbon Energy System.\n- Approximately 568 m2 (6,114 ft2) of indoor amenity space is provided.\n- Approximately 1,793 m2 (19,300 ft2) of common outdoor amenity space is provided.\n- Approximately 651 m2 (7,006 ft2) of pathway area is provided along the north and west edges of the site.\n- A rooftop urban agriculture gardening area is provided at the roof level of the affordable housing building.\n\nA Servicing Agreement is required to accommodate the development and was secured through the associated rezoning application.\n\nDevelopment Information:\nPlease refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nJune 7, 2023\n\nBackground:\nThe subject site is located on the west side of Garden City Road between Cambie Road to the south and Capstan Way to the north. The site is in the Capstan Village area of the City Centre Planning Area. After completion of the subdivision associated with the rezoning application, the net site area for the subject development is 9,630.8 m2 (103,665 ft2) in area.\n\nDevelopment surrounding the subject site is as follows:\n- To the North: The second phase of the subject four-phase development, which will include high-density high-rise development and commercial uses fronting Capstan Way.\n- To the South: A new neighbourhood City Park being provided through the subject development at the developer's sole cost.\n- To the East: Across Garden City Road in the Oaks West Cambie neighbourhood, is a single-storey commercial development and two-storey townhouse development.\n- To the West: A church site, designated in the CCAP for institutional and low to medium density low to mid-rise residential development with limited commercial uses.\n\nRezoning and Public Hearing Results:\nDuring the rezoning process, staff identified design issues to be resolved at the Development Permit stage, including accommodating replacement tree planting and adding a rooftop demonstration urban agriculture garden on the affordable housing building.\n\nThe Public Hearing for the associated rezoning was held on January 17, 2022. Concerns regarding architectural form and character were expressed, and responses to the concerns were provided.\n\n- Provision of balconies for private outdoor space: Private outdoor space balconies or patios are provided for 100% of LEMR and market rental units.\n- Provision of appropriate parking and charging infrastructure: Electric Vehicle charging accommodation is provided for 100% of resident parking spaces and 100% of visitor parking spaces.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:54:40.034Z",
    "updateDate": "2024-02-07T16:54:40.034Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/2_Kadium_No_4_Development__DPP_062823_No_4_Road69015.pdf",
    "text": "City of Richmond Report to Development Permit Panel. Development Permit Panel, June 15, 2023. Wayne Craig, Director, Development. File: DP 21-936427. Application by Kadium No. 4 Development Ltd. for a Development Permit at 10340, 10360, 10380, 10400, and 10420 No. 4 Road. Staff Recommendation: 1. Permit the construction of 19 townhouse units at 10340, 10360, 10380, 10400, and 10420 No. 4 Road on a site zoned \"Medium Density Townhouses (RTM2)\". 2. Vary the provisions of Richmond Zoning Bylaw 8500 to: a) Reduce the minimum front yard setback from 6.0 m to 4.5 m. b) Reduce the minimum lot depth from 35.0 m to 34.0 m. Wayne Craig, Director, Development (604-247-4625). WC:cl. Att. 3. 7267244. June 15, 2023. Staff Report. Origin: DP 21-936427. Kadium No. 4 Development Ltd. has applied to the City of Richmond for permission to develop 19 townhouse units, including four secondary suites, at 10340, 10360, 10380, 10400, and 10420 No. 4 Road on a site zoned \"Medium Density Townhouses (RTM2)\". A location map is provided in Attachment 1. The site is being rezoned from the \"Single Detached (RS 1/E)\" zone to the \"Medium Density Townhouses (RTM2)\" zone for this project under Richmond Zoning Bylaw 8500, Amendment Bylaw 10261 (RZ 18-831725). The Bylaw was given third reading at the Public Hearing held June 21, 2021, and the applicant is working to complete all of the rezoning requirements. A Servicing Agreement is required as a condition of rezoning bylaw adoption and includes, but is not limited to, upgrading approximately 80 m of sanitary sewer on-site and along the shared property line with the properties at 10251, 10271, 10291, and 10311 Dennis Crescent, as well as road improvements involving road dedication and construction of a new treed/grass boulevard at the curb, off-street bike path, and concrete sidewalk along the subject site frontage, and construction of an interim asphalt walkway at the curb from 10300 No. 4 Road to the north end of the block at Wilkinson Road. Development Information: Please refer to attached Development Application Data Sheet for a comparison of the proposed development data with the relevant Bylaw requirements (Attachment 2). Background: The subject site is located on the east side of No. 4 Road between Steveston Highway and Wilkinson Road. The site is currently vacant, with five driveway crossings on No. 4 Road. Existing development immediately surrounding the subject site includes single-family dwellings on lots zoned \"Single Detached (RS 1/E)\" fronting No. 4 Road to the north, south, and west, and single-family dwellings on lots zoned \"Single Detached (RS 1/E)\" fronting Dennis Crescent to the east. Rezoning and Public Hearing Results: The Public Hearing for the rezoning of this site was held on June 21, 2021. Although no members of the public were in attendance at the Public Hearing, one letter from a nearby resident was received citing concerns about the proposed change in land use from single-family housing to townhousing and potential traffic and safety concerns. Staff note that the proposed use is consistent with the OCP and Arterial Road Land Use Policy, and the proposed development would have only one access to No 4 Road, thereby reducing the number of vehicle access points along this stretch of roadway. Bylaw 10261 for the rezoning of the subject site was given third reading following the Public Hearing. During the rezoning process, staff identified design issues to be resolved at the Development Permit (DP) stage, including compliance with the DP Guidelines for the form and character of multiple-family projects in the Official Community Plan (OCP), confirmation of interior noise levels and noise mitigation measures, refinement of the landscape design and interface with adjacent single-family housing, refinement of the shared outdoor amenity space design, review of the units that include secondary suites, review of accessibility features, review of a sustainability strategy, ensuring satisfactory plantings within the Statutory Right-of-Way (SRW) for the sanitary sewer, ensuring proposed tree relocations are viable, and accommodation of hedge Hl-H7 if possible. Through the review of this DP application, staff worked with the applicant to address the design issues and ensure consistency with the applicable design guidelines contained within the OCP. The applicant has made revisions to the proposal to address the design issues identified, including revisions to the Landscape Plan, demonstration of functional design for units containing secondary suites, incorporation of relevant accessibility features, refinement of lot grading, and ensuring appropriate transition to neighboring lots. 7267244.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:53:57.354Z",
    "updateDate": "2024-02-07T16:53:57.354Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_Zhao_XD_Architect_DPP_Francis_Road69014.pdf",
    "text": "City of Richmond\nTo: Development Permit Panel\nFrom: Wayne Craig, Director, Development\nReport to Development Permit Panel\nDate: June 5, 2023\nFile: DP 21-934415\nRe: Application by Zhao XD Architect Ltd. for a Development Permit at 9200, 9220, 9240, 9260, 9280, 9300, 9320, 9340 Francis Road\nStaff Recommendation: Issue a Development Permit for the construction of 25 townhouse units at 9200, 9220, 9240, 9260, 9280, 9300, 9320, 9340 Francis Road on a site zoned \"Town Housing (ZT94)- Francis Road (Broadmoor).\"\nWayne Craig, Director, Development (604-247-4625)\nStaff Report\nOrigin: DP 21-934415\nZhao XD Architect Ltd. has applied to the City of Richmond on behalf of 1125640 BC Ltd. (Directors: Yan Zhao, Fuhua Yuan and Man Yuan) for permission to develop 25 townhouse units at 9200, 9220, 9240, 9260, 9280, 9300, 9320, 9340 Francis Road. The site is being rezoned from \"Single Detached (RS 1/E)\" to \"Town Housing (ZT94) Francis Road (Broadmoor)\" for this project under Bylaw 10254 (RZ 20-907463), which received third reading following the Public Hearing on July 19, 2021. The site currently contains eight single-family homes, which will be demolished.\nHighlights of the proposed development include:\n- 25 townhouse units, including 13 three-storey units in three townhouse clusters along Francis Road and 12 two-storey duplex style units in six townhouse clusters along the rear property line.\n- Three of the two-storey units are designed in accordance with the convertible unit guidelines.\n- Nine existing bylaw-sized trees will be retained on-site, including three trees in the proposed outdoor amenity area and six trees within the rear yards.\nA Servicing Agreement is required as a condition of Building Permit issuance and includes, but is not limited to, the following improvements:\n- Removal of the existing sidewalk and replacement with 2.0 m concrete sidewalk at the property line, 1.5 m landscaped boulevard, and 0.15 m concrete curb and gutter.\n- Replace approximately 150 m long existing watermain along the Francis Road frontage.\n- Replace approximately 150 m long AC sanitary main along the entire south property line, complete with new manholes per City spacing requirements.\nDevelopment Information\nPlease refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\nBackground\nDevelopment surrounding the subject site is as follows:\nTo the north: Across Francis Road, single detached dwellings on properties zoned \"Single Detached (RS 1/C)\" and townhouse dwellings on a property zoned \"Low Density Townhouses (RTLl).\"\nTo the south: Single detached and duplex dwellings on properties fronting Glenbrook Drive zoned \"Single Detached (RSl/E).\"\nTo the east and west: Single detached dwellings on properties zoned \"Single Detached (RS 1/E),\" which are designated \"Arterial Road Townhouse\" in the Arterial Road Land Use Policy.\nRezoning and Public Hearing Results\nThe Public Hearing for the rezoning of this site was held on July 19, 2021. At the Public Hearing, concerns were expressed about increased traffic, construction impacts, and neighboring fences. The applicant's responses to these concerns were provided. Additionally, a cyclist inquired about cycling infrastructure improvements along Francis Road as part of the development permit application. The suggestions and staff's responses were provided.\n1. Increased traffic: A Traffic and Parking Assessment Report concludes that the proposed 25-unit townhouse development will have very minor impact on the traffic operations of the future road network, and no traffic or parking issues are expected.\n2. Construction impacts: Construction will follow City and other governmental regulations and guidelines, and negative impacts will be prevented or minimized. A Construction Traffic and Parking Management Plan will be required prior to building permit issuance to mitigate impacts of heavy truck traffic during construction.\n3. Neighboring fences: All existing fences on neighboring properties will be maintained, and a new fence will be installed on-site abutting the existing fences.\nThe implementation of cycling facilities in the City is guided by the Cycling Network Plan, which was developed based on extensive stakeholder and public engagements. The section of Francis Road falls outside of the 15-year priority list in the plan. All townhouse developments are required to provide on-site off-street car parking facilities for residents and visitors.\n\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:53:10.424Z",
    "updateDate": "2024-02-07T16:53:10.424Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/2_Rick_Bowal_DPP_072623_8220_Gilbert_Rd69190.pdf",
    "text": "City of Richmond Report to Development Permit Panel\nTo: Development Permit Panel\nDate: July 4, 2023\nFrom: Wayne Craig\nFile: DP 23-011608\nDirector, Development\nRe: Application by Rick Bowal for a Development Permit at 8220 Gilbert Road\nStaff Recommendation: That a Development Permit be issued for the construction of two front-to-back duplexes at 8220 Gilbert Road (one on each new lot after subdivision), on lots zoned \"Arterial Road Two-Unit Dwellings (RDA)\".\nWayne Craig\nDirector, Development\n(604-247-4625)\nWC:ac\nAtt. 2\n7266405\nJuly 4, 2023\n- 2 -\nDP 23-011608\nStaff Report\nOrigin: Rick Bowal has applied to the City of Richmond for permission to develop two front-to-back duplexes at 8220 Gilbert Road on a site zoned \"Arterial Two-Unit Dwellings (RDA)\" with access from Gilbert Road.\nThe site is being rezoned from \"Single Detached (RS 1/E)\" zone to \"Arterial Road Two-Unit Dwellings (RDA)\" zone for this project under Bylaw 10428 (RZ 21-926304). The application included an amendment to the Single Family Lot Size Policy 5442 to exclude the subject site from the policy. The Lot Size Policy amendment was approved following the Public Hearing.\nThe rezoning Bylaw was given third reading at the Public Hearing held on December 19, 2022 and the applicant is working to complete all of the rezoning requirements. The site currently contains a single-family dwelling that is occupied by a rental tenant who has been made aware of the application and timeline.\nA Servicing Agreement is required as a condition of subdivision approval and includes, but is not limited to, the following improvements:\n• Provision of water, storm and sanitary sewer connections, water meters and inspection chambers as required for each lot.\n• Frontage upgrades including installation of a new 2.0 m wide concrete sidewalk with a 1.5 m wide treed/grass boulevard.\nThe transportation department has also indicated that upgrade to or relocation to Translink bus stop infrastructure will be investigated at the Servicing agreement stage.\nDevelopment Information: Please refer to attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\nBackground: The subject site consists of a large lot containing a single-family dwelling that is occupied by a rental tenant. There are no secondary suites in the dwelling. The existing dwelling is proposed to be demolished at future development stage.\nDevelopment surrounding the subject site is as follows:\nTo the North: Lots zoned \"Single Detached (RS 1/E)\" each containing a single-detached dwelling.\nTo the South: Lots zoned \"Single Detached (RS 1/E)\" each containing a single-detached dwelling.\nTo the East: Fronting Sunnywood Drive, lots zoned \"Single Detached (RS 1/E)\" each containing a single-family dwelling.\nTo the West: Across Gilbert Road, lots zoned \"Single Detached (RS 1/E)\" each containing a single-family dwelling.\nRezoning and Public Hearing Results: During the rezoning process, staff identified the following design issues to be resolved at the Development Permit stage:\n• Ensuring appropriate massing and interface with adjacent single-family dwellings on adjacent sites.\n• Refining the provision of private outdoor space for the front units to include a secondary space that is not in the front yard.\n• Refining the concept shown on the site plan for the boulevard upgrades to reflect that the transition to the existing treatments to the north and south of the site is to occur within the subject site frontage.\n• Exploring opportunities for aging-in-place and Convertible Unit Features to be incorporated into dwelling design.\n• Investigating with external agencies whether the existing bus stop along Gilbert Road needs to be relocated due to its proximity to the proposed driveway crossing.\n• Reviewing the proposed exterior building material and colour palette.\n• Reviewing the applicant's design response to the principles of Crime Prevention Through Environmental Design (CPTED).\n• Gaining a better understanding of the proposed sustainability features to be incorporated into the project.\nThrough the review of this DP application, staff worked with the applicant to address the design issues to staff's satisfaction. The applicant has made the following revisions to their proposal to address the design issues identified:\n• Further refinement to the overall site plan was completed to ensure the adequate provision of private outdoor space was met.\n• Accessibility features have been verified to include aging-in-place features in all units and the provision of one convertible unit.\n• Refinements were made to layout of boulevard upgrades to ensure sidewalk transition occurred on the subject site frontage. Initial investigation regarding an upgrade to Translink Bus Stop was completed and works relating will be determined at the Servicing Agreement stage.\n• Updates have been made to the building's exterior material and colour palate to ensure that the rear units are more visible from the street.\nThe Public Hearing for the rezoning of this site was held on December 19, 2022. At the Public Hearing, no concerns about rezoning the property were expressed by members of the public. Bylaw 10428 for the rezoning of the subject site was given third reading following the Public Hearing.\n7266405\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:52:26.078Z",
    "updateDate": "2024-02-07T16:52:26.078Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_Jatinder_Johal_DPP_072623_7600_Ash_St69189.pdf",
    "text": "To: City of Richmond Development Permit Panel\nFrom: Wayne Craig, Director, Development\nDate: June 26, 2023\nFile: DV 23-013843\nRe: Application by Jatinder Johal for a Development Variance Permit at 7600 Ash Street\n\nStaff Recommendation: Issue a Development Variance Permit to reduce the minimum south side yard setback for accessory buildings with a wall length greater than 6.0 m from 2.4 m to 1.5 m to retain the existing detached garage at 7600 Ash Street.\n\nStaff Report:\nJatinder Johal has applied on behalf of the property owners, Upjesh Johal and Baljinder Johal, to reduce the minimum south side yard setback for accessory buildings with a wall length greater than 6.0 m to retain the existing detached garage at 7600 Ash Street.\n\nDevelopment Information:\nThe subject site is undergoing a rezoning application (RZ 19-853820) to create five single-family lots. The proposed variance is necessary to retain the existing detached garage at 7600 Ash Street.\n\nExisting Legal Encumbrances: None.\n\nAnalysis:\nThe requested variance would only permit the retention of the existing garage, which is in good condition.\nThe proposed variance was identified during the rezoning application process and no concerns were raised.\nThe adjacent property owners have no objections to the proposed variance.\nThe applicant has committed to planting four new trees on the proposed Lot 1.\n\nConclusions:\nThe requested variance would allow for the retention of the existing detached garage at 7600 Ash Street.\nStaff recommends endorsing the Development Variance Permit and recommending issuance by Council.\n\nLaurel Eyton\nPlanning Technician\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:52:04.665Z",
    "updateDate": "2024-02-07T16:52:04.665Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/2_DP_22-013200_6011_River_Rd__Revised_70717.pdf",
    "text": "City of Richmond SI ZLR2 ZLR9 ZLRI 0 SJ 0 < m ::0 SI 0 ::0 ·--=d-~~~~5~9-51-2 ,---~ I I I I I I I I I I I I I I I I I I I :~~~9J DOVER CR 0:: u 0:: w > 0 0 R\\VERRO ~· 5.\\ 5900 '\"\"\" O'l 0 s:i-\" <!) r--- 1'-- ' ,_- --~.,=,,----~U) ~ r·~\\ r~~'..-\"L -.i:,. I \\- CO I 1,o \\ '-L..,.l.()~-...f ZT5 SI NO. 2 RD BRIDGE IBI RIVER RD ZMU4 ~ DP 22-013200 SCHEDULE \"A\" ZMU4 !Bl Original Date: 05/31 /22 Revision Date 06/01/22: Note: Dimensions are in METRES DP 22-013200 6011 RIVER ROAD, RICHMOND, BC r \"' \"\"-I 0 11'1 ~ 1-- 0 z ~ UJ :=) !1\"'\\ ~ I- c.. ~ 0 V) ....J V, ~ UJ > u. UJ C. 0 ~ I ~ October 23, 2023 DP 22-013200 DP Plan# 1 Notes: - Variance to permit up to 35 bicycle lockers (e.g. 70 class 1 bicycle parking spaces) in each bicycle storage room - 2 car share parking spaces with SRW requiring 24/7 public access, bicycle maintenance facilities, min. 24% EV visitor parking spaces, charging outlets for min. 10% of class 1 bicycle storage and other TDMs as per legal agreements - 40 BUH units required to comply with section 4.16 of Richmond Zoning Bylaw 8500 - Aging in place features to be provided in all units, including stairwell handrails, lever-type handles for doors and plumbing fixtures, and solid wall blocking in washrooms at all toilets, bathtubs and showers to facilitate future grab bar installation. - All paths from\n2m x 1.82m per Level aass2 (0.6m x 1.8ml) #lockers #Bikes #lockers #Bikes #Bikes L1 41 82 144 2 88 370 76 P1 9 18 10 5 210 228 0 Pl 16 32 105 21 0 2 42 0 Sub-Total 132 708 Total 840 76 Note: The project is proposing to provide 2 bicycle repair areas (1 for Towers A+ Band 1 for Tower C) and maintenance room adjacent to the main entry court. NOTES PROPOSED VARIANCES Balcony Encroachment into SRW: Balconies on the West facade of Tower 'C' are proposed to project into the SRW by up to 0.75m into the 10.0m SRW that runs along the side of the property. The dear height below the projecting balconies is proposed to be no less than 5.8m. No Ung that the 10.0m wide portion of the SRW is intended to facilitate maintenance of the bridge, the applicant would note a few factors for consideration of the proposed condition: - the minor encroachment is far enough above the drivable surface of the SRW to permit the clear passage of most standard maintenance vehicles, - the encroachment maintains a minimum 9.25m travel width that is complete dear both horizontally and vertically, and... -Seeking variance from (40) bicycles to (40) bicycle lockers per room to facilitate the large number of bicycle lockers. BASIC UNIVERSAL HOUSING PROVISIONS (REFER TO DP0.24) The project proposes to provide 40 dwelling units (+11% of the total unit count) that are designed to incorporate all of the Basic Universal Housing (BUH) Features as described in Section 4.16 of the Richmond Zoning Bylaw 8500: the project proposes to load the 1.86m2 exemption for each of these dwelling units as described in Subsection 4.6.2. Additional Notes: - Variance to permit up to 40 bicycle lockers (e.g. 80 class 1 bicycle parking spaces) in each bicycle storage room - 2 car share parking spaces will be provided, SRW requiring 24 public access bicycle maintenance facilities, minimum 24 EV visitor parking spaces, charging outlets, minimum 10% of class 1 bicycle storage and other TOMs as per legal agreements - 40 SUH units required to comply with section 4.10 of Richmond Zoning Bylaw 8500 - Aging in place features to be provided in all units, including stairwell handrails, lever-type handles for doors and plumbing fixtures, and solid wall blocking in washrooms to facilitate future grab bar installations - All paths from sidewalks into entry lobbies and entry court drop off in to entry lobbies to be visually low conflict from sidewalk and continuous - Maximum 7-storey building height permitted - Urban Agriculture area on podium requires hose bib, tool storage and work table - Irrigation automatic system for all planted areas, including extensive green roofs - PROPSRW registered on title. West side balcony encroachments Min 5.8m above grade and Max 0.5m into SRW - Tree protection required for City trees west site - Servicing Agreement required for off-site works and works in PROPSRW Communal Standard Stall (0.6m x 1.8ml Horz. Stacked 2000 207 □ IALOC ® ~ PFS STUDIO ' LANN I NG • Ull. 9 AN DESIG N • LA NDSCA PE AR CH IT ECTURE D E V ELOPMEN T S I SSU ED F OR 2 02 2- 05-09 DEVE LOP MEN T PER M IT AP PLI CA TI ON 2023-02..(19 DP R ESP O NSE #1 3 02 3-08-09 DP RE SPONS E #2 2023-0 9,.1 9 DPR ESPONSE#J 202 3-10-13 DP RE SPONS E #-:! October 23, 2023 DP 22-013200 DP Plan# 2 METRIC THIS ORAWING IS COPYRIGHTED AND MUST NOT BE USED. REPROOUCEO. OR REVI SEO WITHOUT WR ITTEN PERMI SSION. ALL OIMENSIONS ARE IN MIL LI METERS UN LESS OTHERWISE NOTEO, VE RI FY DIME 'IIS IONS , DO N OT SCALE THIS ORAWING. REPORT INCONSI ST ENCIES ANO OM ISSIONS TO THE CONSULTANT FOR CL.A RIFl CATI ON BEFORE COMMENCING WITH THE WO RK. DE\\I IA TIONS FROM THE CONTRACT OOCUMENTS W m-tOUT WR ITTEN APP ROVAL FROM THE CO'IISULTANT ARE SUBJECT TO CORRECTI ON AT THE C ON TRACTOR'S EXPEN S; , A RCHITECT & PRI ME CON SULT AN T DI ALOG 406 • 6 11 AL EXAN DER STREET , VANCOUVER. BC V6A 1E 1 T el: 604 . 255.1169 Fa x: L AN DSCAPE AR CH ITECT C HIL 1706W 1s t Av e, V ancouve r BC V6JOE4 T el: 6 04 . 688.857 1 Fax : ST RU CTU RAL ENG INEER DIAL OG 406 - 61 1 A LE XA N DER STREET . V ANCOUVER. BC VGA 1E 1 Te l: 60 4. 25 : .1169 Fax : MECHANICAL EN GI NEER STA NTE C 1100 -111 DUNS M\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T16:30:40.026Z",
    "updateDate": "2024-02-07T16:30:40.026Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_1_-_Application_-_10140__10160__10180_No69253.pdf",
    "text": "City of Richmond Development Permit Panel Report\n\nDate: July 17, 2023\nFile: DP 21-940028\n\nApplication by The Panatch Group for a Development Permit at 10140, 10160, 10180 No.1 Road and 4051 Cavendish Drive.\n\nStaff Recommendation: Issue a Development Permit for the construction of 35 townhouse units at the specified locations.\n\nBackground: The proposed townhouse project is part of a larger development under rezoning application RZ 18-820669 and Bylaw 10156. The site is currently vacant.\n\nServicing Agreement: Frontage improvements and other upgrades will be constructed through a separate Servicing Agreement (SA 21-940032).\n\nHighlights of the proposed development:\n- 6 Low-End Market Rental (LEMR) units and 29 market residential units\n- 4 market units with a ground-level secondary suite\n- Retention of two trees on-site\n- Public walkway provided along the south property line\n\nDevelopment Information: Refer to the attached Development Application Data Sheet for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nSurrounding Development:\n- North: Single-family dwelling and Richmond Chinese Alliance Church\n- South: 16-unit townhouse complex and single-family dwelling\n- East: Single-family dwelling\n- West: Single-family dwellings and 11-unit townhouse complex\n\nRezoning and Public Hearing Results: The rezoning application received no concerns at the Public Hearing held on May 19, 2020.\n\nStaff Comments: The proposed scheme satisfactorily addresses urban design issues and complies with the Official Community Plan and the \"Town Housing (ZT88) - No. 1 Road (Steveston)\" zone.\n\nAdvisory Design Panel Comments: The Advisory Design Panel supports the project.\n\nPlease see attached documents for more details.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T09:00:40.614Z",
    "updateDate": "2024-02-07T09:00:40.614Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/2_dpp_dyke_road69358.pdf",
    "text": "Staff Recommendation: Issue a Development Permit for the construction of a light industrial building at 20455 Dyke Road, 7500 No. 9 Road, and a portion of PID 031-553-231 on a site zoned \"Industrial Business Park and Marina (Z120) - Graybar Road (East Richmond)\".\n\nDevelopment Permit Panel Report: Farrell Estates Ltd. has applied for a Development Permit for the mentioned site.\n\nDate: July 31, 2023\nFile: DP 22-027199\n\nBackground: The site is part of a phased industrial development and currently contains a marina/boat yard. The proposed development includes the consolidation of the site into two lots and the construction of a multi-phase light industrial development.\n\nDevelopment Information: Refer to the attached Development Application Data Sheet for details.\n\nRezoning and Public Hearing Results: The Public Hearing for the rezoning of the site was held on July 18, 2022. Concerns were primarily related to tree removal and retention. The applicant has increased the number of replacement trees to 99 as part of the Agricultural Land Reserve (ALR) Development Permit application.\n\nStaff Comments: The proposed scheme addresses the issues and complies with the Official Community Plan and zoning requirements.\n\nFood Security and Agricultural Advisory Committee Comments: The committee reviewed and supported the ALR Development Permit application.\n\nAnalysis: The site has direct adjacency to the ALR boundary, requiring an ALR Development Permit application. The focus of the review is the landscape buffer between the site and the adjacent ALR property.\n\nProposal: Phase 2 of the development includes the construction of a two-storey multi-tenant industrial building with parking, loading, and outdoor amenities. The design and sustainability features are consistent with the overall development plan.\n",
    "maxPages": 3,
    "pages": [],
    "type": "image",
    "createDate": "2024-02-07T09:00:13.177Z",
    "updateDate": "2024-02-07T09:00:13.177Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/4_dpp_092723_DP_23-018670_10408_Dennis_Crescent69481.pdf",
    "text": "To: City of Richmond Development Permit Panel\nFrom: Wayne Craig, Director of Development\nDate: September 5, 2023\nFile: DP 23-018670\n\nRe: Application by Sandeep Mann for a Development Permit at 10408 Dennis Crescent\n\nStaff Recommendation: Issue a Development Permit for the construction of a coach house at 10408 Dennis Crescent on a site zoned \"Single Detached with Granny Flat or Coach House - Edgemere (REl)\".\n\nStaff Report:\nSandeep Mann, authorized agent for the property owners (Sandeep Mann, Kanwaljit Mann, and Sarbjit Mann), has applied for permission to develop a 60 m2 (645 ft2) coach house at 10408 Dennis Crescent on a site zoned \"Single Detached with Granny Flat or Coach House - Edgemere (REl)\". The existing single detached house on the site will be demolished, and a new single detached dwelling and coach house will be constructed.\n\nDevelopment Information:\nPlease refer to the attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nBackground:\nDevelopment surrounding the subject site includes single detached houses on Dennis Crescent, zoned \"Single Detached with Granny Flat or Coach House - Edgemere (REl)\".\n\nStaff Comments:\nAcross the lane, there are single detached houses on Dennis Crescent and Swinton Crescent, zoned \"Single Detached with Granny Flat or Coach House - Edgemere (REl)\". To the south and west, there are single detached houses zoned \"Single Detached with Granny Flat or Coach House - Edgemere (REl)\". The proposed scheme addresses urban design issues and staff comments, complies with the design guidelines for coach houses in the Edgemere neighborhood, and complies with the \"Single Detached with Granny Flat or Coach House - Edgemere (REl)\" zone.\n\nAnalysis:\nConditions of Adjacency:\n- The coach house is located on the east portion of the property, separated from the existing single detached dwelling.\n- The coach house is set back 2.0 m from the south side lot line to minimize shadowing of adjacent properties.\n- There are no windows on the north or south side elevations to address concerns of overlook into neighboring properties. Windows are proposed on the west and east elevations for light penetration and surveillance of the lane.\n\nUrban Design and Site Planning:\n- The primary pedestrian entry to the coach house is from the rear lane, with secondary pedestrian access from Dennis Crescent along the north side of the property.\n- The east elevation of the coach house facing the lane is designed as the primary facade, with a bay window, front entry, and exterior lighting to enhance visibility and appearance of the lane.\n- Private outdoor space for the coach house is proposed off the west side, accessible from the rear or front door.\n- A shared garbage and recycling enclosure is proposed, adequately sized and screened by wood fencing, gates, and landscaping.\n- The site plan provides on-site parking, including two spaces for the principal dwelling in the garage off the lane and one permeable parking space for the coach house with lane access.\n\nArchitectural Form and Character:\n- The proposed exterior building materials and colors of the coach house are consistent with the neighborhood, including taupe Hardie-plank siding, taupe stucco with grey trim, cedar, and black stone accents.\n- The primary facade of the coach house facing the lane is visually broken into smaller components with a projecting bay window on the lower floor and various windows on the upper floor.\n\nLandscape Design and Open Space Design:\n- There are no on-site trees in the area of the proposed coach house and garage. Tree retention and removal will be assessed and reviewed when applying for a building permit for the single-family dwelling.\n\nPlease let me know if you need any further information.\n\nWayne Craig\nDirector, Development\n604-247-4625\nWC:le\n7342153\nSeptember 5, 2023\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:59:09.295Z",
    "updateDate": "2024-02-07T08:59:09.295Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/3_dpp_092723_DP_22-023105_6333_Cooney_Rd69480.pdf",
    "text": "City of Richmond Report to Development Permit Panel: A Development Permit is recommended for the construction of a high-rise building with approximately 81 dwelling units at 6333 Cooney Road, which is zoned as \"High Rise Apartment (ZHR8) Brighouse Village (City Centre)\". \n\nStaff Report: 6333 Cooney Road Limited Partnership has applied for permission to develop a high-rise building with approximately 81 dwelling units at 6333 Cooney Road. The site is currently vacant and is zoned as \"High Rise Apartment (ZHR8) Brighouse Village (City Centre)\". \n\nZoning: The site is zoned as \"High Rise Apartment (ZHR8) Brighouse Village (City Centre)\". Zoning Bylaw 8500, Amendment Bylaw 8738 (RZ 09-506908), and associated Development Permit (DP 09-506909) were approved in 2012, but the development did not proceed. A new Development Permit (DP 17-791045) was issued in 2022, and due to design changes, a new Development Permit (DP 22-023105) is required. \n\nServicing Agreement: An associated Servicing Agreement (SA 19-858294) is under staff review and will be required for the issuance of this Development Permit. Updated design drawings and a new Letter of Credit security are also required. The Servicing Agreement includes the design and construction of a new City lane, Cooney Road frontage improvements, and sanitary sewer improvements. \n\nDevelopment Information: Please refer to the attached Development Application Data Sheet for a comparison of the proposed development data with the relevant Bylaw requirements. \n\nBackground: Surrounding the subject site are a 14-storey residential tower to the north, a three-storey townhouse development across Cooney Road to the east, a one-storey single detached house across a proposed lane to the south, and two four-storey wood frame apartment buildings to the west. \n\nStaff Comments: The proposed development complies with urban design issues, staff comments, and the Official Community Plan. It is generally in compliance with the \"High Rise Apartment (ZHR8) Brighouse Village (City Centre)\" zone. \n\nAdvisory Design Panel Comments: The Advisory Design Panel supports the application, subject to their comments. \n\nAnalysis: The development is located at the southeast corner of the site to maximize distance from neighboring residential development. Landscape buffers and design features are included to provide separation and visual interest. The development will be accessed from a new City lane, and the site is located within an Aircraft Noise Policy area. \n\nUrban Design and Site Planning: The proposed development takes advantage of the site's proximity to the Canada Line and the new City lane. Access to the site will be from the new lane, and service uses will be screened from public view.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:58:43.550Z",
    "updateDate": "2024-02-07T08:58:43.550Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/2_dpp_092723_DP_22-011557_6531_Francis_Rd69479.pdf",
    "text": "City of Richmond Development Permit Panel\nFrom: Wayne Craig, Director of Development\nDate: September 6, 2023\nFile: DP 22-011557\nRe: Application by Jacky He for a Development Permit at 6531 Francis Road\n\nStaff Recommendation: Issue a Development Permit for the construction of two front-to-back duplexes at 6531 Francis Road, with shared vehicle access from Francis Road. The lots are zoned \"Arterial Road Two-Unit Dwellings (RDA).\"\n\nStaff Report:\n- Jacky He has applied on behalf of the property owner, Ya T Wang, to develop two front-to-back duplexes at 6531 Francis Road.\n- The site is being rezoned from \"Single Detached (RSl/E)\" to \"Arterial Road Two-Unit Dwellings (RDA)\" under Bylaw 10332 (RZ 19-878165).\n- The site currently contains a single-family dwelling that will be demolished at a future subdivision stage.\n- A Servicing Agreement is required for subdivision approval, including water, storm, and sanitary sewer connections, as well as frontage works.\n- Development surrounding the site consists of single-family homes and a duplex.\n\nRezoning and Public Hearing Results:\n- Design issues were identified during the rezoning process and have been resolved at the Development Permit stage.\n- The proposed duplexes have been refined to comply with design guidelines and fit into the neighborhood.\n- Decks have been altered and reduced in size, and compliance with lot width and depth envelopes has been confirmed.\n- Aging-in-place features and a convertible unit have been included in all units.\n- Landscape plans have been provided, including on-site tree planting.\n- No concerns were expressed by the public during the Public Hearing for the rezoning.\n\nPublic Input during the Development Permit Application Process:\n- No comments have been received from the public regarding the placement of the DP Application Notification Sign.\n\nStaff Comments:\n- The proposed scheme satisfactorily addresses urban design issues and staff comments.\n- It complies with the Official Community Plan and the \"RDA\" zone.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:58:12.291Z",
    "updateDate": "2024-02-07T08:58:12.291Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_dpp_900_and_1000_Ferguson_Road69478.pdf",
    "text": "City of Richmond Development Permit Panel\nFrom: Wayne Craig, Director of Development\nDate: September 6, 2023\nFile: DP 21-945828\nRe: Application by Greater Vancouver Sewerage and Drainage District for a Development Permit at 900 and 1000 Ferguson Road\n\nStaff Recommendation: Issue a Development Permit at 900 and 1000 Ferguson Road for upgrades to the wastewater treatment plant in the designated Environmentally Sensitive Area.\n\nBackground: The Greater Vancouver Sewerage and Drainage District has applied for a Development Permit to incorporate secondary and tertiary treatment facilities into the existing wastewater treatment plant at 900 and 1000 Ferguson Road. The site is currently designated as an Environmentally Sensitive Area, requiring an ESA Development Permit.\n\nThe proposed project footprint is 23.9 ha, with 20.96 ha situated within the designated ESA. In compensation for disturbing 21 ha of ESA, GVS&DD has committed to planting and rehabilitating 26.2 ha of the island.\n\nPrevious ESA Development Permits have been issued for this site, allowing for the expansion of the wastewater treatment plant and construction of related facilities. The proposed project includes the development of previously secured ESA compensation areas.\n\nDevelopment Information: The subject site is currently occupied by buildings and structures associated with the existing wastewater treatment plant.\n\nDevelopment surrounding the site includes the North Arm of the Fraser River to the north, Iona Beach Regional Park to the east, Iona Island causeway to the south, and Iona Beach and North Arm Jetty to the west.\n\nStaff Comments: The proposed scheme addresses ESA issues and complies with the Official Community Plan and zoning requirements. No variances are being sought.\n\nAdvisory Design Panel Comments: The Advisory Design Panel has not reviewed the application as it does not involve building design components.\n\nAnalysis: The IIWWTP currently provides primary sewage treatment through sludge removal and anaerobic digestion. The proposed upgrades will enhance the treatment process.\n\nSite Planning: The proposed project will incorporate secondary and tertiary treatment facilities into the existing wastewater treatment plant.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:57:47.310Z",
    "updateDate": "2024-02-07T08:57:47.310Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_DPP_101223_DV_23-024175_7151__7211__7231___7251_Bridge_Street69514.pdf",
    "text": "City of Richmond Report to Development Permit Panel\nTo: Development Permit Panel\nDate: September 18, 2023\nFrom: Wayne Craig\nFile: DV 23-024175\nRe: Director, Development Application by Khalid Hassan for a Development Variance Permit at 7151, 7211, 7231 & 7251 Bridge Street\n\nStaff Recommendation:\n- Issue a Development Variance Permit to vary the provisions of Richmond Zoning Bylaw 8500 for the following:\n   1. Reduce the minimum required rear yard setback for a portion of the second storey from 10.70 m to 10.64 m at 7151 Bridge Street to retain an existing second-storey deck.\n   2. Reduce the minimum required rear yard setback for accessory buildings with a wall length greater than 6.0 m from 2.4 m to 2.08 m at 7211 Bridge Street to retain an existing detached garage.\n   3. Reduce the minimum required rear yard setback for 60% of the first storey from 9.60 m to 7.4 m, as well as the remaining 40% of the first storey and the second storey from 10.70 m to 8.0 m at 7231 Bridge Street to retain an existing dwelling. Also, reduce the minimum required rear yard setback for a portion of the second storey from 10.7 m to 6.8 m to retain an existing second-storey deck.\n   4. Reduce the minimum required rear yard setback for 60% of the first storey from 9.60 m to 7.02 m, as well as the remaining 40% of the first storey and the second storey from 10.70 m to 7.02 m at 7251 Bridge Street to retain an existing dwelling.\n\nBackground:\n- Khalid Hassan has applied on behalf of the owners for permission to reduce the minimum rear yard setback requirements for four properties in a proposed 16 lot subdivision.\n- The properties were part of a rezoning application adopted by City Council on December 21, 2022.\n- The rezoning application aims to create six lots fronting Bridge Street and ten lots fronting an extension to Armstrong Street while retaining the existing homes on Bridge Street.\n- Variances to the rear yard setback provisions are required for four of the lots on Bridge Street.\n\nDevelopment Information:\n- The subject properties are part of a rezoning application to create 16 single-family lots.\n- The proposed variances are necessary to retain the existing structures on four of the lots.\n- If the variances are not approved, the existing structures would need to be modified or removed before subdivision approval.\n\nAnalysis:\n- The applicant requests variances to reduce the minimum rear yard setbacks for various reasons.\n- Staff supports the proposed variances because they do not facilitate new construction and only permit the retention of existing houses in good condition.\n- Any new construction would still need to comply with the minimum setback requirements of Zoning Bylaw 8500.\n- The retention of existing single-family homes was identified during the rezoning application.\n- The proposed setback variances do not affect the tree retention secured through the rezoning process or the applicant's commitment to provide new trees on-site.\n- The adjacent properties to the west, created upon subdivision, will be owned by the applicant.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:57:36.089Z",
    "updateDate": "2024-02-07T08:57:36.089Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_1_Oct_25_DPP_9291__9331_No70613.pdf",
    "text": "City of Richmond Report to Development Permit Panel\n\nTo: Development Permit Panel\nDate: October 4, 2023\nFrom: Wayne Craig\nFile: DP 17-790086\nDirector, Development\n\nRe: Application by Jhujar Construction Ltd. for a Development Permit at 9291 and 9311/9331 No. 2 Road\n\nStaff Recommendation: Issue a Development Permit for the construction of 12 townhouse units and one secondary suite at 9291 and 9311/9331 No. 2 Road. The site is zoned \"Low Density Townhouses (RTL4)\" with vehicle access provided via 9211 No. 2 Road.\n\nWayne Craig\nDirector, Development\n(604-247-4625)\n\nStaff Report\n\nOrigin: DP 17-790086\n\nJhujar Construction Ltd. has applied to the City of Richmond to develop 12 townhouse units at 9291 and 9311/9331 No. 2 Road. Vehicle access will be through a Statutory Right-of-Way (SRW) registered on the adjacent property at 9211 No. 2 Road. One of the townhouse units will have a ground-level secondary suite and two units will be designed as convertible units. The site is being rezoned from \"Single Detached (RS 1/E)\" and \"Two-Unit Dwellings (RDl)\" zones to \"Low Density Townhouses (RTL4)\" zone. A Servicing Agreement is required prior to Building Permit issuance.\n\nDevelopment Information\n\nPlease refer to the attached Development Application Data Sheet (Attachment 1) for a comparison of the proposed development data with the relevant bylaw requirements.\n\nBackground\n\nDevelopment surrounding the subject site:\n- To the north: A ten-unit townhouse complex on a lot zoned \"Low Density Townhouses (RTL4)\".\n- To the east: A four-storey senior's apartment building on a lot zoned \"Medium Density Low Rise Apartments (RAM 1)\" and a church on a lot zoned \"Assembly (ASY)\".\n- To the south: Existing single-family homes on lots zoned \"Single Detached (RS 1/E)\".\n- To the west: Existing single-family dwellings on lots zoned \"Single-Detached (RS 1/B)\".\n\nRezoning and Public Hearing Results\n\nThe Public Hearing for the rezoning of this site was held on October 16, 2017. No concerns were expressed at the Public Hearing.\n\nStaff Comments\n\nThe proposed scheme satisfactorily addresses urban design issues and complies with the Official Community Plan and the \"Low Density Townhouses (RTL4)\" zone.\n\nAdvisory Design Panel Comments\n\nThe Advisory Design Panel supports the project.\n\nAnalysis\n\nConditions of Adjacency:\n- The proposed buildings address the massing of the surrounding residential developments.\n- Building height is stepped down to provide a transition to adjacent properties.\n- Privacy and overlook concerns are minimized.\n- Site grade will be raised or maintained to match existing grades and accommodate tree retention.\n- Hedgerows and trees will be retained and planted to enhance interfaces between the proposed development and existing residential developments.\n\nTransportation and Site Access:\n- Vehicle access is proposed through an existing Statutory Right-of-Way registered over the drive aisle of the neighboring townhouse development.\n- No direct vehicle access to No. 2 Road is permitted from the subject site.\n\n6165570\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:57:06.272Z",
    "updateDate": "2024-02-07T08:57:06.272Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_DP_18-824566_12700___12800_Rice_Mill_Rd_and_12280___12300_No70716.pdf",
    "text": "City of Richmond Development Permit Panel Report\nDate: October 30, 2023\nFile: DP 18-824566\n\nStaff Recommendation: Issue a Development Permit for the redevelopment of the BC Ferries Fleet Maintenance Unit and future subdivision at 12700 and 12800 Rice Mill Road and 12280 and 12300 No. 5 Road, which is designated as an Environmentally Sensitive Area.\n\nProject Description:\n- SNC Lavalin Inc., on behalf of BC Ferry Services Inc., has applied for a Development Permit for the redevelopment of the BC Ferries Fleet Maintenance Unit and related components at the specified locations.\n- The site is being rezoned from Agricultural (AGl) and Light Industrial (IL) to BC Ferries Fleet Maintenance and Moorage (ZI 14) to allow for the upgrading of the BC Ferries FMU.\n- The Development Permit application includes habitat compensation and mitigation measures for the designated Environmentally Sensitive Areas and Riparian Management Areas on the site.\n- A Servicing Agreement is required for infrastructure upgrades and dike works.\n\nSummary of FMU Works and Improvements:\n- Construction of a new machine shop building and supporting uses at the southeast portion of the site.\n- Renovations, modifications, and additions to existing buildings.\n- Addition of off-street parking, loading, and bike parking provisions.\n- Grade and elevation increases across the site.\n- Demolition of existing buildings at the southeast portion of the site.\n- Compensation and enhancements to the Environmentally Sensitive Areas and Riparian Management Areas.\n\nRevised Scope of FMU Redevelopment:\n- Two new buildings and a tower crane are not being constructed at this time.\n- Existing buildings will be retrofitted and modified to accommodate FMU activities.\n\nBackground:\n- Surrounding development includes vacant lands zoned Agriculture (AGl) to the north and a model airplane park also zoned Agriculture (AGl).\n- There is a designated Riparian Management Area associated with an existing watercourse along Rice Mill Road.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:56:19.704Z",
    "updateDate": "2024-02-07T08:56:19.704Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_2_10700_Cambie_Rd_112923_DP70798.pdf",
    "text": "City of Richmond Report to Development Permit Panel\nTo: Development Permit Panel\nDate: November 6, 2023\nFrom: Wayne Craig\nFile: DP 18-843281\nDirector of Development\nRe: Application by Lovick Scott Architects for a Development Permit at #115 - 10700 Cambie Road\nStaff Recommendation: That a Development Permit be issued for exterior renovations and minor on-site upgrades to the existing McDonald's restaurant at #115 - 10700 Cambie Road on a site zoned \"Auto-Oriented Commercial (CA)\".\n\nStaff Report\nOrigin: DP 18-843281\nLovick Scott Architects has applied for permission to undertake exterior building renovations to the existing McDonald's restaurant located at #115 10700 Cambie Road. This includes upgrades to the on-site landscaping and the existing garbage and recycling enclosure on a site zoned \"Auto-Oriented Commercial (CA)\".\n\nDevelopment Information\nThis Development Permit only applies to the portion of the building that contains the existing McDonald's restaurant (Unit 115) and immediate surrounding on-site landscaping and vehicle circulation areas. No rezoning application is required, and no servicing or infrastructure works are needed.\n\nBackground\nThe existing McDonald's restaurant is a one-storey building with a drive-through service component. The proposed modifications will only be made to the McDonald's restaurant and not the neighboring commercial retail unit. The site is part of a commercial complex with other businesses and off-street parking.\n\nDevelopment surrounding the subject site:\n- To the north: a business park zoned \"Industrial Business Park (IB 1)\"\n- To the east: an access road and a one-storey commercial building on a site zoned \"Auto-Oriented Commercial (CA)\"\n- To the south: Highway 99 and an existing hotel on a site zoned \"Auto-Oriented Commercial (CA)\"\n- To the west: Highway 99 and the off-ramp for the Cambie Road overpass\n\nStaff Comments\nThe proposed scheme satisfactorily addresses urban design issues and staff comments. It complies with the Official Community Plan and the \"Auto-Oriented Commercial (CA)\" zone.\n\nAdvisory Design Panel Comments\nDue to the minor nature of the renovations, the application was not presented to the Advisory Design Panel.\n\nAnalysis\nConditions of Adjacency:\n- Modifications to the on-site enclosure for garbage, recycling, and organic waste are being undertaken. The enclosure will be fully enclosed and screened from the sidewalk.\n- No modifications to the building's mechanical systems are required.\n- Existing rooftop mechanical units will be screened.\n- Drive-through operations audio/speaker box system is oriented to minimize impacts and adjust volume based on ambient noise conditions.\n- No acoustical study was required.\n\nUrban Design and Site Planning:\n- The modifications are primarily limited to the building exterior, existing landscape areas, and service area.\n- Off-street parking, vehicle circulation, and drive-through servicing will generally remain unchanged.\n- Additional modifications include parking stall curb stops, pavement markings, maintaining pedestrian linkage, and implementing additional signage.\n- The drive-through configuration will be maintained.\n- The surrounding off-street parking provides for 25 vehicle parking stalls, complying with requirements.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:55:50.948Z",
    "updateDate": "2024-02-07T08:55:50.948Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_3_11191_Twigg_Place_112923_DP70799.pdf",
    "text": "To: City of Richmond Development Permit Panel\nFrom: Wayne Craig, Director of Development\nDate: November 6, 2023\nFile: DP 21-944169\n\nStaff Recommendation: Issue a Development Permit at 11191 Twigg Place for the installation of a barge loading facility on an Environmentally Sensitive Area (ESA) site.\n\nBackground: Weaver Technical Corp. has applied for a Development Permit to build a barge ramp at 11191 Twigg Place. The site is currently zoned as \"Industrial (I)\" and is used for truck and industrial equipment storage. There are no permanent structures on the site, except for two shipping containers used as an office space. The proposed barge ramp would be located within the ESA portion of the site.\n\nStaff Comments: The proposed barge ramp would impact the ESA designated areas on the site. While industrial uses are allowed without a Development Permit, the installation of a barge loading facility within the ESA requires an ESA Development Permit. The proposed scheme addresses environmental concerns and complies with the Official Community Plan and the \"Industrial (I)\" zone.\n\nAnalysis: The owner plans to construct a barge ramp in the water lot in front of the site for transporting aggregate materials. No aggregate materials would be stored on-site. The water lot is currently leased and used for log storage. The owner has entered into a memorandum of understanding with the leaseholder and has submitted a crown land lease application to the Province for the change in water lot use. Access to the ramp would be provided via a truck staging area and a drive aisle on the site. The development would not include any additional buildings or structures beyond the barge ramp. The existing office operation in the shipping containers would remain. The site would be raised to prepare for future dike improvements and climate change effects, with lock block walls installed along the property lines. Truck traffic would access the barges via the raised surface.\n\nSenior Governmental Approvals: The proposed barge ramp facility requires approvals from multiple regulatory agencies in addition to the City of Richmond.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:55:26.231Z",
    "updateDate": "2024-02-07T08:55:26.231Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_1_7580_No_1_Rd_112923_DP70797.pdf",
    "text": "City of Richmond Development Permit Panel Report\n\nDate: November 6, 2023\nFile: DP 18-829236\nRe: Application by 1132865 BC Ltd. for a General Compliance Ruling at 7580 No. 1 Road\n\nStaff Recommendation: The attached plans involving changes to the Tree Management Plan and Landscape Plan are in General Compliance with the approved Development Permit (DP 18-829236).\n\nBackground: 1132865 BC Ltd. has requested a General Compliance ruling to modify the Tree Management Plan and Landscape Plan for the construction of 30 townhouse units at 7580 No. 1 Road. The rezoning of the site to the \"Medium Density Townhouse (RTM2)\" zone was approved by Council on October 12, 2021. The Development Permit (DP 18-829236) was also issued on October 12, 2021. The development is nearing completion with interior finishing work in progress and landscaping work remaining.\n\nStaff Comments: The proposed modification to the Tree Management Plan and Landscape Plan is to address the deterioration and irreversible decline of a tree (Tree Tag #726) that was supposed to be retained. The proposed changes do not impact any works associated with the Servicing Agreement.\n\nSummary of Tree Protection and Replacement Plan:\n- Ten trees were identified to be retained and protected, with this report specifically addressing Tree 726.\n- The south side yard setback at the southwest corner of the site was increased to 7.56 m to retain the Sycamore maple tree (Tree 726).\n- Tree protection fencing was installed around all retained trees prior to construction activities.\n- A Tree Management Plan and Landscape Plan were issued with the Development Permit.\n- The applicant agreed to plant 62 new trees on-site, including 13 conifers and 49 deciduous trees.\n\nAnalysis: Tree 726 has shown signs of decline since June 2022 and is in an advanced state of irreversible decline, according to the Project Arborist's findings. The City's Tree Preservation staff have reviewed and agreed with these findings.\n\nNote: Attachments 1-5 provide additional details and plans related to the General Compliance ruling.\n\nWayne Craig\nDirector, Development\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:55:07.844Z",
    "updateDate": "2024-02-07T08:55:07.844Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Item_1_4831_Steveston_Highway70894.pdf",
    "text": "City of Richmond Development Permit Panel Report\nDate: November 22, 2023\nFile: DP 23-025993\nRe: Application by Anthony Boni for a Development Permit at 4831 Steveston Highway\n\nStaff Recommendation:\n1. Issue a Development Permit for the construction of a three-storey 25-unit affordable rental housing building at 4831 Steveston Highway.\n2. Allow 37% of the required vehicle parking spaces to be small car spaces.\n\nBackground:\n- Anthony Boni has applied to develop a three-storey 25-unit affordable rental housing building at 4831 Steveston Highway.\n- The site is currently vacant and owned by the City of Richmond.\n- The proposed project has funding support from the Canada Mortgage and Housing Corporation (CMHC) and BC Housing in partnership with Turning Point Housing Society.\n- The site is being rezoned from \"Single Detached (RS 1/E)\" to \"Low Rise Rental Apartments (ZLR48) - Steveston Highway (Steveston)\" under Bylaw 10478 (RZ 23-018081).\n- A Servicing Agreement is required for the building permit issuance.\n\nDevelopment Information:\n- Please refer to the attached Development Application Data Sheet for a comparison of the proposed development data with the relevant Bylaw requirements.\n\nRezoning and Public Hearing Results:\n- Design issues identified during the rezoning process include compliance with Development Permit Guidelines, enhancing residential streetscape, refining the site plan for aboveground private utility infrastructure improvements, landscaping and tree management, common amenity space programming and design, accessibility, pedestrian circulation, sustainability, crime prevention through environmental design, parking, loading, waste management, and off-site frontage elements.\n- Concerns expressed during the Public Hearing include direct connection to the Railway Greenway and providing more bicycle parking opportunities for residents.\n- Staff have worked with the applicant to ensure the proposed architectural form and character align with design guidelines and interface well with adjacent properties.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T08:54:44.201Z",
    "updateDate": "2024-02-07T08:54:44.201Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1048670736.pdf",
    "text": "City of Richmond The Council of the City of Richmond enacts as follows: Consolidated Fees Bylaw No. 8636, Amendment Bylaw No. 10486. The Consolidated Fees Bylaw No. 8636, as amended, is further amended by deleting the schedules attached to Bylaw No. 8636, as amended, and substituting the schedules attached to and forming part of this Bylaw. This Bylaw comes into force and effect on January 1, 2024. This Bylaw is cited as \"Consolidated Fees Bylaw No. 8636, Amendment Bylaw No. 10486\". FIRST READING, SECOND READING, THIRD READING, ADOPTED Bylaw 10486. MAYOR. Document Number: 7335580. Version: 1. OCT 10 2023. CORPORATE OFFICER. CITY OF RICHMOND. APPROVED for content by orang dept лі. APPROVED for alty by Solator Its.\n\nSchedules to Bylaw 10486:\nSCHEDULE - ANIMAL CONTROL REGULATION. Animal Control Regulation Bylaw No. 7932. Cat Breeding Permit Fee. Section 2.2 Description. Cat breeding permit for three years.\nImpoundment Fees. Section 8 Description. 1st time in any calendar year. Neutered male or spayed female dog. Non-neutered male or unspayed female dog. Dangerous Dog. 2nd time in any calendar year. Neutered male or spayed female dog. Non-neutered male or unspayed female dog. Dangerous Dog. 3rd time and subsequent times in any calendar year. Neutered male or spayed female dog. Non-neutered male or unspayed female dog. Dangerous Dog. Bird. Domestic farm animal. Other animal. Impoundment fee also subject to transportation costs.\n\nFees:\n7335580 Fee $47.25\nCNCL-245 Fee Page 2 $54.00\n$162.00\n$662.00\n$107.00\n$335.00\n$1,314.00\n\nImpoundment fee also subject to transportation costs.\n*Subject always to the power set out in Section 8.3.12 of Animal Control Regulation Bylaw No. 7932 to apply for an order that a dog be destroyed.\nNote: In addition to the fees payable above (if applicable), a licence fee will be charged where a dog is not currently licensed.\n$335.00\n$662.00\n$1,314.00\n$8.25\n$80.25\n$40.50.\n",
    "maxPages": 2,
    "pages": [],
    "type": "image",
    "createDate": "2024-02-07T01:42:15.527Z",
    "updateDate": "2024-02-07T01:42:15.527Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Application_by_Terra_8120_Number_1_Road_Limited_Partnership_for_Rezoning70635.pdf",
    "text": "Report to Planning Committee\nDate: October 25, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 21-945869\nRe: Application by Terra 8120 Number 1 Road Limited Partnership for Rezoning at 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” Zone to the “Low Density Townhouses (RTL4)” Zone\n\nStaff Recommendation: Introduce and give first reading to Richmond Zoning Bylaw 8500, Amendment Bylaw 10498, for the rezoning of 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone.\n\nREPORT CONCURRENCE: Affordable Housing; CONCURRENCE OF GENERAL MANAGER, City of Richmond.\n\nStaff Report:\n- Terra 8120 Number 1 Road Limited Partnership has applied to rezone 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone.\n- The purpose is to develop nine townhouse units with vehicle access from No. 1 Road.\n- Existing dwellings on the site will be demolished.\n- Surrounding development includes single-family dwellings and townhouses.\n- The redevelopment proposal is consistent with the Official Community Plan and Arterial Road Land Use Policy.\n- Although the frontage is less than the required 50 m, staff support the application due to efforts made to acquire adjacent properties and the submission of a preliminary concept plan for future redevelopment.\n- A Statutory Right-of-Way agreement must be registered to secure shared access to adjacent properties.\n\nNote: The original document contains additional information and attachments.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:41:34.602Z",
    "updateDate": "2024-02-07T01:41:34.602Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Application_by_Navreet_Gill_for_Rezoning_at_11831_11833_Seabrook_Crescent70634.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: October 23, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 22-010976\nRe: Application by Navreet Gill for Rezoning at 11831/11833 Seabrook Crescent from the \"Single Detached (RS1/E)\" Zone to the \"Single Detached (RS2/B)\" Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10510, for the rezoning of 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone, be introduced and given first reading.\nfor Wayne Craig, Director, Development (604-247-4625) WC:le Att. 6\n\nREPORT CONCURRENCE\nR\nOUTED\nT\nO\n:\nC\nONCURRENCE\nAffordable Housing\n\nC\nONCURRENCE OF\nG\nENERAL\nM\nANAGER\nCity\nof\na\nW•ffis·\n•\nRichmond\ndvfy\n-\nPLN - 39\nOctober 23, 2023\n- 2 -\nRZ 22-010976\n7409688\nStaff Report\nOrigin\nNavreet Gill has applied on behalf of the property owners, 1303287 B.C. Ltd. (Balraj Singh Sanghera and Rajbir Kaur Chatha), to rezone 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone in order to permit the property to be subdivided into two single-family lots, each with vehicle access from Seabrook Crescent. A location map and aerial photo are provided in Attachment 1. The proposed subdivision plan and draft site plan are provided in Attachment 2.\n\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\n\nSubject Site Existing Housing Profile\nThe subject site contains an existing un-stratified non-conforming duplex (two-unit dwelling), which will be demolished prior to subdivision. Both dwelling units are currently tenant occupied and do not contain any secondary suites. The applicant has indicated that the tenants are aware of the redevelopment proposal and the applicant will ensure compliance with the Residential Tenancy Act.\n\nSurrounding Development\nDevelopment immediately surrounding the site is as follows:\nTo the North: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the South: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the East: Across the lane, an existing duplex on a lot zoned “Single Detached (RS1/E)” fronting onto No. 5 Road. There is a Rezoning application and Development Permit (RZ 22-019002/DP 23-028942) at 10111/10113 No. 5 Road to permit the development of three front-back duplex lots. The rezoning application received third reading on October 16, 2023.\nTo the West: Across Seabrook Crescent, an existing duplex on a lot zoned “Single Detached (RS1/E)”.\n\nRelated Policies & Studies\nOfficial Community Plan\nThe subject site is designated as “Neighbourhood Residential” in the Official Community Plan (OCP). This proposal is consistent with this OCP designation.\n\nPLN - 40\nOctober 23, 2023\n- 3 -\nRZ 22-010976\n7409688\nSingle-Family Lot Size Policy 5434/ Zoning Bylaw 8500\nThe subject property is located within the area covered by Lot Size Policy 5434, adopted by City Council in 1990, amended in 1991 and 2006 (Attachment 4). The Policy permits a majority of lots within the Policy Area (including the subject property) to be rezoned and subdivided in accordance with the provisions of the “Single Detached (RS1/E)” zone.\n\nThe subject site is currently occupied by a legal duplex. Section 2.3.7 of Richmond Zoning Bylaw 8500 provides that the Lot Size Policy does not apply to a rezoning that a legal duplex and which are intended to be subdivided into no more than two single-family lots. The proposed rezoning and subdivision complies with Section 2.3.7 and would result in the creation of two single-family lots being 444.9 m2 and 450.2 m2 in area. Further, the proposed rezoning and subdivision would comply with the minimum lot dimensions and size applicable to the “Single Detached (RS2B)” zone.\n\nMinistry of Transportation & Infrastructure Approval\nAs the subject site is located within 800 m of an intersection of a Provincial Limited Access Highway and a City road, this redevelopment proposal was referred to the Ministry of Transportation and Infrastructure (MOTI) for review and comment. Preliminary confirmation has been received from MOTI indicating that they have no objections to the proposed redevelopment. Final approval from MOTI is required prior to final adoption of the rezoning bylaw.\n\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\n\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\n\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\n\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\n\nPLN - 41\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:41:13.034Z",
    "updateDate": "2024-02-07T01:41:13.034Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_4-_Application_-_10840_10860_Bonavista_Gate70723.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: October 3, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 22-011063\nRe: Application by Pati Yik of Kennon Construction for Rezoning at 10840/10860 Bonavista Gate from the “Two-Unit Dwellings (RD1)” Zone to the “Single Detached (RS2/C)” Zone\n\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10497, for the rezoning of 10840/10860 Bonavista Gate from the “Two-Unit Dwellings (RD1)” zone to the “Single Detached (RS2/C)” zone, be introduced and given first reading.\n\nREPORT CONCURRENCE\nAffordable Housing\nCONCURRENCE OF GENERAL MANAGER C OF GPH - 111\n\nPati Yik of Kennon Construction has applied on behalf of the property owners, Thomas Mau Shing Ng, Ling Y Ha and Shui Ting Chua to the City of Richmond to rezone 10840 and 10860 Bonavista Gate from the “Two-Unit Dwellings (RD1)” zone to the “Single Detached (RS2/C)” zone in order to subdivide the existing duplex lot into two single-family lots, each with vehicle access from Bonavista Gate.\n\nFindings of Fact: A Development Application Data Sheet providing details about the development proposal is attached.\n\nSubject Site Existing Housing Profile: This site is currently occupied by an existing duplex (two-family) dwelling, which will be demolished prior to subdivision. The existing two-family dwelling is owner-occupied and does not contain any secondary suites.\n\nSurrounding Development: To the North: An existing strata-titled duplex on a lot zoned “Single Detached (RS1/E)”. To the South: Existing single detached houses on a lot zoned “Single Detached (RS1/E)”. To the East: An existing strata-titled duplex on a lot zoned “Two-Unit Dwellings (RD1)”. To the West: Single family dwellings on lots zoned “Single Detached (RS1/E)” across Bonavista Gate.\n\nRelated Policies & Studies: Official Community Plan/Steveston Area Plan: The property is designated as Neighbourhood Residential in the Official Community Plan (OCP), and as Single Family in the Steveston Area Plan.\n\nFloodplain Management Implementation Strategy: The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\n\nPublic Consultation: A rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property. Should the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment. Public notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\n\nAnalysis: Proposed Rezoning and Subdivision: The applicant is proposing to rezone the subject site and subdivide it into two single-family lots, each with a secondary suite, with access from Bonavista Gate. This development proposal is consistent with development in the area. The proposed subdivision plan and site plan are shown in Attachment 2. Staff worked with the applicant to modify the building envelope to enable retention of trees on site at the front and rear of the property.\n\nExisting Legal Encumbrances: There is a 3.0 m wide Statutory Right-of-Way (SRW) in the backyard along the eastern property line for sanitary sewer utility purposes. The applicant has been advised that encroachment into the SRW is not permitted. A City Covenant is registered on both 10840 and 10860 Bonavista Gate Titles that restrict the development to a duplex, therefore, the duplex covenants must be discharged from Title prior to the final adoption of the rezoning bylaw. There is a Land Tax Deferment Act Agreement currently registered on the 10840 Bonavista Gate Title (proposed Lot A), which allows the property owner to defer the payment of taxes. All deferred taxes must be paid and the agreement must be discharged from Title prior to the preparation and registration of any legal documents associated with this rezoning application.\n\nTransportation and Site Access: Vehicle access is proposed to be from Bonavista Gate for both of the proposed lots. The existing driveways will be removed and new driveways will be constructed as detailed in the Site Servicing and Frontage Improvements sub-section of this report. Two parking spaces will be provided for each dwelling unit in the garage.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:40:41.779Z",
    "updateDate": "2024-02-07T01:40:41.779Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_3_-_Application_-_Interface_Architecture_Inc70721.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: September 18, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 21-939470\nRe: Application by Interface Architecture Inc. for Rezoning at 5471, 5491/5493, 5531, 5551, 5571, 5591, 5595, 5611/5613 Steveston Highway from “Single Detached (RS1/B)” Zone, “Single Detached (RS1/E)” Zone and “Two-Unit Dwellings (RD1)” Zone to “Medium Density Townhouses (RTM2)” Zone\n\nStaff Recommendation: Richmond Zoning Bylaw 8500, Amendment Bylaw 10496, for the rezoning of 5471, 5491/5493, 5531, 5551, 5571, 5591, 5595, 5611/5613 Steveston Highway from “Single Detached (RS1/B)” zone, “Single Detached (RS1/E)” zone and “Two-Unit Dwellings (RD1)” zone to the “Medium Density Townhouses (RTM2)” zone, be introduced and given first reading.\n\nREPORT CONCURRENCE\nTo: CONCURRENCE\nAffordable Housing: Yes\n\nCONCURRENCE OF GENERAL MANAGER\nPH - 53\n\nProject Description: Interface Architecture Inc., on behalf of Steveston Townhouse Ventures Inc., has applied to rezone 5471, 5491/5493, 5531, 5551, 5571, 5591, 5595, 5611/5613 Steveston Highway to permit the development of 30 townhouse units with seven secondary suites and a right-in/right-out vehicle access from Steveston Highway.\n\nFindings of Fact: The subject site consists of eight properties with a total combined frontage of approximately 151 m along Steveston Highway and a 22 m frontage along Lassam Road. The proposed density is 0.65 floor area ratio (FAR). The site layout includes 12 two-storey units and 18 three-storey units in ten townhouse clusters. Seven secondary suites and five accessible units are included in this proposal. Vehicle access is provided by a single right-in/right-out driveway access to Steveston Highway.\n\nSurrounding Development: To the North: Existing single-family dwellings on lots zoned “Single Detached (RS1/B)”. To the South: Across Steveston Highway, existing single-family dwellings on lots zoned “Single Detached (RS1/D)” and “Single Detached (RS1/E)”. To the East: Across Lassam Road, existing single-family dwellings on lots zoned “Single Detached (RS1/B)”. To the West: A recently constructed 28-unit townhouse complex on a lot zoned “Medium Density Townhouses (RTM2)”.\n\nRelated Policies & Studies: The proposed development is consistent with the 2041 Official Community Plan (OCP) Land Use Map designation for the subject site, which is “Neighbourhood Residential”. The Steveston Area Land Use Map designation is “Multiple-Family”. The proposal also complies with the Arterial Road Land Use Policy and the Floodplain Management Implementation Strategy.\n\nPublic Consultation: No comments have been received from the public regarding the rezoning application.\n\nAnalysis: The proposal includes consolidating the eight properties into one development parcel, with a total net site area of 6,214 m2. The development consists of 30 townhouses in a mix of two-storey and three-storey units in 10 clusters.\n\nPH - 55\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:40:08.568Z",
    "updateDate": "2024-02-07T01:40:08.568Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_2_-_Application_-_Hari_Singh_Gill_for_Rezoning_at_3300_Granville_Ave70720.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: September 18, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ22-026766\nRe: Application by Hari Singh Gill for Rezoning at 3300 Granville Avenue from \"Single Detached (RS1/E)\" Zone to \"Single Detached (RS2/B)\" Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10495, for the rezoning of 3300 Granville Avenue from “Single Detached (RS1/E)” zone to “Single Detached (RS2/B)” zone, be introduced and given first reading.\nWayne Craig, Director, Development (604-247-4625)\nWC:le\nAtt. 6\nREPORT CONCURRENCE\nR\nOUTED\nT\nO\n:\nC\nONCURRENCE\nAffordable Housing\n\nC\nONCURRENCE OF\nG\nENERAL\nM\nANAGER\nPH - 32\nStaff Report\nOrigin: Hari Singh Gill has applied to rezone the property at 3300 Granville Avenue from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone to allow the property to be subdivided into two single-family lots (Attachment 1). Vehicle access is proposed to be from Granville Avenue. The proposed subdivision plan is shown in Attachment 2.\nFindings of Fact: A Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile: This site is currently occupied by an existing single-family dwelling, which will be demolished prior to subdivision. The existing single-family dwelling is unoccupied and does not contain a secondary suite.\nSurrounding Development: Development immediately surrounding the site is as follows:\n- To the North: Across Granville Avenue, single detached houses zoned “Single Detached – Terra Nova (ZS2)”; and townhouses zoned “Town Housing – Granville Avenue (Terra Nova) and Dixon Avenue (Ash Street Sub Area) (ZT20)”.\n- To the South: Fronting onto Lockhart Road, single detached houses zoned “Single Detached (RS2/B)”.\n- To the East: Along Granville Avenue, single detached houses zoned “Single Detached (RS1/B)” and “Single Detached (RS1/E)”.\n- To the West: Along Granville Avenue, single detached houses zoned “Single Detached (RS1/B)” and “Single Detached (RS1/E)”; and zoned “Single Detached (RS1/K)” along Marrington Road.\nRelated Policies & Studies\nOfficial Community Plan (OCP Designation): The Official Community Plan (OCP) land use designation for the subject property is “Neighbourhood Residential” (NRES). The proposed rezoning and subdivision application is consistent with this designation.\nPH - 33\nLot Size Policy 5447: The subject property falls within Single-Family Lot Size Policy 5447, which allows for the subdivision of the subject property consistent with the R1/B zone (Attachment 4). The rezoning and subdivision proposed in this application is consistent with this Lot Size Policy.\nFloodplain Management Implementation Strategy: The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation: A rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property. Should the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment. Public notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nAnalysis\nProposed Rezoning and Subdivision: The applicant is proposing to rezone the subject site and subdivide into two single-family lots, each with a one bedroom secondary suite. This development proposal is consistent with the redevelopment along this block of Granville Avenue, including the adjacent properties. The proposed subdivision plan is shown in Attachment 2.\nExisting Legal Encumbrances: There is an existing Statutory Right-of-Way (SRW) for the City in the rear yard for sanitary sewer services. The applicant has been advised that encroachment into the SRW is not permitted.\nTransportation and Site Access: Vehicle access is proposed to be from Granville Avenue. The existing driveway will be removed and new driveways will be constructed through a Servicing Agreement as detailed in the Site Servicing and Frontage Improvements sub-section of this report.\nPH - 34\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:39:16.415Z",
    "updateDate": "2024-02-07T01:39:16.415Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/_1_-_Application_-_Matthew_Cheng_-_7300_St70719.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: September 18, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 21-943417\nRe: Application by Matthew Cheng for Rezoning at 7300 St. Albans Road from \"Single Detached (RS1/E)\" Zone to \"High Density Townhouses (RTH1)\" Zone\n\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10494, for the rezoning of 7300 St. Albans Road from \"Single Detached (RS1/E)\" zone to \"High Density Townhouses (RTH1)\" zone, be introduced and given first reading.\n\nREPORT CONCURRENCE\nTo: CONCURRENCE\nAffordable Housing: ✔\nCONCURRENCE OF GENERAL MANAGER PH - 5\n\nStaff Report\nOrigin: Matthew Cheng, on behalf of 1124053 B.C. LTD (Director: Pavendeep Kooner), has applied to the City of Richmond for permission to rezone 7300 St. Albans Road from the \"Single Detached (RS1/E)\" zone to the \"High Density Townhouses (RTH1)\" zone to permit the development of four townhouse units with one secondary suite (Attachment 1).\n\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 2).\n\nSubject Site Existing Housing Profile\nThe subject site contains an unoccupied single-family dwelling.\n\nSurrounding Development\nTo the North: The St. Albans' Anglican Church zoned \"Assembly (ASY)\".\nTo the South: A seven-unit townhouse complex zoned \"Medium Density Low Rise Apartments (RAM1)\".\nTo the East: A 36-unit townhouse complex zoned \"Medium Density Low Rise Apartments (RAM1)\".\nTo the West: Across St. Albans Road, a three-storey apartment (over a single-storey parking structure) zoned \"Medium Density Low Rise Apartments (RAM1)\".\n\nExisting Legal Encumbrances\nThere is a City Statutory Right-of-Way (SRW) registered on Title of the subject property for the sanitary sewer located along the east property line. The applicant has been advised that encroachment into the SRW is not permitted.\n\nRelated Policies & Studies\nOfficial Community Plan/City Centre Area Plan\nThe subject property is designated as \"Neighbourhood Residential\" in the Official Community Plan (OCP). The subject property is also located within the City Centre Area, Schedule 2.10 of the OCP and is designated \"Sub-Area B.1: Mixed Used - Low Rise Residential & Limited Commercial\" which is intended for grade-oriented housing in the form of townhouses with a common parking structure of conventional and stacked townhouses.\n\nPH - 6\nThe proposed development provides for a similar form to the adjacent development to the south and the preliminary design complies with the Sub-Area B.1 guidelines in terms of land use, density and overall neighbourhood character. At the Development Permit (DP) stage, the townhouses' design, form and character will be further reviewed.\n\nAs set out in the City Centre Area Plan, the applicant is required to provide a contribution at a rate of $0.34 per buildable square foot for future City Community Planning studies.\n\nRegistration of a legal agreement on Title is required, ensuring that future owners are aware that the development is subject to potential impacts due to other developments that may be approved within the City Centre.\n\nSt. Albans Sub-Area Plan\nThe proposed development is consistent with the Multi-Family Low Rise land use designation in the St. Albans Sub-Area Plan, which envisions three-storey apartments, townhouses, two-family or single-family dwellings (Attachment 3). The proposal for four three-storey townhouse units and one secondary suite is also generally consistent with the surrounding developments.\n\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\n\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not yet received any comments from the public about the rezoning application in response to the rezoning sign on site.\n\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the public will have an opportunity to further comment on all of the proposed amendments at a Public Hearing.\n\nPublic notification of the Public Hearing will be provided as per the Local Government Act and the City's Zoning Bylaw 8500.\n\nAnalysis\nBuilt Form and Architectural Character\nThe applicant proposes to construct a total of four townhouse units and one secondary suite with access from St. Albans Road. The layout of the townhouse units is oriented around a single driveway providing access to the site from St. Albans Road and a north-south internal maneuvering aisle providing access to the unit garages. A total of two three-storey duplex clusters are proposed.\n\nPH - 7\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:38:45.344Z",
    "updateDate": "2024-02-07T01:38:45.344Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1048770862.pdf",
    "text": "- City of Richmond 7325387\n- Bylaw 8641 is amended by deleting section 6.1 and replacing it with a new section regarding service connection and energy transfer stations.\n- Bylaw 8641 is further amended by deleting section 6.6 and replacing it with a new section regarding additional service connections and energy transfer stations.\n- Schedule C (Rates and Charges) in Bylaw 8641 is deleted in its entirety and replaced with a new Schedule C attached as Schedule A to the bylaw.\n- This amendment is referred to as \"Amendment Bylaw No. 10487\" for Bylaw 8641.\n- The bylaw goes through first reading, second reading, third reading, and is adopted.\n- The bylaw is approved by the mayor and corporate officer of the City of Richmond.\n- The bylaw is also approved for legality by the solicitor.\n",
    "maxPages": 2,
    "pages": [],
    "type": "image",
    "createDate": "2024-02-07T01:38:22.032Z",
    "updateDate": "2024-02-07T01:38:22.032Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Application_by_Gurjit_Pooni_for_Rezoning_at_10511_Lassam_Road70760.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: November 6, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 22-011080\nRe: Application by Gurjit Pooni for Rezoning at 10511 Lassam Road from the \"Single Detached RS1/E\" Zone to the \"Single Detached (RS2/B)\" Zone\nStaff Recommendation: Richmond Zoning Bylaw 8500, Amendment Bylaw 10513, for the rezoning of 10511 Lassam Road from the \"Single Detached (RS1/E)\" zone to the \"Single Detached (RS2/B)\" zone, be introduced and given first reading.\nWayne Craig, Director, Development (604-247-4625)\nWC:ac\nAtt.6\nREPORT CONCURRENCE\nAffordable Housing\nCONCURRENCE OF GENERAL MANAGER\nPLN - 7\nNovember 6, 2023\n- 2 -\nRZ 22-011080\n7404492\nStaff Report\nOrigin: Onyx Premier Homes Ltd. (Directors: Amar Gill and Jasdeep Uppal) have applied to the City of Richmond for permission to rezone 10511 Lassam Road from the \"Single Detached (RS1/E)\" zone to the \"Single Detached (RS2/B)\" zone, to permit the property to be subdivided to create two single-family lots with access from Lassam Road. A map and aerial photograph showing the location of the subject site is included in Attachment 1. The proposed subdivision is provided in Attachment 2.\nFindings of Fact: A Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile: There is an existing single-family dwelling on the subject property which is currently vacant and proposed to be demolished. There are no existing secondary suites in the dwelling.\nSurrounding Development: Development immediately surrounding the subject site is as follows:\nTo the North: A school (James McKinney Elementary School) on a lot zoned \"School & Institutional Use (SI)\", accessed from Lassam Road.\nTo the South: A single-family dwelling on a property zoned \"Single Detached (RS1/B)\", accessed from Lassam Road.\nTo the East: Across Lassam Road, single-family dwellings on lots zoned \"Single Detached (RS1/E)\", accessed from Lassam Road.\nTo the West: The parking area for a school (James McKinney Elementary School) on a lot zoned \"School & Institutional Use (SI)\", accessed from Lassam Road.\nRelated Policies & Studies\nOfficial Community Plan/Steveston Planning Area: The subject property is located in the Steveston planning area and is designated as \"Neighbourhood Residential\" in the Official Community Plan (OCP). The property is designated for \"Single Family\" use in the Steveston Area Plan. The proposed rezoning and subdivision are consistent with these designations.\nPLN - 8\nNovember 6, 2023\n- 3 -\nRZ 22-011080\n7404492\nSingle Family Lot Size Policy 5420/Zoning Bylaw 8500: The subject property is located within the area covered by Lot Size Policy 5420, adopted by City Council in 1989, and subsequently amended by Council on August 7, 1992, and on August 21, 1995 (Attachment 4). The Policy permits properties along Lassam Road to be rezoned and subdivided in accordance with the provisions of the \"Single Detached (RS2/B)\" zone (minimum 12 m wide lots). Each proposed lot at the subject site will be approximately 12.6 m (41 ft.) wide and approximately 575 m² (6,189.25 ft²) in area which conforms to the RS2/B zone. The proposed rezoning complies with the Lot Size Policy.\nFloodplain Management Implementation Strategy: The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation: In accordance with the City's Early Public Notification Policy No. 1316, a notice of the development proposal was provided to residents within 100 metres of the subject site. In addition, a rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the early public notification or placement of the rezoning sign on the property. Should the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment. Public notification for the Public Hearing will be provided as per the Local Government Act and the City's Zoning Bylaw 8500.\nAnalysis: This redevelopment proposes to rezone and subdivide an existing single-family lot into two new single-family lots with vehicular access for both new lots off Lassam Road. This rezoning and subdivision is consistent with the emerging lot fabric and vehicular access along Lassam Road.\nExisting Legal Encumbrances: There is an existing 3 m wide Statutory Right-of-Way (SRW) for City sanitary service that covers a small portion of the property in the southwest corner which will be expanded and widened northward with utility upgrades. The applicant has been advised that no building encroachment into the SRW is permitted.\nTransportation and Site Access: The subject site currently has vehicular access from a driveway letdown along Lassam Road. In accordance with the Residential Lot (Vehicular) Access Regulation Bylaw 7222, vehicle access to proposed Lot 1 and proposed Lot 2 will be from Lassam Road.\nPLN - 9\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:37:52.625Z",
    "updateDate": "2024-02-07T01:37:52.625Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr10.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Nick Danford\nContact No.: 604.871.6121\nRTS No.: 15751\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 848 Seymour Street\nRECOMMENDATION TO REFER\nRezone the lands at 848 Seymour Street from DD District to CD-1 District, increase maximum floor space ratio (FSR) from 5.75 to 17.67, and maximum building height from 91.4 m to 97.7 m to allow for a 30-storey hotel. Refer the rezoning application and plans to Public Hearing with the recommendation to approve the application, subject to conditions.\nFURTHER instruct the Director of Legal Services to prepare necessary by-laws for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nApprove the application by Perkins & Will, on behalf of Paul Y. Construction (B.C.) LTD., Inc., to rezone the lands at 848 Seymour Street from DD District to CD-1 District, increase FSR to 17.67 and building height to 97.7 m for a 30-storey hotel.\nApprove the draft CD-1 By-law prepared for the Public Hearing.\nApprove the proposed form of development, with minor alterations allowed by the Director of Planning.\nApprovals subject to Conditions of Approval in Appendix B.\nAmend the Sign By-law to establish regulations for the new CD-1, subject to approval of the CD-1 By-law.\nInstruct the Director of Legal Services to bring forward the amendment to the Sign By-law.\nAmend the Noise Control By-law to include the CD-1, subject to approval of the CD-1 By-law.\nInstruct the Director of Legal Services to bring forward the amendment to the Noise Control By-law.\nApprove Recommendations A and C with the following conditions: (i) Passage of resolutions creates no legal rights or obligations, (ii) Approval does not obligate the City to enact a rezoning by-law, (iii) City officials have authority and discretion.\nREPORT SUMMARY\nEvaluate application to rezone 848 Seymour Street to CD-1 District for a hotel development. Staff support the application, subject to conditions. Recommend referral to public hearing with approval in principle, subject to conditions.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\nVancouver Plan (2022)\nRezoning Policy for the Central Business District (CBD) and CBD Shoulder (2009)\nMetro Core Jobs and Economy Land Use Plan (2007)\nInterim Hotel Development Policy (2018)\nEmployment Lands and Economy Review: Phase 2 (2020)\nGranville Street Interim Rezoning Policy (2023)\nDowntown Official Development Plan (1975, last amended 2022)\nDowntown (Except Downtown South) Design Guidelines (1975, amended 1993)\n(DD) Downtown District Schedule (1975, last amended 2022)\nGreen Buildings Policy for Rezonings (2010, last amended 2023)\nCommunity Amenity Contributions Policy for Rezonings (1999, last amended 2023)\nView Protection Guidelines (1989, last amended 2022)\nLatecomer Policy (2021)\nVancouver Development Cost Levy By-law No. 9755\nVancouver Utilities Development Cost Levy By-law No. 12183\nPublic Art Policy and Procedures for Rezoned Developments (2014, last amended 2021)\nREPORT\nEvaluate application to rezone 848 Seymour Street to CD-1 District for a hotel development. The site is located in the CBD and surrounded by residential, commercial, and arts, culture, and entertainment uses. The application meets the intent of the Rezoning Policy for the CBD and CBD Shoulder and the Metro Core Plan. Recommend referral to public hearing with approval in principle, subject to conditions.\nPolicy allows for additional height and density for qualifying applications. Building massing, pedestrian realm interface, public open space, solar access, and other urban development considerations are governed by the DODP. The Guidelines are supplemental to the DODP and provide further guidance on livability and urban design performance standards for all development in the downtown core. The ELER was a research and stakeholder engagement initiative to inform the economic foundations of the Vancouver Plan.\n",
    "maxPages": 4,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:36:41.173Z",
    "updateDate": "2024-02-07T01:36:41.173Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr9.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Nick Danford\nContact No.: 604.871.6121\nRTS No.: 15906\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 4330-4408 Arbutus Street and 2092 Nanton Avenue\nRECOMMENDATION TO REFER\nRezone the lands from R1-1 District to CD-1 District, increase maximum FSR and building height, and permit the development of a six-storey, 162-unit Community Care Facility - Class B.\nFURTHER, prepare the necessary by-law for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nApprove the rezoning application in principle, approve the draft CD-1 By-law, and approve the proposed form of development.\nAND FURTHER, subject to the Conditions of Approval contained in Appendix B.\nAmend the Subdivision By-law, subject to approval of the CD-1 By-law.\nTHAT Recommendations A and B be adopted on the following conditions:\n(i) The resolutions create no legal rights or obligations.\n(ii) Approval does not obligate the City to enact a rezoning by-law.\n(iii) The City and its officials have full authority and discretion.\nREPORT SUMMARY\nEvaluate an application to rezone properties for the development of a Community Care Facility for seniors. Staff support the application, subject to conditions. Recommend referral to a public hearing.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\nVancouver Plan (2022)\nArbutus Ridge, Kerrisdale and Shaughnessy Community Vision (2005)\nCommunity Care Facility - Class B and Group Residence Guidelines (2008, last amended 2019)\nSecured Market Rental Policy (2012, last amended 2023)\nGreen Buildings Policy for Rezonings (2010, last amended 2023)\nLatecomer Policy (2021)\nCommunity Amenity Contributions Policy for Rezonings (1999, last amended 2023)\nVancouver Development Cost Levy By-law No. 9755\nVancouver Utilities Development Cost Levy By-law No. 12183\nUrban Forest Strategy (2014, amended 2018)\nPublic Art Policy and Procedures for Rezoned Developments (2014, last amended 2021)\nREPORT\nEvaluate an application to rezone properties for the development of a Community Care Facility for seniors. The site is located at the south-east corner of Nanton Avenue and Arbutus Street. The site is currently regulated by the R1-1 District Schedule. The properties to the east are zoned R1-1 and the sites to the north and west are zoned CD-1. Properties along Arbutus Street are eligible for rezoning consideration under the Secured Market Rental Policy. Neighbourhood amenities include parks, cultural/community spaces, and a local shopping area. The Vancouver Plan and Arbutus Ridge, Kerrisdale and Shaughnessy Community Vision support the rezoning.\n- The Guidelines specify locational criteria and design considerations for community care facilities in British Columbia.\n- The SRP encourages the construction of new purpose-built rental housing in Vancouver.\n- Updates to the SRP were approved by Council in December 2021 to streamline the delivery of new rental housing.\n- The SRP includes changes to increase clarity and certainty for rezoning in low-density areas near public transit and daily needs.\n- The SRP also streamlines and simplifies the rezoning process by utilizing new rental zones with standardized regulations.\n- The SRP outlines locational eligibility criteria for sites in low-density areas.\n",
    "maxPages": 4,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:36:15.020Z",
    "updateDate": "2024-02-07T01:36:15.020Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr8.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Susanne Rühle\nContact No.: 604.326.4844\nRTS No.: 16003\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: Rezoning: 688 West 29th Avenue\nRECOMMENDATION TO REFER\nRezone the property at 688 West 29th Avenue from R1-1 District to RM-8A District, subject to conditions.\nPrepare necessary by-law(s) for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nApprove the rezoning application by Paramax Homes, on behalf of Vertical Ventures Inc., for 688 West 29th Avenue in principle.\nApprove the draft zoning amendment by-law prepared for the Public Hearing.\nSubject to the Conditions of Approval contained in Appendix B.\nAmend the Subdivision By-law as set out in Appendix C, subject to approval of the zoning amendment by-law.\nAdopt Recommendations A and B with the specified conditions.\nREPORT SUMMARY\nPropose rezoning of 688 West 29th Avenue from R1-1 District to RM-8A District for townhouse or rowhouse development.\nMaximum floor space ratio (FSR) can be up to 1.20, allowing for approximately eight townhouses.\nMeets the intent of the Cambie Corridor Plan.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\nVancouver Plan (2022)\nCambie Corridor Plan (2018, amended 2023)\nRM-8, RM-8A, RM-8N and RM-8AN Districts Schedule (2018, amended 2023)\nRM-8, RM-8N, RM-8A and RM-8AN Guidelines (2018, amended 2023)\nHousing Needs Report (2022)\nBulletin: Density Bonus Contributions (2014, amended 2023)\nVancouver Development Cost Levy By-Law No. 9755\nVancouver Utilities Development Cost Levy By-Law No. 12183\nLatecomer Policy (2021)\nUrban Forest Strategy (2014)\nREPORT\nBackground/Context\n1. Site and Context\nSubject site at 688 West 29th Avenue is approximately 605.2 sq. m with a frontage of 17.1 m along 29th Avenue.\nSurrounding sites have been rezoned to RM-8A and the BC Women's and Children's Hospital to the west is zoned CD-1.\n2. Policy Context\nVancouver Plan - Approved land use strategy to guide long-term growth of the City.\nCambie Corridor Plan - Guides the transformation of the Corridor into an area for living, working, and more.\nDesign Guidelines - RM-8A/AN Districts Schedule accompanied by clear design guidelines.\nHousing Needs Report - Council must consider the most recent report when developing a development plan.\nStrategic Analysis\nRezoning to RM-8A/AN follows a simplified process.\nStaff review drawings according to the RM-8A/AN design guidelines.\nFuture development will undergo a streamlined rezoning process. An Urban Design Panel review is not necessary for small-scale buildings with comprehensive design guidelines.\n",
    "maxPages": 4,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:35:52.624Z",
    "updateDate": "2024-02-07T01:35:52.624Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr7.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Oskar Eriksson\nContact No.: 604.829.9270\nRTS No.: 16004\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: Rezoning: 692 West 30th Avenue\nRECOMMENDATION TO REFER\nTHAT the rezoning application for 692 West 30th Avenue be referred to Public Hearing with the recommendation to approve the application, subject to conditions.\nFURTHER THAT the Director of Legal Services prepare the necessary by-law(s) for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. THAT the application by Paramax Homes, on behalf of Gurjeet Singh Tiwana, to rezone the land from R1-1 District to RM-8A District, be approved in principle.\nFURTHER THAT the draft zoning amendment by-law be approved in principle.\nAND FURTHER THAT the above approvals be subject to the Conditions of Approval.\nB. THAT, subject to approval of the zoning amendment by-law, the Subdivision By-law be amended as set out in Appendix C.\nFURTHER THAT the Director of Legal Services bring forward the amendment to the Subdivision By-law at the time of enactment of the zoning amendment by-law.\nRezoning: 692 West 30th Avenue - RTS 16004\nC. THAT Recommendations A and B be adopted on the following conditions:\n(i) THAT the passage of the above resolutions creates no legal rights or obligations for the applicant or the City.\n(ii) THAT any approval following the public hearing does not obligate the City to enact a rezoning by-law and any costs incurred are at the risk of the property owner.\n(iii) THAT the City and its officials retain full authority and discretion in the exercise of their duties.\nREPORT SUMMARY\nThis report recommends rezoning 692 West 30th Avenue from R1-1 District to RM-8A District to allow for a townhouse or rowhouse development. The application meets the requirements of the Cambie Corridor Plan and staff recommend referring it to a Public Hearing with the recommendation to approve it in principle, subject to conditions.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n- Vancouver Plan (2022)\n- Cambie Corridor Plan (2018, amended 2023)\n- RM-8, RM-8A, RM-8N and RM-8AN Districts Schedule (2018, amended 2023)\n- RM-8, RM-8N, RM-8A and RM-8AN Guidelines (2018, amended 2023)\n- Housing Needs Report (2022)\n- Bulletin: Density Bonus Contributions (2014, amended 2023)\n- Vancouver Development Cost Levy By-Law No. 9755\n- Vancouver Utilities Development Cost Levy By-law No. 12183\n- Latecomer Policy (2021)\n- Urban Forest Strategy (2014)\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site at 692 West 30th Avenue is a single parcel located on the southeast corner of West 30th Avenue and Heather Street. The site area is approximately 746.2 sq. m (8,032 sq. ft.) with a frontage of 17.1 m (56 ft.) along 30th Avenue.\n2. Policy Context\nThe Vancouver Plan and Cambie Corridor Plan guide the growth and development of the area. The proposed rezoning aligns with the plans and allows for townhouse or rowhouse development.\nStrategic Analysis\n1. Simplified Rezoning Process\nRezoning to RM-8A follows a simplified process. Architectural drawings are not required at this stage, and the review is limited to a plan amendment to the Zoning and Development By-law.\nNote: The document continues with additional information and analysis.\nThe development permit process streamlines rezoning. No Urban Design Panel review required for small scale buildings with comprehensive design guidelines.\n",
    "maxPages": 4,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:35:35.423Z",
    "updateDate": "2024-02-07T01:35:35.423Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr6.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Bryan Wong\nContact No.: 604.707.5420\nRTS No.: 16005\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 8120-8168 Lord Street and 540 West 65th Avenue\nRECOMMENDATION TO REFER\nThe rezoning application and plans for 8120-8168 Lord Street and 540 West 65th Avenue should be referred to Public Hearing. The General Manager of Planning, Urban Design and Sustainability recommends approving the application, subject to conditions. The Director of Legal Services should prepare the necessary by-laws for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. The application by Francl Architecture Inc. on behalf of Lord Street Holdings Ltd. to rezone the lands from R1-1 District to CD-1 District should be approved in principle. The maximum floor space ratio (FSR) should be increased from 0.70 to 2.88 and the maximum building height should be increased from 11.5 m to 20.7 m. The development will consist of two six-storey residential buildings with 146 secured-rental units, including five below-market rental units. The draft CD-1 By-law and proposed form of development should be approved in principle.\nB. The Director of Legal Services should prepare the necessary Housing Agreement By-law for enactment prior to the CD-1 By-law, subject to approval in principle of the rezoning and the Housing Agreement.\nC. The Subdivision By-law should be amended, as set out in Appendix C, subject to approval of the CD-1 By-law. The Director of Legal Services should bring forward the amendment to the Subdivision By-law at the time of enactment of the CD-1 By-law.\nD. Recommendations A to C should be adopted with the specified conditions.\nREPORT SUMMARY\nAn application to rezone 8120-8168 Lord Street and 540 West 65th Avenue to a CD-1 District for two six-storey residential buildings with 146 secured-market rental units, including five below-market rental units, meets the intent of the Cambie Corridor Plan. Staff recommend referring the application to Public Hearing with the recommendation to approve it in principle, subject to conditions.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\nVarious plans, strategies, policies, and by-laws have been considered in the evaluation of this application.\nREPORT\nBackground/Context\n1. Site and Context\nThe subject site is located at the southeast corner of Lord Street and West 65th Avenue. It consists of a six-lot assembly with six single-detached houses. The total site area is 3,080.0 sq. m. The Tenant Relocation and Protection Policy applies to the application.\n2. Policy Context\nThe Vancouver Plan, Cambie Corridor Plan, Cambie Corridor Public Realm Plan, Marpole Community Plan, Housing Needs Report, Housing Vancouver Strategy, and various other policies and by-laws are relevant to this application.\nThe City approved a Plan for the next 30 years, which will be implemented over the next two to four years. The site is located within the Cambie Corridor Plan area, which is aligned with the Vancouver Plan. The Cambie Corridor Plan allows for rezoning for a residential building up to six storeys with a floor space ratio (FSR) up to 2.5. An additional partial floor is permitted for common amenity space. \n\nOn April 27, 2022, Council received a Housing Needs Report (HNR) prepared by staff. The Council must consider the most recent HNR when developing or amending a development plan related to affordable housing, rental housing, and special needs housing. The proposed zoning amendment would facilitate the delivery of secured rental housing, including below-market rental units, and address the data and findings within the HNR.\n\nThe rezoning proposal is for two six-storey residential buildings with 146 secured-market units.\n",
    "maxPages": 4,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:35:09.148Z",
    "updateDate": "2024-02-07T01:35:09.148Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr5.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Allison Smith, 604.873.7583\nRTS No.: 16006\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 1710-1730 East Pender Street\nRECOMMENDATION TO REFER\n- Rezone the lands from RM-4 and RM-4N District to CD-1 District\n- Increase maximum floor space ratio from 1.45 to 5.58\n- Increase maximum building height from 10.7m to 60.8m\n- Develop an 18-storey social housing mixed-use building with 191 units\n- Approve the application subject to conditions\nRECOMMENDATION FOR PUBLIC HEARING\n- Approve the application in principle\n- Approve the draft CD-1 by-law\n- Approve the proposed form of development\n- Subject to approval of rezoning and Housing Agreement, prepare necessary by-laws\n- Approve amendment to Sign By-law and Noise Control By-law\nREPORT SUMMARY\n- Evaluate application to rezone 1710-1730 East Pender Street to CD-1 District\n- Application proposes 18-storey mixed-use building with 191 social housing units\n- Staff recommends referral to Public Hearing with approval subject to conditions\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n- Vancouver Plan (2022)\n- Grandview-Woodland Community Plan (2016)\n- Housing Needs Report (2022)\n- Housing Vancouver Strategy (2017)\n- City of Reconciliation (2016)\n- Equity Framework (2021)\n- City of Vancouver's UNDRIP Strategy (2022)\n- Tenant Relocation and Protection Policy (2019)\n- Making Space for Arts and Culture (2019)\n- Community Amenity Contributions Policy for Rezonings (1999, last amended 2023)\n- Green Buildings Policy for Rezonings (2010, last amended 2023)\n- Vancouver Development Cost Levy By-law No. 9755\n- Vancouver Utilities Development Cost Levy By-law No. 12183\n- Urban Forest Strategy (2018)\n- Latecomer Policy (2021)\nBACKGROUND/CONTEXT\n- Subject site is comprised of three lots and a segment of City road\n- Located in Grandview-Woodland neighbourhood\n- Proposed rezoning meets goals of Grandview-Woodland Community Plan and Vancouver Plan\n- Staff recommends referral to Public Hearing with approval subject to conditions\nThe site slopes downwards towards the Commercial Drive frontage. Figure 1 shows the location map.\n",
    "maxPages": 4,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:34:46.180Z",
    "updateDate": "2024-02-07T01:34:46.180Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr4.pdf",
    "text": "Referral Report\n- Date: October 31, 2023\n- Contact: Casey Peters, Contact No.: 604.871.6356\n- RTS No.: 16009\n- VanRIMS No.: 08-2000-20\n- Meeting Date: November 14, 2023\n- TO: Vancouver City Council\n- FROM: General Manager of Planning, Urban Design and Sustainability\n- SUBJECT: Rezoning: 6470 Larch Street\n- RECOMMENDATION TO REFER: Refer the rezoning application to Public Hearing with the recommendation to approve the application, subject to conditions.\n- RECOMMENDATION FOR PUBLIC HEARING:\n  A. Approve the rezoning application in principle and approve the draft zoning amendment by-law.\n  B. Instruct the Director of Legal Services to prepare the necessary Housing Agreement By-law.\n  C. Amend the Subdivision By-law.\n  D. Adopt Recommendations A to C with specified conditions.\n- REPORT SUMMARY: Recommends rezoning the site at 6470 Larch Street to RR-2B District for a five-storey rental building with 33 secured rental units.\n- COUNCIL AUTHORITY/PREVIOUS DECISIONS: Lists various policies and by-laws related to housing and development.\n- BACKGROUND/CONTEXT:\n  1. Site and Context: Describes the location and zoning of the subject site.\n  2. Policy Context: Mentions the Vancouver Plan, Secured Rental Policy, RR Zoning District Schedules, and other relevant policies.\n- The Residential Rental Districts Schedules Design Guidelines provide direction on the form of development expectations under each of the RR zones.\n- The guidelines support new missing middle buildings that foster neighbourliness and social connection, and contribute to an evolving streetscape with more architectural variety and diversity of housing options.\n- The Housing Vancouver Strategy, approved in November 2017, aims to shift the supply of new homes towards the right supply, with targets for new units along a continuum of housing types.\n- The strategy's core goals include retaining diversity of incomes and households, shifting housing production towards rental, and coordinating action with government and non-profit partners to deliver housing for the lowest income households.\n- The strategy targets 72,000 new homes over a 10-year period, including 12,000 social, supportive, and non-profit co-operative units, and 20,000 purpose-built rental units.\n- Nearly 50% of the new units are intended for households earning less than $80,000 per year, and 40% are family-size units.\n",
    "maxPages": 4,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:34:29.790Z",
    "updateDate": "2024-02-07T01:34:29.790Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr3.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Simon Jay\nContact No.: 604.829.2004\nRTS No.: 16012\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: Rezoning: 2231-2247 East 41st Avenue\n\nRECOMMENDATION TO REFER:\n- Refer the rezoning application to Public Hearing with the recommendation to approve the application, subject to conditions.\n- Instruct the Director of Legal Services to prepare the necessary by-law(s) for consideration at the Public Hearing.\n\nRECOMMENDATION FOR PUBLIC HEARING:\nA. Approve the rezoning application in principle.\n- Approve the draft zoning amendment by-law.\n- Subject to the Conditions of Approval in Appendix B.\n\nB. Instruct the Director of Legal Services to prepare the necessary Housing Agreement By-law.\n- Subject to approval in principle of the rezoning and the Housing Agreement described in Appendix B.\n\nC. Amend the Subdivision By-law as set out in Appendix C.\n- Instruct the Director of Legal Services to bring forward the amendment to the Subdivision By-law.\n\nD. Adopt Recommendations A to C with the following conditions:\n(i) The resolutions create no legal rights or obligations for the applicant or the City.\n(ii) Approval following the public hearing does not obligate the City to enact a rezoning by-law.\n(iii) The City and its officials have full authority and discretion.\n\nREPORT SUMMARY:\n- Recommends rezoning the site at 2231-2247 East 41st Avenue to RR-2B District for a five-storey rental building.\n- Estimated 61 secured rental units.\n- Staff recommend referring the application to a Public Hearing with the recommendation to approve it in principle.\n\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS:\n- Relevant Council policies include Vancouver Plan, Secured Rental Policy, RR-2B District Schedule, and more.\n\nREPORT:\nBackground/Context:\n1. Site and Context:\n- The subject site consists of four legal parcels on West 41st Avenue.\n- Currently zoned R1-1 and developed with four single-detached homes.\n- Surrounding area zoned for residential.\n\n2. Policy Context:\n- Vancouver Plan approved in 2022.\n- Secured Rental Policy encourages new rental housing.\n- The proposal aligns with Housing Vancouver Strategy.\n\nNote: The document contains additional information that has been omitted for the sake of brevity.\nIn December 2021, the SRP approved new residential rental (\"RR\") zoning districts: \"RR-1\", \"RR-2A, RR-2B and RR-2C\", and \"RR-3A and RR-3B\". These zones have regulations for use, density, and height limits, and allow for various building designs. All residential uses in the RR zones are for rental tenure only, and no individual unit sales or stratification are allowed. The Residential Rental Districts Schedules Design Guidelines provide further details on development expectations for each RR zone, with the aim of enabling incremental change in neighborhoods that currently have mostly detached houses and duplexes.\n",
    "maxPages": 4,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:34:14.348Z",
    "updateDate": "2024-02-07T01:34:14.348Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/rr2.pdf",
    "text": "REFERRAL REPORT\nReport Date: October 31, 2023\nContact: Sarah Cranston\nContact No.: 604-873-7733\nRTS No.: 15960\nVanRIMS No.: 08-2000-20\nMeeting Date: November 14, 2023\nTO: Vancouver City Council\nFROM: General Manager of Planning, Urban Design and Sustainability\nSUBJECT: CD-1 Rezoning: 4711-4787 Cambie Street\nRECOMMENDATION TO REFER\nThe rezoning application and plans for 4711-4787 Cambie Street should be referred to Public Hearing. The General Manager of Planning, Urban Design and Sustainability recommends approving the application, subject to conditions. The Director of Legal Services should prepare the necessary by-laws for consideration at the Public Hearing.\nRECOMMENDATION FOR PUBLIC HEARING\nA. The application by Mosaic Homes, on behalf of Mosaic Flora and Fauna Holdings Ltd., to rezone 4711-4787 Cambie Street from R1-1 District to CD-1 District should be approved in principle. The permitted floor space ratio (FSR) should be increased from 0.70 to 2.65 and the maximum building height should be increased from 11.5 m to 23.6 m. This will allow for the development of two six-storey residential buildings with 114 strata-titled units. The draft CD-1 By-law and proposed form of development should also be approved in principle.\nB. The Subdivision By-law should be amended, subject to the approval of the CD-1 By-law. The Director of Legal Services should bring forward the amendment at the time of enactment of the CD-1 By-law.\nC. Recommendations A and B should be adopted with the following conditions: (i) the resolutions do not create legal rights or obligations for the applicant or the City, (ii) approval at the Public Hearing does not obligate the City to rezone the property, and (iii) the City and its officials have full authority and discretion in exercising their powers.\nREPORT SUMMARY\nThe application to rezone 4711-4787 Cambie Street to CD-1 District is consistent with the Cambie Corridor Plan. The proposal is for two six-storey residential buildings with a building height of 23.6 m and a floor space ratio of 2.65. Staff recommend referring the application to Public Hearing with the recommendation to approve it in principle, subject to conditions.\nCOUNCIL AUTHORITY/PREVIOUS DECISIONS\n- Vancouver Plan (2022)\n- Cambie Corridor Plan and Cambie Corridor Public Realm Plan (2018)\n- Housing Needs Report (2022)\n- Family Room: Housing Mix Policy for Rezoning Projects (2016)\n- High-Density Housing for Families with Children Guidelines (1992, last amended 2020)\n- Green Buildings Policy for Rezonings (2010, last amended 2023)\n- Tenant Relocation and Protection Policy (2015, last amended 2019)\n- Urban Forest Strategy (2018)\n- Community Amenity Contributions Policy for Rezonings (1999, last amended 2023)\n- Development Cost Levy By-law No. 9755\n- Utilities Development Cost Levy By-law No. 12183\n- Latecomer Policy (2021)\nREPORT\nBackground/Context\n1. Site and Context\nThe site is located along Cambie Street between West 31st and 32nd Avenues. It consists of four lots with four single-detached houses. The proposed development is consistent with the Cambie Corridor Plan and the surrounding area is undergoing significant change.\n2. Policy Context\nThe rezoning application aligns with the Vancouver Plan, Cambie Corridor Plan, and Housing Needs Report. The site is within the 'Queen Elizabeth' neighbourhood of the Cambie Corridor Plan, which allows for residential buildings up to six storeys with a suggested FSR range of 1.75 to 2.25.\nNeighbourhood amenities and local school capacity are also considered in the report.\n\n- Two six-storey residential buildings with a total of 114 strata-titled units are proposed.\n- The total FSR is 2.65 and the building height is 23.6 m (77. ft.).\n- Two levels of underground parking are accessed from the lane.\n",
    "maxPages": 4,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:33:54.206Z",
    "updateDate": "2024-02-07T01:33:54.206Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/phea4SR.PDF",
    "text": "Summary:\nTo rezone 3231-3245 Fraser Street and 675 East 17th Avenue from C-2 (Commercial) District to CD-1 (Comprehensive Development) District, to permit the development of a 14-storey mixed-use building with a partial 15th floor rooftop amenity area, with commercial at-grade and 110 secured rental housing units, of which 20% of the residential floor area will be secured as moderate income units, over three levels of underground parking. A floor space ratio of 6.9 and a maximum building height of 45.5 m (149 ft.) with additional height to 47.5 m (156 ft.) for a partial 15th floor rooftop amenity area are proposed.\n\nApplicant:\nAnthem Fraser Developments LP\n\nRecommended Approval:\nBy the General Manager of Planning, Urban Design and Sustainability, subject to the following conditions as proposed for adoption by resolution of Council:\n\nA. Application by Anthem Fraser Developments LP, on behalf of Anthem Fraser Developments Ltd. and Mercer Properties (Fraser 17) Inc., to rezone the properties from C-2 (Commercial) District to CD-1 (Comprehensive Development) District to increase the maximum floor space ratio (FSR) from 3.5 to 6.9 and the maximum building height from 22.0 m (72 ft.) to 45.5 m (149.3 ft.) to permit the development of a 14-storey mixed-use building, and a maximum of 47.5 m (155.8 ft.) to accommodate a partial 15th floor rooftop amenity area, containing 110 secured rental housing units, of which 20% of the residential floor area will be secured as moderate income units, with commercial space on the ground floor generally as presented in the Report, be approved in principle.\n\nB. Subject to approval in principle of the rezoning and the Housing Agreement described in Part 2 of Appendix B of the report, the Director of Legal Services be instructed to prepare the necessary Housing Agreement By-law for enactment prior to enactment of the CD-1 By-law, subject to such terms and conditions as may be required at the discretion of the Director of Legal Services, and the General Manager of Planning, Urban Design and Sustainability.\n\nC. Subject to approval of the CD-1 By-law, the application to amend the Sign By-law to establish regulations for the new CD-1, generally as set out in Appendix C of the report, be approved.\n\nD. Subject to approval of the CD-1 By-law, the Noise Control By-law be amended to include the CD-1, generally as set out in Appendix C of the report; further, the Director of Legal Services be instructed to bring forward the amendment to the Noise Control By-law at the time of enactment of the CD-1 By-law.\n\nE. Recommendations A through D be adopted on the following conditions: (i) passage of the above resolutions creates no legal rights for the applicant or any other person, or obligation on the part of the City; and any expenditure of funds or incurring of costs is at the risk of the person making the expenditure or incurring the cost; (ii) any approval that may be granted following the Public Hearing shall not obligate the City to enact a by-law rezoning the property, and any costs incurred in fulfilling requirements imposed as a condition of rezoning are at the risk of the property owner; and (iii) the City and all its officials, including the Approving Officer, shall not in any way be limited or directed in the exercise of their authority or discretion, regardless of when they are called upon to exercise such authority or discretion.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:33:27.578Z",
    "updateDate": "2024-02-07T01:33:27.578Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/phea3SR.PDF",
    "text": "Page 1 of 2\nPUBLIC HEARING\nNovember 14, 2023\nSUMMARY AND RECOMMENDATION\n- Rezone 430-440 West Pender Street from DD District to CD-1 District\n- Permit development of a 12-storey mixed-use building with a partial 13th floor rooftop amenity area, commercial at-grade, and 80 secured market rental housing units\n- Proposed floor space ratio (FSR) of 8.42 and maximum building height of 32.0 m (105 ft.), with additional height to 35.1 m (115 ft.) for rooftop common amenity space\n- Applicant: Architectural Collective Inc.\n- Referral: Report titled \"CD-1 Rezoning: 430-440 West Pender Street\", dated October 3, 2023\n- Recommended approval by the General Manager of Planning, Urban Design and Sustainability, subject to conditions\n- Conditions include approval of rezoning, draft CD-1 By-law, proposed form of development, and inclusion of heritage building in Vancouver Heritage Register\n- Approval of amendments to Sign By-law and Noise Control By-law\n- Passage of resolutions does not create legal rights or obligations for the applicant or the City\n- Approval following Public Hearing does not obligate the City to enact a rezoning by-law, and costs incurred are at the risk of the property owner\n- City officials have authority and discretion in exercising their roles regardless of when called upon to do so.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:33:04.243Z",
    "updateDate": "2024-02-07T01:33:04.243Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/phea2SR.PDF",
    "text": "Page 1 of 2\nPUBLIC HEARING\nNovember 14, 2023\nSUMMARY AND RECOMMENDATION\n- CD-1 Rezoning: 1510 West 71st Avenue and 8733 Granville Street\n- Rezone the properties from C-2 (Commercial) District and RM-3A (Residential) District to CD-1 (Comprehensive Development) District\n- Permit the development of a six-storey mixed-use building with commercial space at-grade and 74 secured market rental units\n- Proposed height of 22.0 m (72 ft.) and a floor space ratio (FSR) of 3.38\n- Applicant: Gradual Architecture Inc\n- Referral: Report titled \"CD-1 Rezoning: 1510 West 71st Avenue and 8733 Granville Street\", dated October 3, 2023\n- Recommended Approval by the General Manager of Planning, Urban Design and Sustainability, subject to conditions\n- Conditions include approval of the application, approval of the draft CD-1 By-law, approval of the proposed form of development, and approval of amendments to the Sign By-law and Noise Control By-law\n- Approval of rezoning and Housing Agreement subject to preparation of necessary by-laws\n- Recommendations A to D to be adopted with specified conditions\n- Passage of resolutions creates no legal rights or obligations for the applicant or the City\n- Approval following the Public Hearing does not obligate the City to enact a rezoning by-law, and any costs incurred are at the risk of the property owner\n- City officials retain authority and discretion in the exercise of their duties\n[CD-1 Rezoning: 1510 West 71st Avenue and 8733 Granville Street]\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:32:52.051Z",
    "updateDate": "2024-02-07T01:32:52.051Z"
  },
  {
    "url": "https://council.vancouver.ca/20231114/documents/phea1SR.PDF",
    "text": "Summary and Recommendation:\nArdor Development Ltd. is requesting to rezone 5515-5525 Elizabeth Street from Residential to Comprehensive Development District. This would allow for the construction of a four-storey residential building with a partial 5th floor rooftop amenity area, containing 27 strata-titled residential units. The proposed floor space ratio is 2.0 and the maximum building height is 13.7 m (45 ft.), with additional height for the rooftop amenity and mechanical appurtenances. The General Manager of Planning, Urban Design and Sustainability recommends approval of the rezoning application, subject to certain conditions. The draft CD-1 By-law and the proposed form of development are also recommended for approval. The approval is subject to the Conditions of Approval contained in the report. Additionally, the Subdivision By-law would be amended if the CD-1 By-law is approved. The passage of the resolutions does not create legal rights or obligations for the applicant or the City. The approval of the rezoning does not obligate the City to enact a by-law rezoning the property. The exercise of authority and discretion by the City and its officials is not limited or directed by the resolutions.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:32:37.148Z",
    "updateDate": "2024-02-07T01:32:37.148Z"
  },
  {
    "url": "https://council.vancouver.ca/20231116/documents/phea2sr.pdf",
    "text": "Page 1 of 2:\n- Public Hearing on November 16, 2023\n- Summary and Recommendation for rezoning of 6065-6075 Collingwood Place from R1-1 District to RR-2B District\n- Applicant: Strand Holdings Ltd.\n- Referral to Public Hearing at Council Meeting on October 17, 2023\n- Recommended Approval by General Manager of Planning, Urban Design and Sustainability, with conditions\n\nPage 2 of 2:\n- Approval of rezoning and draft zoning amendment by-law recommended\n- Director of Legal Services instructed to prepare necessary Housing Agreement By-law\n- Subdivision By-law to be amended\n- Adoption of Recommendations A to C with specified conditions\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:32:25.237Z",
    "updateDate": "2024-02-07T01:32:25.237Z"
  },
  {
    "url": "https://council.vancouver.ca/20231116/documents/phea1sr.pdf",
    "text": "Page 1 of 2\nPUBLIC HEARING\nNovember 16, 2023\nSUMMARY AND RECOMMENDATION\n- Rezone 3529-3589 Arbutus Street and 2106 West 19th Avenue from R1-1 (Residential) District to RR-2B (Residential Rental) District for a five-storey rental building with a height of 16.8 m (55 ft.) and a floor space ratio (FSR) of 2.40.\n- Applicant: Andrew Cheung Architects, Inc.\n- Referral: Report titled \"Rezoning: 3529-3589 Arbutus Street and 2106 West 19th Avenue\" dated October 3, 2023, referred to Public Hearing on October 17, 2023.\n- Recommended Approval: By the General Manager of Planning, Urban Design and Sustainability, subject to conditions outlined in the report.\n- Conditions of Approval: Refer to Appendix B of the Report.\n- Subject to approval, the Director of Legal Services will prepare the necessary Housing Agreement By-law.\n- Subdivision By-law to be amended as outlined in Appendix C of the Report.\n- Passage of resolutions creates no legal rights or obligations for the applicant or the City.\n- Approval following the Public Hearing does not obligate the City to enact a rezoning by-law, and any costs incurred are at the risk of the property owner.\n- City officials have full authority and discretion in exercising their duties.\n[Rezoning: 3529-3589 Arbutus Street & 2106 West 19th Avenue]\n\nPage 2 of 2\n- Recommendations A to C to be adopted with the specified conditions.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T01:32:13.347Z",
    "updateDate": "2024-02-07T01:32:13.347Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1029470974.pdf",
    "text": "City of Richmond Zoning Bylaw 8500 is amended at Section 10.7 [Vehicle Sales (CV)] by adding additional uses, including \"Veterinary service.\" A veterinary service is permitted at 13340 Smallwood Place and is limited to one per site. The veterinary service may include animal adoption services for cats and kittens only. The total floor area of the veterinary service cannot exceed the total floor area of all other permitted uses on the site. This amendment is cited as \"Richmond Zoning Bylaw 8500, Amendment Bylaw 10294.\" The bylaw has been approved and adopted.\n",
    "maxPages": 2,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T00:18:18.123Z",
    "updateDate": "2024-02-07T00:18:18.123Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/3_-_Application_by_Gurjit_Pooni_for_Rezoning_at_10511_Lassam_Road70932.pdf",
    "text": "Report to Committee: Planning Committee\nDate: November 6, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 22-011080\nRe: Application by Gurjit Pooni for Rezoning at 10511 Lassam Road from the \"Single Detached RS1/E\" Zone to the \"Single Detached (RS2/B)\" Zone\n\nStaff Recommendation: Richmond Zoning Bylaw 8500, Amendment Bylaw 10513, for the rezoning of 10511 Lassam Road from the \"Single Detached (RS1/E)\" zone to the \"Single Detached (RS2/B)\" zone, be introduced and given first reading.\n\nREPORT CONCURRENCE: Affordable Housing; CONCURRENCE OF GENERAL MANAGER\n\nStaff Report:\nOnyx Premier Homes Ltd. has applied to rezone 10511 Lassam Road from the \"Single Detached (RS1/E)\" zone to the \"Single Detached (RS2/B)\" zone. The purpose is to create two single-family lots with access from Lassam Road.\n\nFindings of Fact:\n- There is an existing vacant single-family dwelling on the subject property that will be demolished.\n- There are no existing secondary suites in the dwelling.\n- Surrounding development includes a school to the north, a single-family dwelling to the south, and single-family dwellings to the east.\n- The proposed rezoning and subdivision are consistent with the Official Community Plan and Steveston Area Plan.\n- The proposed lots comply with the Lot Size Policy.\n- The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204.\n- Public consultation has been conducted, but no comments have been received.\n\nAnalysis:\nThe proposed redevelopment will rezone and subdivide the existing single-family lot into two new single-family lots with access from Lassam Road. The rezoning and subdivision align with the lot fabric and vehicular access along Lassam Road.\n\nExisting Legal Encumbrances:\nThere is an existing 3 m wide Statutory Right-of-Way (SRW) for City sanitary service on a small portion of the property. No building encroachment into the SRW is permitted.\n\nTransportation and Site Access:\nVehicular access to the proposed lots will be from Lassam Road.\n\nNote: The document has been shortened and formatted for easy reading. Original information has been retained.\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-07T00:18:05.790Z",
    "updateDate": "2024-02-07T00:18:05.790Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/2_-_Application_by_Navreet_Gill_for_Rezoning_at_11831_11833_Seabrook70931.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: October 23, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 22-010976\nRe: Application by Navreet Gill for Rezoning at 11831/11833 Seabrook Crescent from the \"Single Detached (RS1/E)\" Zone to the \"Single Detached (RS2/B)\" Zone\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10510, for the rezoning of 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone, be introduced and given first reading.\nfor Wayne Craig, Director, Development (604-247-4625) WC:le Att. 6\nREPORT CONCURRENCE\nR OUTED TO: CONCURRENCE OF GENERAL MANAGER City of Richmond\nAffordable Housing\n\nCONCURRENCE\nPH - 37\nOctober 23, 2023\n- 2 -\nRZ 22-010976\n7409688\nStaff Report\nOrigin\nNavreet Gill has applied on behalf of the property owners, 1303287 B.C. Ltd. (Balraj Singh Sanghera and Rajbir Kaur Chatha), to rezone 11831/11833 Seabrook Crescent from the “Single Detached (RS1/E)” zone to the “Single Detached (RS2/B)” zone in order to permit the property to be subdivided into two single-family lots, each with vehicle access from Seabrook Crescent. A location map and aerial photo are provided in Attachment 1. The proposed subdivision plan and draft site plan are provided in Attachment 2.\nFindings of Fact\nA Development Application Data Sheet providing details about the development proposal is attached (Attachment 3).\nSubject Site Existing Housing Profile\nThe subject site contains an existing un-stratified non-conforming duplex (two-unit dwelling), which will be demolished prior to subdivision. Both dwelling units are currently tenant occupied and do not contain any secondary suites. The applicant has indicated that the tenants are aware of the redevelopment proposal and the applicant will ensure compliance with the Residential Tenancy Act.\nSurrounding Development\nDevelopment immediately surrounding the site is as follows:\nTo the North: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the South: A single-family houses on a lot zoned “Single Detached (RS1/E)”.\nTo the East: Across the lane, an existing duplex on a lot zoned “Single Detached (RS1/E)” fronting onto No. 5 Road. There is a Rezoning application and Development Permit (RZ 22-019002/DP 23-028942) at 10111/10113 No. 5 Road to permit the development of three front-back duplex lots. The rezoning application received third reading on October 16, 2023.\nTo the West: Across Seabrook Crescent, an existing duplex on a lot zoned “Single Detached (RS1/E)”.\nRelated Policies & Studies\nOfficial Community Plan\nThe subject site is designated as “Neighbourhood Residential” in the Official Community Plan (OCP). This proposal is consistent with this OCP designation.\nPH - 38\nOctober 23, 2023\n- 3 -\nRZ 22-010976\n7409688\nSingle-Family Lot Size Policy 5434/ Zoning Bylaw 8500\nThe subject property is located within the area covered by Lot Size Policy 5434, adopted by City Council in 1990, amended in 1991 and 2006 (Attachment 4). The Policy permits a majority of lots within the Policy Area (including the subject property) to be rezoned and subdivided in accordance with the provisions of the “Single Detached (RS1/E)” zone.\nThe subject site is currently occupied by a legal duplex. Section 2.3.7 of Richmond Zoning Bylaw 8500 provides that the Lot Size Policy does not apply to a rezoning that a legal duplex and which are intended to be subdivided into no more than two single-family lots. The proposed rezoning and subdivision complies with Section 2.3.7 and would result in the creation of two single-family lots being 444.9 m2 and 450.2 m2 in area. Further, the proposed rezoning and subdivision would comply with the minimum lot dimensions and size applicable to the “Single Detached (RS2B)” zone.\nMinistry of Transportation & Infrastructure Approval\nAs the subject site is located within 800 m of an intersection of a Provincial Limited Access Highway and a City road, this redevelopment proposal was referred to the Ministry of Transportation and Infrastructure (MOTI) for review and comment. Preliminary confirmation has been received from MOTI indicating that they have no objections to the proposed redevelopment. Final approval from MOTI is required prior to final adoption of the rezoning bylaw.\nFloodplain Management Implementation Strategy\nThe proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204. Registration of a flood indemnity covenant on Title is required prior to final adoption of the rezoning bylaw.\nPublic Consultation\nA rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\nShould the Planning Committee endorse this application and Council grant first reading to the rezoning bylaw, the bylaw will be forwarded to a Public Hearing, where any area resident or interested party will have an opportunity to comment.\nPublic notification for the Public Hearing will be provided as per the Local Government Act and the City’s Zoning Bylaw 8500.\nPH - 39\n",
    "maxPages": 3,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-06T23:34:50.681Z",
    "updateDate": "2024-02-06T23:34:50.681Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/Bylaw_1052070970.pdf",
    "text": "City of Richmond Bylaw City City's Website Public Notice Bylaw No. 10520\n\nPART ONE: CITATION\nThis Bylaw is cited as \"Public Notice Bylaw No. 10520\".\n\nPART TWO: INTERPRETATION\nIn this bylaw:\n- City's Facebook Page 7470151 Bylaw 10520 means this bylaw.\n- \"City of Richmond\" means the City of Richmond.\n- \"City's Website\" means the official website of the City of Richmond, www.richmond.ca.\n\nPART THREE: INTERPRETATION\n- \"City's Facebook Page\" means the official Facebook page of the City of Richmond, www.facebook.com/cityofrichmondbe.\n- Any notice required to be given or published in accordance with section 94 of the Community Charter must be published electronically on the City's Website and the City's Facebook Page.\n\nPART FOUR: SEVERABILITY\nIf any part, section, sub-section, clause, or sub-clause of this Bylaw is held to be invalid by a Court of competent jurisdiction, such decision does not affect the validity of the remaining portions of this bylaw.\n\nFIRST READING\nSECOND READING\nTHIRD READING\nADOPTED\nMAYOR CNCL-40 (Special)\nPage 2\nDEC 11 2023\nCORPORATE OFFICER\nCITY OF RICHMOND\nAPPROVED for content by originaling depe\nAPPROVED for legality by Solicitor ACI\n",
    "maxPages": 2,
    "pages": [],
    "type": "image",
    "createDate": "2024-02-06T23:34:26.029Z",
    "updateDate": "2024-02-06T23:34:26.029Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1_dpp_ketcheson_road69357.pdf",
    "text": "To: City of Richmond\nFrom: Wayne Craig, Director of Development\nRe: Development Permit Panel\nAtt. 3\n\nStaff Recommendation:\nIssue a Development Permit for the construction of 178 residential units in a 14-storey high-rise multi-family apartment building at 3588 Ketcheson Road. The site is zoned \"Residential / Limited Commercial (ZMU47)-Capstan Village (City Centre)\".\n\nDate: August 2, 2023\nFile: DP 22-017484\nApplication by Polygon Talisman Park Ltd. for a Development Permit at 3588 Ketcheson Road\n",
    "maxPages": 5,
    "pages": [
      0
    ],
    "type": "image",
    "createDate": "2024-02-06T23:33:41.656Z",
    "updateDate": "2024-02-06T23:33:41.656Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72014",
    "text": "Meeting: November 20, 2023\nFile: 49500 20 REZ #20-17\nCouncil Report\nTo: Mayor & Council\nFrom: General Manager Planning and Development\nSubject: Revised REZ #20-17 - A Portion of 6229 Marine Drive - Non-Market Housing Development - Edmonds Town Centre Plan\nPurpose: Provide project funding update and seek Council authorization to forward REZ #20-17 to a future Public Hearing, repeal previous in-stream bylaw, and advance new proposed bylaw to second reading and future public hearing.\nReferences:\n- Address: A portion of 6229 Marine Drive\n- Legal: Portion of Lot A, DLs 155A and 171, Group 1 NWD Plan EPP122272\n- Applicant: Mania Hormozi, CLT 0012 Community Society, 220-1651 Commercial Drive, Vancouver, BC, V5L 3Y3\n- Current Zoning: CD Comprehensive Development District (based on the RM3r Multiple Family Residential District, and in accordance with the development guidelines prepared by the City under Rezoning Reference #19-59)\n- Proposed Zoning: Amended CD Comprehensive Development District (based on the RM2 Multiple Family Residential District and RM2r Multiple Family Residential District, the Edmonds Town Centre Plan as guidelines, and in accordance with the revised development guidelines provided in Appendix A of the Rezoning Bylaw)\nRecommendations:\n1. Repeal and abandon Burnaby Zoning Bylaw 1965, Amendment Bylaw No. 50, 2020 (Bylaw No. 14250) contingent upon granting of Second Reading of new Rezoning Bylaw for REZ #20-17.\n2. Amend Burnaby Zoning Bylaw 1965, Amendment Bylaw No. 35, 2023 (Bylaw No. 14613) in accordance with Section 3.0 and Attachment 2 of the report and advance to Second Reading and future Public Hearing.\n3. Authorize necessary Statutory Rights of Way over the subject site for third-party utility providers.\n4. Send a copy of the report to BC Housing.\n5. Establish prerequisites to completion of rezoning: submission of a suitable plan of development, completion of a Subdivision Plan, and granting of necessary Section 219 Covenants and Statutory Rights of Way.\nChief Administrative Officer's Comments: Concurs with the recommendation of the General Manager Planning and Development.\nExecutive Summary: Proposed rezoning bylaw amendment aims to establish development guidelines for non-market housing on the subject site.\nPolicy Section: Proposed rezoning application is consistent with various policies and plans adopted by Council.\nBackground:\n- Subject site measures approximately 0.81 hectares and is located within Sub-Area 3 of the Edmonds Town Centre Plan.\n- Subject site, together with a larger site to the southwest, forms the \"Bevan Lands\" development site.\n- Council advanced a program in 2019 for non-market housing development on City-owned sites, including the subject site (REZ# 19-59).\n- Public Hearing report for the subject site (REZ# 20-17) submitted in 2020 outlined detailed development for non-market co-operative buildings.\n- CLT was not successful in obtaining BC Housing's Community Housing Fund at that time.\n- BC Housing announced funding for the subject site in 2023.\n- Council referred a report back to staff to explore opportunities for additional density and non-market housing units on the subject site.\n- Revised report provides updated CD Guidelines to facilitate potential for additional units on the subject site.\n- City staff are exploring the option of adding additional units to the proposed development in coordination with BC Housing and CLT.\n- Finalized density and request for City housing grant will be subject of future Council report.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      2
    ],
    "type": "text",
    "createDate": "2024-02-06T18:01:20.712Z",
    "updateDate": "2024-02-06T18:01:20.712Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72972",
    "text": "Meeting: October 30, 2023\nFile: 49500 02 REZ 23-06\nCouncil Report to: Mayor & Council\nFrom: General Manager Planning and Development\nSubject: REZ #23-06 - Burnaby Lake Village Conceptual Master Plan Phase 1A - Bainbridge Urban Village Community Plan\nPurpose: Seek Council authorization to forward REZ #23-06 to a future Public Hearing.\nRecommendations:\n1. Prepare a Rezoning Bylaw for REZ #23-06 and advance it to First Reading and a Public Hearing.\n2. Authorize the introduction of a Housing Agreement Bylaw according to the terms outlined in Section 3.11 of the report.\n3. Establish prerequisites for the completion of the rezoning, including the submission of a suitable plan of development, advancement of the Burnaby Lake Village Conceptual Master Plan (REZ #22-28) to Final Adoption, deposit of sufficient monies for necessary services, installation of underground wiring, completion of subdivision, dedication of rights-of-way, registration of a Housing Covenant and Housing Agreement, submission of a Stormwater Management System, compliance with groundwater management guidelines, submission of geotechnical and groundwater study, execution of an indemnity agreement, submission of a Solid Waste and Recycling Plan, review of on-site loading facilities, provision of car wash stalls and garbage handling/recycling space, provision of facilities for cyclists, design of units adaptable to persons with disabilities, compliance with sound criteria and parking guidelines, submission of a Green Building Plan and Energy Benchmarking, submission of a Comprehensive Sign Plan, submission of a Site Disclosure Statement, and deposit of applicable charges.\nChief Administrative Officer's Comments: Concurs with the recommendation.\nExecutive Summary: Recommends bringing forward the Rezoning Bylaw for First Reading and forwarding it to a future Public Hearing. Provides information on the proposal for the construction of two mid-rise strata apartment buildings, a commercial podium, and a mid-rise market and rental building in accordance with Phase 1A of the Burnaby Lake Village Conceptual Master Plan.\nPolicy Section: The proposed rezoning application is consistent with various policies and plans adopted by Council.\nBackground: On June 5, 2023, Council granted Second Reading to REZ #22-28 for the Burnaby Lake Village Conceptual Master Plan. The subject site comprises Phase 1A of the Master Plan, including two mid-rise strata apartment buildings, a commercial podium, a mid-rise market and rental building, the Esplanade, and the Forest Walk.\n- Two new north-south streets will be created, one south from Lougheed Highway and one north from Winston Street, connected by a new east-west street called Esplanade.\n- The Phase 1A site is located on the south side of Lougheed Highway between Bainbridge Avenue and Sperling Avenue.\n- The site is designated for high-density mixed-use development, utilizing the RM5uv-a Multiple Family Residential District, RM5r Multiple Family Residential District, and the C2 Community Commercial District as guidelines.\n- The net Phase 1A site is approximately 9,564 m2 (102,946 sq. ft.) in size and is part of 6800 Lougheed Highway.\n- The current improvement on the site is an industrial building with surface parking.\n- On October 3, 2022, Council received an initial rezoning report proposing to rezone the subject development site in line with the Bainbridge Urban Village.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      2,
      3
    ],
    "type": "text",
    "createDate": "2024-02-06T18:00:49.533Z",
    "updateDate": "2024-02-06T18:00:49.533Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72966",
    "text": "Meeting: October 30, 2023\nFile: 49500 02 REZ #22-36\nCouncil Report from General Manager Planning and Development\nSubject: Rezoning Reference #22-36 - Commercial Rental Tower VII Brentwood Town Centre Development Plan\nPurpose: Seek Council authorization to forward REZ #22-36 to a future Public Hearing.\nReferences:\n- Address: Portion of 4567 Lougheed Highway\n- Legal: Portion of Lot 1 District Lots 123 and 124 Group 1 New Westminster District Plan EPP31990 Except Plans EPP40171, EPP59173 and EPP108674\n- Applicant: Shape Properties Corp.\n- Current Zoning: CD Comprehensive Development District (based on C3, C3a General Commercial District, P2 Administration and Assembly District, RM4s, RM5s Multiple Family Residential District, and Brentwood Town Centre Plan as guidelines)\n- Proposed Zoning: Amended CD Comprehensive Development District (based on C3 General Commercial District and Brentwood Town Centre Plan as guidelines and in accordance with the development plan entitled \"The Amazing Brentwood Phase 2C-Tower 7\" prepared by Arcadis Architects (Canada) Inc.)\nRecommendations:\n1. Prepare a Rezoning Bylaw for REZ #22-36 and advance it to First Reading and a Public Hearing at a future date.\n2. Establish prerequisites for the completion of the rezoning, including the submission of a suitable plan of development, deposit of sufficient monies for services, installation of underground electrical, telephone, and cable servicing, removal of existing improvements, dedication of necessary rights-of-way, and compliance with various guidelines and criteria.\nChief Administrative Officer's Comments: Concurs with the recommendation of the General Manager Planning and Development.\nExecutive Summary: A rezoning application has been received to construct a high-rise commercial rental residential apartment building in accordance with the Brentwood Site Conceptual Master Plan and associated Development Guidelines. Recommends bringing the Rezoning Bylaw forward for First Reading and forwarding the application to a future Public Hearing.\nPolicy Section: The proposed rezoning application is consistent with various policies and plans adopted by Council, including the Regional Context Statement, Corporate Strategic Plan, Official Community Plan, Brentwood Town Centre Development Plan, and others.\nBackground: On September 23, 2013, Council granted Final Adoption to REZ #11-22, establishing the Brentwood Site Conceptual Master Plan and associated Development Guidelines. The subject site is located within the Brentwood Town Centre Development Plan and is designated for C3 General Commercial District.\nThe CD Comprehensive Development District is being amended to the CD Comprehensive Development District. The proposed rezoning is based on the C3 General Commercial District and Brentwood Town Centre Plan as guidelines. The applicant has submitted a development plan for a Public Hearing.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      2,
      3
    ],
    "type": "text",
    "createDate": "2024-02-06T18:00:12.696Z",
    "updateDate": "2024-02-06T18:00:12.697Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72948",
    "text": "Meeting: October 30, 2023\nFile: REZ 22-09\nCouncil Report to: Mayor & Council\nFrom: General Manager Planning and Development\nSubject: REZ #22-09 – 5166 Halifax Street – Brentwood Town Centre Development Plan\nPurpose: Seek Council authorization to forward REZ #22-09 to a future Public Hearing.\nRecommendations:\n1. Authorize the introduction of a Housing Agreement Bylaw according to the terms outlined in Sections 3.2 and 3.8 of the report.\n2. Authorize the introduction of a Highway Closure Bylaw according to the terms outlined in Section 3.12 of the report.\n3. Approve the sale of City-owned property for inclusion within the development site.\n4. Prepare and advance a Rezoning Bylaw for REZ #22-09 to First Reading and a Public Hearing.\n5. Establish prerequisites for the completion of the rezoning.\nExecutive Summary: Rezoning application received for the construction of two mid-rise residential buildings with underground parking. Recommend bringing the Rezoning Bylaw forward for First Reading and forwarding the application to a future Public Hearing.\nPolicy Section: Proposed rezoning application consistent with various policies and plans adopted by Council.\nBackground: Council authorized staff to work with Amacon Development Corporation Inc. for the development of two sites within Brentwood Town Centre. Density transfer approved from Halifax Site to Rosser Site. Subject site currently improved with an older residential rental apartment building.\nGeneral Information: Proposed development plan includes two six-storey midrise, mixed-tenure rental residential buildings with an internal courtyard, amenity spaces, and underground parking. Demolition of existing site improvements and replacement with two buildings totaling 257 rental residential dwelling units.\n- Proposed development offers modern aesthetic, inclusive design, street-level unit access, shared amenity spaces, and communal courtyard.\n- Development provides range of housing types including studios, one-bedroom units, and family-oriented units such as three-bedroom and den units and three-bedroom townhouses.\n- Subject proposal exemplifies high quality urban design and architectural expression related to building's siting, massing, pedestrian orientation, and materiality.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      3,
      4
    ],
    "type": "text",
    "createDate": "2024-02-06T17:59:49.312Z",
    "updateDate": "2024-02-06T17:59:49.312Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72955",
    "text": "Meeting: October 30, 2023\nFile: REZ 22-08\nCouncil Report to: Mayor & Council\nFrom: General Manager Planning and Development\nSubject: REZ #22-08-2211 and 2271 Rosser Avenue-Brentwood Town Centre Development Plan\nPurpose: Seek Council authorization to forward REZ #22-08 to a future Public Hearing.\nRecommendations:\n1. Authorize the introduction of a Housing Agreement Bylaw according to the terms outlined in Sections 3.2 and 3.9 of the report.\n2. Authorize the introduction of a Highway Closure Bylaw according to the terms outlined in Section 3.14 of the report.\n3. Approve the sale of City-owned property for inclusion within the development site.\n4. Prepare and advance a Rezoning Bylaw to First Reading and a Public Hearing.\n5. Establish prerequisites to the completion of the rezoning.\nChief Administrative Officer's Comments: Concur with the recommendation.\nExecutive Summary: Rezoning application received for the construction of a high-rise residential building with commercial space and underground parking. Recommend bringing the Rezoning Bylaw forward for First Reading and forwarding the application to a future Public Hearing.\nPolicy Section: Proposed rezoning application consistent with various policies and plans adopted by Council.\nBackground: Council authorized staff to work with the applicant for the development of the subject site and another site. Density transfer approved for the subject site. Site is approximately 4,333 m2 in size and currently improved with industrial units and a residential sales centre. Designated for medium to high-density development under the Brentwood Town Centre Development Plan.\nHigh-density mixed-use development will be implemented using the RM4, RM4s, RM4r, and C9 Districts as guidelines. The C9 District designation is limited to commercial uses and applies only to 2211 Rosser Avenue. The addition of the C3 District designation is supported by staff to allow for the development of a hotel on the site. The hotel will complement the existing and potential future commercial and residential development in the area. The C3 District designation is limited to hotel use and does not allow for additional density beyond what is necessary for the hotel. The hotel and commercial uses will be located at 2211 Rosser Avenue.\n\nUnder the 's' zoning category, new developments are expected to provide community benefits, a sustainable redevelopment approach, public realm improvements including public art, high-quality urban design, and superior architectural expression. The applicant has submitted a suitable plan of development that meets these standards and can be presented at a Public Hearing.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      3,
      4
    ],
    "type": "text",
    "createDate": "2024-02-06T17:59:21.627Z",
    "updateDate": "2024-02-06T17:59:21.627Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72959",
    "text": "Meeting: October 30, 2023\nFile: 49500 02 REZ #22-06\nCouncil Report: To seek Council authorization to forward REZ #22-06 to a future Public Hearing.\nAddress: 4141 Lougheed Highway\nLegal: Lot 21 District Lot 119 Group 1 New Westminster District Plan 25896\nApplicant: Adam Nour, Millennium Properties Ltd.\nCurrent Zoning: M1 Manufacturing District\nProposed Zoning: CD Comprehensive Development District based on RM5s Multiple Family Residential District, RM5r Multiple Family Residential District, C3 General Commercial District, and the Brentwood Town Centre Development Plan as guidelines, and in accordance with the development plan entitled \"4141 Lougheed Hwy Mixed Use Development\" prepared by FaulknerBrowns Architects.\nRecommendations:\n1. Prepare a Rezoning Bylaw for REZ #22-06 and advance it to First Reading and a Public Hearing at a future date.\n2. Authorize the introduction of a Housing Agreement Bylaw according to the terms outlined in Sections 3.4 and 3.12 of the report, contingent upon the granting of Second Reading of the Rezoning Bylaw.\n3. Authorize the introduction of a Highway Closure Bylaw according to the terms outlined in Section 3.9 of the report, contingent upon the granting of Second Reading of the Rezoning Bylaw.\n4. Approve the sale in principle of City-owned property for inclusion within the subject development site according to the terms outlined in Section 3.9 of the report, and subject to the applicant pursuing the rezoning proposal to completion.\n5. Establish prerequisites to the completion of the rezoning, including the submission of a suitable plan of development, deposit of sufficient monies for all necessary services, installation of underground wiring, removal of existing improvements, utilization of an amenity bonus, completion of the Highway Closure Bylaw and sale of City property, consolidation of the project site into one legal parcel, dedication of requisite rights-of-way, granting of necessary statutory rights-of-way, easements, and/or covenants, registration of a Housing Covenant and Housing Agreement, submission of a suitable on-site Stormwater Management System, compliance with the City's Groundwater Management for Multi-Family Development guidelines.\n6. Require the posting of a sign on the subject site indicating the rezoning application and public hearing, or until all units are sold, whichever is greater.\nChief Administrative Officer's Comments: The Chief Administrative Officer concurs with the recommendation of the General Manager Planning and Development.\nExecutive Summary: A rezoning application has been received to permit the construction of a high-density mixed-tenure residential development atop a commercial/retail podium and underground parking. The purpose of this report is to provide Council with information on the proposal and recommend forwarding the rezoning application to a future Public Hearing.\nPolicy Section: The proposed rezoning application is consistent with various policies and plans adopted by Council.\nBackground: The subject site is part of the Buchanan West Master Plan and is designated for high-density mixed-use development. The site is currently improved with an older industrial warehouse building and surface parking. The initial rezoning report was received on June 20, 2022.\n\nDevelopment District will use RM5s Multiple Family Residential District, RM5r Multiple Family Residential District, C3 General Commercial District, and Brentwood Town Centre Development Plan as guidelines. Applicant submitted a development plan for two high-rise residential apartment buildings on top of a commercial/retail podium and underground parking. Vehicle access is currently through 1934 Gilmore Avenue and will also be provided from and to the east once 4199 Lougheed Highway is redeveloped. Pedestrian access is available from Lougheed Highway and the future east-west street on the site's northern portion. The development will be constructed in a single phase. It involves demolishing the existing warehouse and surface parking and constructing a 62-storey residential strata building (Building A) in the northeast corner and a 54-storey residential market and non-market rental building (Building B) in the southwest corner. Both buildings sit on a 10-storey commercial podium that includes a hotel(s) with amenities and retail units. The commercial podium can be used for offices or other employment generating uses if the hotel market softens in the future.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      3,
      4
    ],
    "type": "text",
    "createDate": "2024-02-06T17:58:39.672Z",
    "updateDate": "2024-02-06T17:58:39.672Z"
  },
  {
    "url": "https://pub-burnaby.escribemeetings.com/filestream.ashx?DocumentId=72944",
    "text": "Meeting: October 30, 2023\nFile: 49500 20 REZ 21-16\nCouncil Report: REZ #21-16 - 5292 and 5318 Kingsway - Mixed Use Development - Royal Oak Community Plan\nPurpose: Seek Council authorization to forward REZ #21-16 to a future Public Hearing.\nRecommendations:\n1. Prepare a Rezoning Bylaw for REZ #21-16 and advance it to First Reading and a Public Hearing.\n2. Authorize the introduction of a Housing Agreement Bylaw, contingent upon Second Reading of the Rezoning Bylaw.\n3. Authorize the introduction of a Highway Closure Bylaw, contingent upon Second Reading of the Rezoning Bylaw.\n4. Approve the sale of City-owned property for inclusion in the development site, subject to the completion of the rezoning proposal.\n5. Establish prerequisites for the completion of the rezoning, including the submission of a development plan, deposit of sufficient funds, installation of necessary services, consolidation of the project site, removal of existing improvements, registration of a Housing Agreement and Housing Covenant, submission of a stormwater management system, compliance with groundwater management guidelines, dedication of rights-of-way, and granting of necessary rights-of-way, easements, and covenants.\nChief Administrative Officer's Comments: Agrees with the recommendations.\nExecutive Summary: Rezoning application received for mixed-use development with two six-storey buildings and 85 residential units. Recommend bringing the Rezoning Bylaw forward for First Reading and a future Public Hearing.\nPolicy Section: Proposed rezoning application consistent with various policies and plans adopted by Council.\nBackground: Subject development site located along Kingsway and Grimmer Street. Initial rezoning report received in June 2021. Applicant proceeding with rezoning proposal despite potential future updates to the Royal Oak Community Plan. Proposal aligns with existing plan and medium density mixed-use designation.\nGeneral Information: Development proposal includes two six-storey buildings with commercial uses at grade and 85 residential units. Maximum potential density is 3.025 FAR.\n1. Retain original information, do not summarize.\n2. Shorten sentences without losing information.\n3. Only provide the results, do not explain anything.\n",
    "maxPages": 5,
    "pages": [
      0,
      1,
      3,
      4
    ],
    "type": "text",
    "createDate": "2024-02-06T17:58:13.472Z",
    "updateDate": "2024-02-06T17:58:13.472Z"
  },
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1-_Application_by_Terra_8120_Number_1_Road70930.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: October 25, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 21-945869\nRe: Application by Terra 8120 Number 1 Road Limited Partnership for Rezoning at 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” Zone to the “Low Density Townhouses (RTL4)” Zone\n\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10498, for the rezoning of 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, be introduced and given first reading.\n\nREPORT CONCURRENCE\nAffordable Housing\nCONCURRENCE OF GENERAL MANAGER\nCity of Richmond\n\nStaff Report\nOrigin: Terra 8120 Number 1 Road Limited Partnership (on behalf of Cliff Chun and Kai Shen Hsiung of 1296168 BC Ltd. and Yi Jen Wang and Kai Shen Hsiung of Terra West Properties Ltd.) has applied to the City of Richmond for permission to rezone 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, to permit the development of nine townhouse units, with vehicle access from No. 1 Road.\n\nFindings of Fact\n- The subject site consists of two lots located on the east side of No. 1 Road, between Blundell Road and Coldfall Road.\n- The subject site consists of two lots, each containing a single-family dwelling that is tenant occupied. The existing dwellings are proposed to be demolished.\n- Existing development surrounding the subject site includes three lots to the north, two with newer construction zoned “Compact Single Detached (RC1)” and one zoned “Single Detached (RS1/E)”, each containing a single-family dwelling.\n- Existing development to the south is a lot zoned “Single Detached (RS1/E)”, containing a single-family dwelling, and a large lot zoned “Low Density Townhouses (RTL4)”, containing 28 townhouses.\n- Existing development to the east consists of lots zoned “Single Detached (RS1/B)”, each containing a single-family dwelling fronting Corless Place.\n- Existing development to the west across No. 1 Road are compact lots zoned “Single Detached (RS1/K)” and “Compact Single Detached (RC1)”, each containing a single-family dwelling.\n\nRelated Policies & Studies\n- The Official Community Plan (OCP) land use designation for the subject properties is “Neighbourhood Residential”.\n- The Arterial Road Land Use Policy designation for the subject properties is “Arterial Road Townhouse”.\n- The development criteria for townhouses in the Arterial Road Land Use Policy call for land assembly with a minimum 50 m frontage on a major arterial road and avoiding the creation of residual sites with less than a 50 m frontage.\n- The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204.\n\nPublic Consultation\n- A rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\n\nAnalysis\n- The proposed development consists of nine townhouse units on a site that would be approximately 1,801.3 m2 (19,389 ft2) in area after the required 0.91 m wide road dedication along No. 1 Road.\n- The proposed site layout consists of one three-storey building along the west side of the site facing No. 1 Road, two two-storey duplex buildings along the east side of the site along the interface with existing single-family housing fronting Corless Place, and an internal drive-aisle that runs north-south between the front and rear buildings.\n- All units have an east-west orientation, with the main unit entries facing either No. 1 Road or the internal drive-aisle.\n- Private outdoor space for the units fronting No. 1 Road is proposed primarily in the form of front yards at ground level with secondary decks on the upper levels facing either No. 1 Road or the internal drive-aisle. Private outdoor space for the two-storey units is proposed primarily in the form of rear yards.\n- The location of the secondary upper decks will be refined during the Development Permit application review process.\n- Common outdoor amenity space is proposed in the southeast corner of the site and meets the minimum guidelines in the OCP.\n- The design of the common outdoor amenity space can be further examined during the DP application review process.\n- The common outdoor amenity space can be expanded when the adjacent property to the south is redeveloped for townhouses.\n- The applicant proposes to submit a contribution to the City's Leisure Facilities Reserve Fund instead of providing common indoor amenity space on-site.\n- The contribution for the nine-unit townhouse proposal is $18,594.00.\n- A City Statutory Right-of-Way (SRW) is registered on Title for the sanitary sewer and encroachment is not permitted.\n- The proposal is for nine strata-titled townhouse units.\n- A restrictive covenant will be registered on Title to prohibit rental restrictions and age-based restrictions on occupants.\n- Vehicle access to the site is proposed off No. 1 Road.\n- Pedestrian access to the street-fronting units will be provided via individual pathways.\n- On-site parking will be provided within each unit's garage.\n- Two visitor surface parking spaces will be provided off the internal drive-aisle.\n- Resident and visitor bike parking will be provided.\n- A Certified Arborist's Report has been submitted, identifying trees on-site and off-site.\n- Some trees on-site are in poor condition and should be removed and replaced.\n- Trees on neighboring properties will be retained and protected.\n- Tree protection measures will be implemented during the development stage.\n- A tree survival security of $5,000.00 will be required for one tree.\n- A total of 13 trees on-site are proposed to be removed.\n- 26 replacement trees are required to be planted on-site.\n- The applicant proposes to contribute $6,750.00 to the City's Tree Compensation Fund instead of planting the remaining nine replacement trees.\n- The applicant is required to submit a Landscaping Security prior to DP issuance.\n- Variance requests are being sought to reduce the minimum required lot width and allow six small vehicle parking spaces.\n- Staff is supportive of the variance requests.\n",
    "maxPages": 8,
    "pages": [],
    "type": "text",
    "createDate": "2024-02-06T04:49:42.022Z",
    "updateDate": "2024-02-06T04:49:42.023Z"
  }
]