[
  {
    "url": "https://citycouncil.richmond.ca/__shared/assets/1-_Application_by_Terra_8120_Number_1_Road70930.pdf",
    "text": "Report to Committee\nTo: Planning Committee\nDate: October 25, 2023\nFrom: Wayne Craig, Director, Development\nFile: RZ 21-945869\nRe: Application by Terra 8120 Number 1 Road Limited Partnership for Rezoning at 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” Zone to the “Low Density Townhouses (RTL4)” Zone\n\nStaff Recommendation: That Richmond Zoning Bylaw 8500, Amendment Bylaw 10498, for the rezoning of 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, be introduced and given first reading.\n\nREPORT CONCURRENCE\nAffordable Housing\nCONCURRENCE OF GENERAL MANAGER\nCity of Richmond\n\nStaff Report\nOrigin: Terra 8120 Number 1 Road Limited Partnership (on behalf of Cliff Chun and Kai Shen Hsiung of 1296168 BC Ltd. and Yi Jen Wang and Kai Shen Hsiung of Terra West Properties Ltd.) has applied to the City of Richmond for permission to rezone 8120 and 8140 No. 1 Road from the “Single Detached (RS1/E)” zone to the “Low Density Townhouses (RTL4)” zone, to permit the development of nine townhouse units, with vehicle access from No. 1 Road.\n\nFindings of Fact\n- The subject site consists of two lots located on the east side of No. 1 Road, between Blundell Road and Coldfall Road.\n- The subject site consists of two lots, each containing a single-family dwelling that is tenant occupied. The existing dwellings are proposed to be demolished.\n- Existing development surrounding the subject site includes three lots to the north, two with newer construction zoned “Compact Single Detached (RC1)” and one zoned “Single Detached (RS1/E)”, each containing a single-family dwelling.\n- Existing development to the south is a lot zoned “Single Detached (RS1/E)”, containing a single-family dwelling, and a large lot zoned “Low Density Townhouses (RTL4)”, containing 28 townhouses.\n- Existing development to the east consists of lots zoned “Single Detached (RS1/B)”, each containing a single-family dwelling fronting Corless Place.\n- Existing development to the west across No. 1 Road are compact lots zoned “Single Detached (RS1/K)” and “Compact Single Detached (RC1)”, each containing a single-family dwelling.\n\nRelated Policies & Studies\n- The Official Community Plan (OCP) land use designation for the subject properties is “Neighbourhood Residential”.\n- The Arterial Road Land Use Policy designation for the subject properties is “Arterial Road Townhouse”.\n- The development criteria for townhouses in the Arterial Road Land Use Policy call for land assembly with a minimum 50 m frontage on a major arterial road and avoiding the creation of residual sites with less than a 50 m frontage.\n- The proposed redevelopment must meet the requirements of the Richmond Flood Plain Designation and Protection Bylaw 8204.\n\nPublic Consultation\n- A rezoning sign has been installed on the subject property. Staff have not received any comments from the public about the rezoning application in response to the placement of the rezoning sign on the property.\n\nAnalysis\n- The proposed development consists of nine townhouse units on a site that would be approximately 1,801.3 m2 (19,389 ft2) in area after the required 0.91 m wide road dedication along No. 1 Road.\n- The proposed site layout consists of one three-storey building along the west side of the site facing No. 1 Road, two two-storey duplex buildings along the east side of the site along the interface with existing single-family housing fronting Corless Place, and an internal drive-aisle that runs north-south between the front and rear buildings.\n- All units have an east-west orientation, with the main unit entries facing either No. 1 Road or the internal drive-aisle.\n- Private outdoor space for the units fronting No. 1 Road is proposed primarily in the form of front yards at ground level with secondary decks on the upper levels facing either No. 1 Road or the internal drive-aisle. Private outdoor space for the two-storey units is proposed primarily in the form of rear yards.\n- The location of the secondary upper decks will be refined during the Development Permit application review process.\n- Common outdoor amenity space is proposed in the southeast corner of the site and meets the minimum guidelines in the OCP.\n- The design of the common outdoor amenity space can be further examined during the DP application review process.\n- The common outdoor amenity space can be expanded when the adjacent property to the south is redeveloped for townhouses.\n- The applicant proposes to submit a contribution to the City's Leisure Facilities Reserve Fund instead of providing common indoor amenity space on-site.\n- The contribution for the nine-unit townhouse proposal is $18,594.00.\n- A City Statutory Right-of-Way (SRW) is registered on Title for the sanitary sewer and encroachment is not permitted.\n- The proposal is for nine strata-titled townhouse units.\n- A restrictive covenant will be registered on Title to prohibit rental restrictions and age-based restrictions on occupants.\n- Vehicle access to the site is proposed off No. 1 Road.\n- Pedestrian access to the street-fronting units will be provided via individual pathways.\n- On-site parking will be provided within each unit's garage.\n- Two visitor surface parking spaces will be provided off the internal drive-aisle.\n- Resident and visitor bike parking will be provided.\n- A Certified Arborist's Report has been submitted, identifying trees on-site and off-site.\n- Some trees on-site are in poor condition and should be removed and replaced.\n- Trees on neighboring properties will be retained and protected.\n- Tree protection measures will be implemented during the development stage.\n- A tree survival security of $5,000.00 will be required for one tree.\n- A total of 13 trees on-site are proposed to be removed.\n- 26 replacement trees are required to be planted on-site.\n- The applicant proposes to contribute $6,750.00 to the City's Tree Compensation Fund instead of planting the remaining nine replacement trees.\n- The applicant is required to submit a Landscaping Security prior to DP issuance.\n- Variance requests are being sought to reduce the minimum required lot width and allow six small vehicle parking spaces.\n- Staff is supportive of the variance requests.\n",
    "maxPages": 8,
    "type": "text",
    "createDate": "2024-02-06T04:49:42.022Z",
    "updateDate": "2024-02-06T04:49:42.023Z"
  }
]